{"name": "Aegislash", "forms": {"Base": {"base stats": [60, 50, 150, 50, 150, 60], "types": ["Steel", "Ghost"], "abilities": ["Stance Change"], "tier": ["Uber"], "form": "Base"}, "Blade": {"base stats": [60, 150, 50, 150, 50, 60], "types": ["Steel", "Ghost"], "abilities": ["Stance Change"], "tier": ["Uber"], "form": "Blade"}}, "overview": "Suitable for a sword and shield, Aegislash operates as a fantastic pivot into common Ice-, Psychic-, Rock-, and Steel-type moves, safely taking minimal damage and threatening a big hit in return. Thanks to its ability, Stance Change, Aegislash functionally has amazing all-around stats with base 150 offenses and defenses. Sadly, this comes with a few drawbacks. To change formes, Aegislash must use King's Shield, which is superior to Protect in that it also sharply lowers an offending foe's Attack, but inferior due to failing to block status moves such as Taunt, Leech Seed, and Spore. Aegislash also must play carefully to avoid taking hits in its Blade forme, which is too frail to benefit from Aegislash's great defensive typing and thus forces Aegislash to use King's Shield more often than other Pokemon might need to use Protect. Aegislash's low Speed works in its favor here, making it more common for Aegislash to take hits in Shield forme, but this low Speed can also inhibit its ability to be a true offensive powerhouse. Still, Aegislash's diverse movepool and good role compression provide it a strong place in the metagame. With a decent degree of versatility in its moves and item choices, including access to the sparingly distributed Wide Guard, Aegislash is rarely deadweight and can adapt to fit most teams.\n", "strategies' format": "Doubles", "strategies": [{"name": "Bulky Attacker", "stats": [219, 136, 336, 218, 337, 112], "type": ["Steel", "Ghost"], "usage": "Aegislash operates best early- and mid-game as a pivot that takes hits, forces a switch, and deals respectable damage to a foe on its way in. However, if Aegislash is your primary check to a threatening Pokemon like Deoxys-A, make sure you keep it healthy enough to keep that threat in check. Watch out for slow attackers like Scrafty, as Aegislash is unlikely to survive a super effective or strong neutral hit in Blade forme. King's Shield helps with protection there, so use it to restore Aegislash's bulk while keeping in mind that it won't protect from status moves. If Aegislash is running Wide Guard, use it primarily to protect a teammate from a spread move instead of just to help Aegislash; that way, the target of the foe's spread move is able to get off a strong hit. If Aegislash itself is the primary target of an expected spread move, King's Shield will usually be a better move. If Aegislash carries Substitute, use it when the opponent can't break it or on a predicted switch. However, don't bother setting Substitute if the opponent has a Hoopa-U, as it will be able to KO Aegislash through the Substitute and you will waste Aegislash's HP.", "moves": [["Shadow Ball"], ["Flash Cannon"], ["Wide Guard", "Substitute"], ["King's Shield"]], "item": [" Spooky Plate", " Leftovers"], "ability": ["Stance Change"], "nature": ["Quiet"], "ev spread": [252, 0, 0, 252, 4, 0], "iv spread": [31, 31, 31, 31, 31, 0]}], "counters": ["Dark-types", "Fire-types", "Ground-types", "Taunt and Encore"], "credits": ["Written by talkingtree", "Earlier versions by talkingtree", "Quality checked by GenOne and Level 51", "Grammar checked by The Dutch Plumberjack and A Cake Wearing A Hat"]}