{"name": "Aggron", "forms": {"Base": {"base stats": [70, 110, 180, 60, 60, 50], "types": ["Steel", "Rock"], "abilities": ["Heavy Metal", "Rock Head", "Sturdy"], "tier": ["PU"], "form": "Base"}, "Mega": {"base stats": [70, 140, 230, 60, 80, 50], "types": ["Steel"], "abilities": ["Filter"], "tier": ["UU"], "form": "Mega"}}, "overview": "Mega Aggron carves its niche in the OU metagame as a reliable answer to non-Focus Punch Mega Mawile and Icium Z Kyurem-B on stall teams while being a good entry hazard setter on its own. Its pure Steel typing, gigantic Defense stat, and ability Filter also allow it to deal with some other of the metagame's most common and dangerous physical attackers such as Choice-locked Kartana, both Tyranitar formes, and Mega Pinsir. With a high base Attack stat, Mega Aggron is also able to pressure some other threats to stall teams, such as Clefable and Mega Diancie, unlike stall's other Mega Evolution option in Mega Sableye. Furthermore, its superb movepool makes Mega Aggron capable of using various practical moves in the last moveslot, letting it check different threats depending on the needs of the team it is on. Unfortunately, Mega Aggron needs hard support in form of Wish from its teammates to keep healthy due to its lack of reliable recovery, which distinguishes it from Mega Sableye and even Mega Slowbro. Even with a damage-reducing ability, Mega Aggron's Special Defense is not always sufficient, making it struggle against stronger special attackers such as Firium Z Heatran, Focus Blast Magearna, and Fightinium Z Tapu Lele.\n", "strategies' format": "OU", "strategies": [{"name": "Mega Tank", "stats": [238, 330, 496, 140, 270, 137], "type": ["Steel"], "usage": "Try to lead with Aggron, especially if the last move that you are using is Protect, and Mega Evolve as soon as possible in order to get rid of its poor defensive typing. If it is not possible to Mega Evolve Aggron on the first turn, try to bring Aggron in with a free switch, as even a resisted special move can make Aggron lose a lot of its health and consequently make it more dependent on Wish to heal. Avoid letting Mega Aggron's HP get too low; if that occurs, Mega Aggron can become unable to pivot into the Pokemon that it normally could. When pivoting, try to bring it in against special attackers that fear and can't do much against it such as Tornadus-T without Focus Blast and Mega Latios or against physical attackers such as Mega Pinsir and Weavile. Entry hazards, specially Spikes, can be somewhat detrimental to Mega Aggon, as it turns some 3HKOs against it turn into 2HKOs, such as Offensive Landorus-T's Earthquake and Choice Specs Tapu Lele's Psychic, leaving it unable to pivot into those threats. Therefore, try to keep them off your side of the field in order to preserve Mega Aggron's ability to consistently swallow hits. Mega Aggron's ability to pressure opposing hazard setters, such as Clefable and Mega Diancie, must be used as much as possible, so try to predict the opponent switching one of them in and double switch into them; since Mega Aggron can OHKO the former with little chip damage and outright eliminate the latter with ease, they will be discouraged from attempting to set up hazards. However, beware of Mega Diancie's Earth Power, as it can weaken Mega Aggron to a point where it can no longer switch in on threats without the risk of being KOed. Also, be wary of switching in on coverage moves from Mega Mawile and Tapu Lele; for example, pivoting in on Focus Punch Mawile will make Mega Aggron lose more than half of its health, while pivoting in on Focus Blast Tapu Lele will result in Mega Aggron getting 2HKOed, and in both cases Mega Aggron will be unable to check the threats it used to. With this, scouting for those moves is fundamental.", "moves": [["Stealth Rock"], ["Heavy Slam"], ["Earthquake"], ["Ice Punch", "Fire Punch", "Protect"]], "item": [" Aggronite"], "ability": ["Sturdy"], "nature": ["Careful"], "ev spread": [248, 56, 0, 0, 200, 4], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Water-type Pokemon", "Fire-type Pokemon", "Special Attacking Wallbreakers", "Status", "Setup Sweepers"], "credits": ["Written by OldAmberPlays", "Quality checked by lyd, Indigo Plateau,  and Finchinator", "Grammar checked by Kris and The Dutch Plumberjack"]}