{"name": "Amaura", "forms": {"Base": {"base stats": [77, 59, 50, 67, 63, 46], "types": ["Rock", "Ice"], "abilities": ["Refrigerate", "Snow Warning"], "tier": ["LC"], "form": "Base"}}, "overview": "By virtue of its amazing offensive typing, which offers unresisted coverage alongside Earth Power, Amaura secures itself a niche in LC as a good offensive check to Flying-types and as a potent revenge killer with a Choice Scarf. Its access to two good abilities in Snow Warning, which grants it a 100% accurate Blizzard and chip damage on foes, and Refrigerate, which provides Amaura with an immensely powerful Hyper Voice and the ability to bypass Substitute, further bolsters its offensive presence. Furthermore, Amaura has a rather diverse special movepool, with access to useful moves like Thunderbolt, Earth Power, and Flash Cannon in addition to its STAB moves, which allows it to sufficiently cover most of the metagame. Unfortunately, despite its offensive prowess, Amaura has an absolutely awful defensive typing, with 4x weaknesses to Fighting- and Steel-type attacks, weaknesses to common priority moves such as Aqua Jet and Vacuum Wave, and a weakness to Stealth Rock. Amaura is also hurt by its poor Speed, which leaves it either reliant on a Choice Scarf to outspeed foes, or outsped and threatened by common Pokemon such as Mienfoo, Pawniard, and Diglett. Lastly, Amaura suffers from a general lack of power behind any of its Rock-type STAB attacks, which keeps it from hitting too hard with them unless used against targets that take super effective damage and at times can also limit its overall neutral coverage.\n", "strategies' format": "LC", "strategies": [{"name": "Choice Scarf", "stats": [205, 138, 136, 247, 162, 185], "type": ["Rock", "Ice"], "usage": "Due to the good Speed Choice Scarf provides Amaura with, this set's best use is as a revenge killer, particularly of Pokemon weak to Ice-type attacks such as Vullaby, Doduo, and Snivy. Amaura can, however, try cleaning up late-game after its checks have been removed or weakened, though it can at times weaken its checks enough to KO them considering the power of its attacks. If Amaura is attempting to sweep late-game, it's best that Fighting-types and Steel-types are removed, as most Pokemon of these types can tank a hit and take advantage of Amaura's 4x weakness to their STAB attacks to KO it. Although Amaura can dent Water-types with Thunderbolt, it is best that they are also weakened or removed before Amaura attempts to clean up late-game, as most can survive a Thunderbolt and potentially KO Amaura with super effective STAB attacks. Priority users like Corphish and Croagunk are also important to remove, as they can capitalize on Amaura's poor typing to KO it before it can even attack. Faster Choice Scarf users like Rufflet and Doduo should be scouted out in order to make full use of Amaura, as these threats will otherwise outpace and OHKO it with their respective coverage options. If Amaura wishes to use Hyper Beam to muscle past and revenge kill a bulkier foe, it must be weakened first. Spritzee, bulky Mienfoo, and Ferroseed are the main examples of bulky Pokemon Amaura will need weakened to break with Hyper Beam. Amaura is often capable of forcing switches due to the metagame's general lack of Ice-resistant Pokemon and should thus capitalize on this by switching out on a predicted switch to bring out ateammate capable of taking on the foe switched into play. Lastly, due to its susceptibility to Diglett, Amaura should be wary of being locked into Thunderbolt or Ancient Power, as neither move will do sufficient damage to Diglett, which can then easily trap and revenge kill Amaura in return.", "moves": [["Blizzard", "Hyper Voice"], ["Earth Power"], ["Thunderbolt"], ["Ancient Power", "Hyper Beam"]], "item": [" Choice Scarf"], "ability": ["Snow Warning", "Refrigerate"], "nature": ["Modest", "Timid"], "ev spread": [60, 0, 0, 220, 0, 228], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Steel-types", "Fighting-types", "Faster Choice Scarf Users", "Water-types", "Munchlax"], "credits": ["Written by Hilomilo", "Quality checked by Xayah, Corporal Levi,  and Nineage", "Grammar checked by talkingtree and The Dutch Plumberjack"]}