{"name": "Axew", "forms": {"Base": {"base stats": [46, 87, 60, 30, 40, 57], "types": ["Dragon"], "abilities": ["Mold Breaker", "Rivalry", "Unnerve"], "tier": ["LC"], "form": "Base"}}, "overview": "With a high base Attack, decent Speed, and access to Dragon Dance, Axew is able to sweep teams once given the chance to set up. Unfortunately, it struggles against Fairy- and Steel-types when locked into Outrage, though they're vulnerable to Axew's coverage moves. Due to Axew's lack of bulk, powerful offensive Pokemon such as Mienfoo and Vullaby make it hard for it to set up. Because of these factors, even at +1 Axew is often unable to sweep until late-game after the opposing team has been weakened.\n", "strategies' format": "LC", "strategies": [{"name": "Dragon Dance Sweeper", "stats": [145, 265, 156, 86, 116, 225], "type": ["Dragon"], "usage": "Axew is best used as a late-game sweeper when its checks have been weakened or removed. Using Superpower too much may prevent Axew from sweeping effectively, as Axew sorely needs its Attack boosts to have a reasonable shot at OHKOing enemies. Dragon Dance should only be used when Axew has an opening to set up or when there's a chance Axew will be able to take a hit. Examples of Pokemon that can be set up on by Axew would be Stunky and Lileep. Also, if Axew is locked into Outrage against something that resists it such as a Steel-type, Axew won't be able to do much damage and is prone to being counterattacked. When a Fairy-type is switched in to nullify Outrage, Axew will be able to use Iron Tail after Outrage has been blocked. However, if a Fairy-type comes in for a revenge kill, they're still able to get a free hit on Axew. Superpower can be used to hit a predicted Steel-type switch-in, and Poison Jab can be used to hit Fairy switch-ins. Axew should also be wary of priority on the opponent's team when attempting a sweep and has to look out for super effective coverage from Pokemon like Staryu and Timburr.", "moves": [["Dragon Dance"], ["Outrage", "Dual Chop"], ["Superpower"], ["Iron Tail", "Poison Jab"]], "item": [" Eviolite"], "ability": ["Mold Breaker"], "nature": ["Jolly", "Adamant"], "ev spread": [68, 220, 0, 0, 0, 220], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fairy-types", "Priority", "Steel-types", "Ice-type Moves", "Status"], "credits": ["Written by Black Hokage", "Quality checked by Xayah, Fiend, Corporal Levi,  and Hilomilo", "Grammar checked by GatodelFuego and The Dutch Plumberjack"]}