{"name": "Azelf", "forms": {"Base": {"base stats": [75, 125, 70, 125, 70, 115], "types": ["Psychic"], "abilities": ["Levitate"], "tier": ["UU"], "form": "Base"}}, "overview": "Azelf sits in a nigh-unmatched Speed tier, which, alongside its access to great utility options like Stealth Rock, Knock Off, and Taunt, allows it to excel on hyper offensive teams as an extremely reliable suicide lead. Azelf also possesses fantastic offensive stats and can capitalize on its access to powerful moves like Explosion and Fire Blast to wear opposing teams down before fainting. Unfortunately, Azelf's defenses are among the worst in the tier, which keeps it from taking advantage of its good offenses outside of its role as a suicide lead. This also makes Azelf extremely predictable, which can allow common Pokemon in Mega Aerodactyl, Scizor, and Choice Scarf Infernape to be used as adequate countermeasures. Azelf is also hurt by the prevalence of entry hazard removal in the tier, which can prevent it from keeping Stealth Rock up and, due to its frailty, setting it more than once.\n", "strategies' format": "UU", "strategies": [{"name": "Suicide Lead", "stats": [186, 349, 176, 258, 176, 361], "type": ["Psychic"], "usage": "Azelf functions best as a suicide lead on hyper offensive teams, which means that more often than not, it is best to bring Azelf into play first. However, some opponents may use counters, making it necessary to bring out a teammate capable of dealing with these threats first. Due to Azelf's poor bulk, Stealth Rock should almost always be used first, though Taunt should be used against opposing leads that are likely to set their own entry hazards or inflict Azelf with status, such as Swampert, Hippowdon, and Terrakion. Knock Off can also be used in certain situations, such as against Choice Scarf users like Hydreigon, Krookodile, and Infernape. This allows Azelf to set Stealth Rock while also crippling these Pokemon, though it's worth noting that it likely won't be able to use Explosion. Azelf will usually opt to use Stealth Rock and then Explosion soon after. It is possible, however, to preserve Azelf for later on in the match after setting Stealth Rock, as with Focus Sash and Explosion, it can act as a decent revenge killer to boosted sweepers.", "moves": [["Stealth Rock"], ["Explosion"], ["Taunt"], ["Knock Off", "Fire Blast"]], "item": [" Focus Sash"], "ability": ["Levitate"], "nature": ["Jolly", "Naive"], "ev spread": [0, 252, 0, 4, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Faster Pokemon", "Dark-types", "Strong Priority", "Rapid Spin and Defog"], "credits": ["Written by Hilomilo", "Quality checked by SmashBrosBrawl, Eyan,  and dodmen", "Grammar checked by Eyan and The Dutch Plumberjack"]}