{"name": "Beedrill", "forms": {"Base": {"base stats": [65, 90, 40, 45, 80, 75], "types": ["Bug", "Poison"], "abilities": ["Sniper", "Swarm"], "tier": ["Untiered"], "form": "Base"}, "Mega": {"base stats": [65, 150, 40, 15, 80, 145], "types": ["Bug", "Poison"], "abilities": ["Adaptability"], "tier": ["UU"], "form": "Mega"}}, "overview": "By virtue of amazing offensive stats and Adaptability, Mega Beedrill is among the best offensive pivots available. Its typing allows it to provide heavy offensive pressure to common Pokemon such as Primarina and Latias, while its access to good coverage options like Drill Run and Knock Off lets it hit the majority of the tier quite hard. Mega Beedrill also has access to Toxic Spikes, which it can use as it forces switches to wear down opposing Pokemon. However, Mega Beedrill has atrocious bulk, which leaves it vulnerable to Choice Scarf users, strong priority, and the ever-present Mega Aerodactyl. Its Stealth Rock-weak typing also keeps it from properly functioning as a pivot without an entry hazard remover on its team, thus complicating building with Mega Beedrill at times. Lastly, Mega Beedrill struggles to break past a few big presences in the tier, including Hippowdon, Scizor, and Mega Aerodactyl, due to its only decent coverage.\n", "strategies' format": "UU", "strategies": [{"name": "Offensive Pivot", "stats": [166, 399, 116, 59, 197, 427], "type": ["Bug", "Poison"], "usage": "Mega Beedrill is best used as an offensive pivot due to its ability to force switches and gain momentum with U-turn throughout the entire match. U-turn should be used frequently early-game in order to sufficiently chip members of the opposing team. Upon forcing switches, Mega Beedrill can attempt to use either super effective coverage or Toxic Spikes rather than U-turn, depending on what it believes to be switching in or the team it's against. If a Ghost-type check or a Pokemon reliant on its item, like Swampert or Hippowdon, is predicted to come in, Knock Off is ideal to use in order to cripple them. However, Toxic Spikes can also be used as passive foes switch in due to Beedrill's ability to easily pivot out of play after setting a layer of them. Due to its frailty, Mega Beedrill should generally refrain from directly switching in, and instead it is better brought into play with the support of a pivot or after a teammate has fainted. Entry hazards should also be removed prior to switching Mega Beedrill in, as its Stealth Rock weakness in tandem with its frailty is quite capable of limiting its longevity. Mega Beedrill should refrain from staying in on priority users like Scizor, Zygarde-10%, and Mega Absol due to its aforementioned frailty.", "moves": [["U-turn"], ["Poison Jab"], ["Drill Run"], ["Knock Off", "Toxic Spikes", "Pursuit"]], "item": [" Beedrillite"], "ability": ["Swarm"], "nature": ["Jolly"], "ev spread": [0, 252, 0, 0, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Mega Aerodactyl", "Crobat", "Physically Bulky Pokemon", "Choice Scarf Users", "Strong Priority", "Pursuit", "Steel-types"], "credits": ["Written by Hilomilo", "Quality checked by A Cake Wearing A Hat, Amaroq,  and Bouff", "Grammar checked by The Dutch Plumberjack and Fireflame479"]}