{"name": "Beheeyem", "forms": {"Base": {"base stats": [75, 75, 75, 125, 95, 40], "types": ["Psychic"], "abilities": ["Analytic", "Synchronize", "Telepathy"], "tier": ["Untiered"], "form": "Base"}}, "overview": "Beheeyem possesses a huge base Special Attack stat, making it a powerful wallbreaker. This is further augmented by Analytic boosting the power of Beheeyem's attacks when it moves last. Due to its access to both Trick Room and Nasty Plot, Beheeyem can effectively function versus offensive and defensive teams alike. This is furthered by Beheeyem's incredibly low Speed stat of 40, which allows it to outspeed virtually the entire tier under Trick Room and take full advantage of Analytic when outside of Trick Room. However, only passable bulk in addition to its terrible Speed stat mean that Beheeyem finds few opportunities to set up and is easily forced out by many offensive threats. This is further exacerbated by a poor defensive typing in Psychic, which bestows few useful resistances outside of Fighting. Psychic also isn't a great offensive typing to have in a tier rife with powerful Dark-types such as Skuntank and Spiritomb and their STAB Sucker Punch. Compounding these issues, Beheeyem struggles to make room for Recover, leaving it easily worn down throughout the match and vulnerable to priority. Beheeyem also faces heavy competition from Mesprit and Musharna outside of Trick Room, with Mesprit having a much better speed tier and more versatile movepool, while Musharna has much better bulk and makes for a more potent slow setup sweeper. Lastly, Beheeyem faces competition as a dedicated Trick Room special sweeper from Pokemon with better offensive and defensive typings such as Wishiwashi, which hits harder with better bulk, and Alolan Exeggutor, which also has better coverage and access to Trick Room.\n", "strategies' format": "PU", "strategies": [{"name": "Offensive Trick Room", "stats": [248, 155, 188, 383, 226, 76], "type": ["Psychic"], "usage": "Going for a Trick Room sweep while Beheeyem's counters are still healthy is a waste of time. While Beheeyem can punch holes in the opponent's team early-game, its HP should be conserved to maximize the chance of using Trick Room and sweeping unless it is paired with a Healing Wish user such as Audino or Musharna; in this case, it can be used as a de-facto wallbreaker until it is required to sweep. Due to this, focus on wearing down and KOing Pokemon such as Spiritomb and Skuntank in order to facilitate a sweep. Later in the game when these checks and counters are weakened or eliminated, going for the sweep with Trick Room is the way to go. Emphasize on eliminating Dark-types, as they prevent Beheeyem from spamming its STAB Psychic and waste valuable Trick Room turns in the process. The choice of whether to use Nasty Plot or Trick Room first depends on the situation. Nasty Plot, if used before Trick Room, gives Beheeyem one more turn to attack under Trick Room. However, using Trick Room first gives Beheeyem more flexibility in choosing whether to attack or boost, which is more advantageous against more offensive teams where a Nasty Plot boost may not be required to sweep. Bring Beheeyem in with a slow pivot or after a teammate has been sacrificed, as it needs as much HP as possible to pull off the two-turn setup of Trick Room and Nasty Plot. Beheeyem can take advantage of passive Pokemon such as defensive Mesprit, Audino, and Clefairy and set up on them, as it is not immediately threatened by any of their offensive options. It should be wary of Toxic from these Pokemon, however, as the residual poison damage can easily cut the sweep short. Lastly, make sure to save the Z-Move for Beheeyem's checks or counters, as Beheeyem hits plenty hard enough at +2 to KO neutral targets.", "moves": [["Trick Room"], ["Psychic", "Psyshock"], ["Nasty Plot"], ["Signal Beam", "Hidden Power Ground"]], "item": [" Psychium Z", " Colbur Berry"], "ability": ["Analytic"], "nature": ["Quiet"], "ev spread": [248, 0, 8, 252, 0, 0], "iv spread": [31, 0, 31, 31, 31, 0]}], "counters": ["Dark-types", "Steel-types", "Faster Pokemon", "Priority"], "credits": ["Written by leonard (from big bang theory)", "Quality checked by allstarapology, Megazard,  and Darkinium", "Grammar checked by allstarapology and martha"]}