{"name": "Carvanha", "forms": {"Base": {"base stats": [45, 90, 20, 65, 20, 65], "types": ["Water", "Dark"], "abilities": ["Rough Skin", "Speed Boost"], "tier": ["LC"], "form": "Base"}}, "overview": "Carvanha is the epitome of a glass cannon, with great offensive potential and almost nonexistent defensive abilities. With Speed Boost, Carvanha quickly becomes hard to outspeed, which generally can act to offset its paper-like defenses. However, Carvanha is reliant on KOing the opposition, as otherwise it is KOed in return. Thankfully, this is not too much of an issue, with Carvanha having two excellent STAB attacks and decent coverage options to support them. This makes Carvanha pretty hard to wall, especially considering its ability to act as either a physical or special attacker.\n", "strategies' format": "LC", "strategies": [{"name": "Physical Life Orb", "stats": [104, 291, 85, 149, 85, 225], "type": ["Water", "Dark"], "usage": "Using Carvanha is rather straightforward, as the goal is to hit as hard as possible and KO as many Pokemon as possible. Carvanha should never switch in, as even resisted attacks can do over 50% damage to it. This does not mean Carvanha should not be used early-game, however; in fact, it is rather good at wallbreaking for itself early on in the match. Generally, Carvanha should just use its strongest attack, use Protect when a Speed boost is needed, or use Aqua Jet to pick off a weak and faster foe.", "moves": [["Waterfall"], ["Crunch"], ["Psychic Fangs"], ["Protect", "Aqua Jet"]], "item": [" Life Orb"], "ability": ["Speed Boost"], "nature": ["Adamant"], "ev spread": [0, 196, 36, 0, 36, 236], "iv spread": [9, 31, 31, 31, 31, 31]}, {"name": "Special Life Orb", "stats": [104, 194, 85, 247, 76, 225], "type": ["Water", "Dark"], "usage": "Carvanha plays in a pretty straightforward manner. This set aims to pick off normal Carvanha counters such as Snubbull by surprise, meaning Hydro Pump should be used with pretty high frequency. Carvanha should refrain from KOing low-health Pokemon that the opponent does not need to save, however, as otherwise this ruins the set's surprise factor. Similarly, Carvanha should refrain from switching in on an incoming attack due to its absurd frailty.", "moves": [["Hydro Pump"], ["Dark Pulse"], ["Ice Beam"], ["Protect"]], "item": [" Life Orb"], "ability": ["Speed Boost"], "nature": ["Modest"], "ev spread": [0, 0, 36, 236, 0, 236], "iv spread": [9, 31, 31, 31, 31, 31]}], "counters": ["Fighting-type Priority", "Stufful", "Fairy-types", "Bulky Pokemon", "Choice Scarf 17+ Speed Pokemon"], "credits": ["Written by Fiend", "Quality checked by Corporal Levi, Rowan,  and Nineage", "Grammar checked by P Squared and The Dutch Plumberjack"]}