{"name": "Chansey", "forms": {"Base": {"base stats": [250, 5, 5, 35, 105, 50], "types": ["Normal"], "abilities": ["Healer", "Natural Cure", "Serene Grace"], "tier": ["OU"], "form": "Base"}}, "overview": "Chansey's monstrous HP and high Special Defense stats make it the bulkiest special wall in the tier, boasting the ability to reliably handle the majority of the special attackers that the OU tier has to offer. To further accentuate its defensive prowess, Chansey has access to a plethora of viable utility moves such as Stealth Rock, Toxic, Thunder Wave, and Heal Bell, which makes it a must on almost all stall teams. On the flipside, while Chansey's measly Defense stat is covered for by its gargantuan HP stat combined with heavy EV investment, Chansey is still overwhelmed by physical attackers with setup moves such as Swords Dance Landorus-T and Kartana. Chansey's defensive typing is also interesting; while a Normal typing grants it only a single weakness, it also means Chansey has no resistances and only a single immunity. Furthermore, as is the case for many defensive Pokemon, Chansey is relatively slow and somewhat passive, relying heavily on Seismic Toss or status moves in order to inflict damage, meaning it can be relatively easily exploited by a number of offensive Pokemon. Lastly, Chansey is heavily reliant on Eviolite, as without it, Chansey is significantly less bulky and greatly struggles to check some of the more powerful offensive threats that it is usually tasked to handle.\n", "strategies' format": "OU", "strategies": [{"name": "Defensive", "stats": [598, 41, 119, 106, 248, 136], "type": ["Normal"], "usage": "Chansey requires near full health in order to reliably deal with powerful special attackers such as Mega Charizard Y, so make sure Chansey is recovering often in order to remain healthy throughout the duration of the match. Be wary of Knock Off, as Eviolite is what allows it to be the powerful defensive threat that it is. There are a wide number of Pokemon such as Clefable, Mega Venusaur, Tangrowth, Tornadus-T, and Alomomola that utilize Knock Off for defensive utility. Try not to switch to Chansey in situations such as these until you are confident that it is safe to do so.", "moves": [["Seismic Toss"], ["Toxic"], ["Stealth Rock", "Heal Bell"], ["Soft-Boiled"]], "item": [" Eviolite"], "ability": ["Natural Cure"], "nature": ["Bold"], "ev spread": [248, 0, 252, 0, 8, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fighting-types", "Physical Wallbreakers", "Losing Eviolite", "Taunt Users"], "credits": ["Written by false", "Quality checked by Colonel M, Halcyon.,  and Finchinator", "Grammar checked by Eyan and piikachuu"]}