{"name": "Cottonee", "forms": {"Base": {"base stats": [40, 27, 60, 37, 50, 66], "types": ["Grass", "Fairy"], "abilities": ["Chlorophyll", "Infiltrator", "Prankster"], "tier": ["LC"], "form": "Base"}}, "overview": "Cottonee's Knock Off-resistant typing, expansive movepool, and fantastic ability in Prankster altogether make it one of Little Cup's best pivot and support Pokemon on offensive and balanced teams. Its plethora of useful resistances allows it to reliably check Fighting- and Water-type Pokemon such as Mienfoo and Carvanha, while its expansive utility movepool, consisting of Memento, Tailwind, and Encore, allows it to make full use of its ability and support its team. Furthermore, Cottonee has access to the coveted priority Z-Memento, which allows it to heal a teammate upon use and nearly guarantee their setup. Unfortunately, Cottonee's 4x weakness to Poison-type attacks makes it susceptible to getting KOed by surprise Poison-type coverage moves from Pokemon that it would otherwise check. Despite its Fairy typing, Cottonee is also unable to check most Dark-types due to its inability to hit them with moves affected by Prankster. Furthermore, Cottonee is weak to common attack types in Ice, Flying, Fire, and Steel, is quite frail without heavy investment, and lacks an outstanding offensive presence even with maximum investment.\n", "strategies' format": "LC", "strategies": [{"name": "Offensive Prankster", "stats": [125, 81, 166, 146, 146, 248], "type": ["Grass", "Fairy"], "usage": "It is of utmost importance that Cottonee's inability to hit Dark-type Pokemon with Prankster-boosted moves is noted, as it will fail to check Dark-type setup sweepers such as Scraggy and Vullaby. It is because of this that Encore and Z-Memento shouldn't be used on these foes to prevent generating free turns for the opponent. Cottonee's Prankster ability allows it to switch into resisted attacks and setup moves and lock foes into these moves with priority Encore. It is best for Cottonee to use Z-Memento when weakened, as this will allow it to safely bring in a teammate without wasting all of said teammate's HP immediately. Cottonee can also opt to use Z-Memento against threats that will likely OHKO it, such as Sludge Bomb Diglett and Gastly. If running Knock Off, Cottonee can use the move when predicting switches into Pokemon like Magnemite, Croagunk, and Ponyta in order to remove their items. Tailwind is best used when Cottonee is low on HP, as it allows Cottonee's teammates to receive a temporary 2x boost in Speed upon switching in after it has fainted. Cottonee must be wary of Poison-type coverage from foes, given its 4x weakness to the type. Diglett and Scraggy commonly carry Poison-type coverage and should have their potential coverage moves scouted out so Cottonee is able to properly check these threats. It is worth noting that Cottonee's attacks aren't capable of OHKOing most threats, which means that it will often require prior damage from either entry hazards or teammates to secure KOs on threats such as Pawniard and Vullaby. If Cottonee is running Z-Memento, the sweeper it is trying to support should feel free to set up and punch holes early-game, as it will likely be healed by Cottonee later on.", "moves": [["Giga Drain", "Hidden Power Fighting"], ["Dazzling Gleam", "Hidden Power Fighting"], ["Encore", "Knock Off"], ["Memento", "Knock Off", "Tailwind"]], "item": [" Darkinium Z", " Eviolite"], "ability": ["Prankster"], "nature": ["Timid"], "ev spread": [36, 0, 40, 144, 40, 232], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Poison-types", "Steel-types", "Fire-types", "Flying-types", "Spritzee"], "credits": ["Written by Hilomilo", "Quality checked by sparktrain, Xayah, OP,  and Nineage", "Grammar checked by Fireflame479 and CryoGyro"]}