{"name": "Croagunk", "forms": {"Base": {"base stats": [48, 61, 40, 61, 40, 50], "types": ["Poison", "Fighting"], "abilities": ["Anticipation", "Dry Skin", "Poison Touch"], "tier": ["LC"], "form": "Base"}}, "overview": "Croagunk's unique typing and ability let it compress a variety of roles into a single team slot and serve as a fantastic glue Pokemon for offensive teams. Due to its typing, Croagunk has resistances to the common Fighting- and Dark-type moves, and due to its Dry Skin ability, it has a pseudo-immunity to Water. With these resistances, Croagunk becomes one of the few Pokemon in Little Cup with the ability to check all of the Pokemon that rely on these types, such as Chinchou, Mienfoo, Timburr, Pawniard, and Carvanha. Croagunk's typing is helpful offensively as well, as the only relevant Pokemon that resist its STAB coverage are Ghost-types, which it can hit with Knock Off, and other Poison-types. Additionally, Croagunk's wide movepool and acceptable all-around base stats allow it to customize its moveset and thus fit on a wide variety of teams. Access to Knock Off and various forms of priority, including Sucker Punch and Vacuum Wave, further improve Croagunk's ability to support its teammates. However, Croagunk's typing gives it weaknesses to the common Flying- and Ground-type moves and a susceptibility to being trapped and KOed by Diglett. Additionally, Croagunk's Speed is quite low, which leaves it susceptible to being revenge killed by a large portion of the metagame, though its access to priority somewhat remedies this.\n", "strategies' format": "LC", "strategies": [{"name": "Special Attacker", "stats": [145, 142, 145, 225, 145, 145], "type": ["Poison", "Fighting"], "usage": "Croagunk should be brought in to check Pokemon that can't deal significant damage to it, such as Timburr, Mienfoo, Corphish, and Chinchou. After coming in, Croagunk will usually force a foe out. Against balanced and bulky offensive teams, it is generally better to either switch Croagunk out or attack early-game, as if Croagunk sets up, it will often be forced out immediately by the foe that comes in. Against slower-paced teams, hyper offensive teams, and balanced and bulky offense teams that have been worn down significantly, Croagunk can use Nasty Plot to begin punching holes in the opponent's team. Although this Croagunk set can be used as a glue Pokemon and switch directly into attacks that threaten its team, keep in mind that the lack of any kind of recovery means that it will get worn down quite easily, so bringing Croagunk in without it taking a hit is ideal when possible. Keep in mind that even with Eviolite, Croagunk is not especially bulky, so avoid allowing it to take super effective or powerful neutral hits while it is still needed in a match.", "moves": [["Nasty Plot"], ["Sludge Bomb"], ["Focus Blast"], ["Vacuum Wave"]], "item": [" Eviolite", " Berry Juice"], "ability": ["Dry Skin"], "nature": ["Modest"], "ev spread": [52, 0, 116, 188, 116, 36], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Mixed Utility", "stats": [165, 165, 145, 203, 145, 122], "type": ["Poison", "Fighting"], "usage": "Croagunk should be used as a glue Pokemon and brought in against the Pokemon that it checks, such as Fighting-types, Water-types, and Dark-types that don't carry coverage to beat it, most notably Mienfoo, Timburr, Corphish, Pawniard, and non-Psychic Staryu variants. Because Croagunk is used as a glue Pokemon, it should not be expected to deal high amounts of damage or repeatedly take powerful hits it doesn't resist. Instead, it should be preserved and switched in and out of battle, recovering HP with Drain Punch as needed, to deal with the threats it needs to check on an opposing team; specifically, it should be kept around for Fighting-, Dark-, and Water-types that its team can't deal with. Opposing setup sweepers such as Scraggy and Shellder fit this bill as well: Croagunk should be preserved while these Pokemon exist on the foe's team so it can revenge kill them with Vacuum Wave. If the opposing team has a Diglett, play cautiously with Croagunk to prevent it from getting trapped, potentially leaving your team open to a Pokemon that Croagunk checks. Opposing pivots such as Mienfoo and Chinchou, which Croagunk can check, become more threatening when paired with Diglett because they can bring Croagunk in and pivot into Diglett, so keep this in mind. Throughout a match, Croagunk tends to force switches because it checks such a variety of Pokemon. Use these switches, especially early-game, to use Knock Off and weaken the opposing team by removing defensive items.", "moves": [["Knock Off"], ["Sludge Bomb"], ["Vacuum Wave"], ["Drain Punch", "Sucker Punch"]], "item": [" Eviolite"], "ability": ["Dry Skin"], "nature": ["Quiet"], "ev spread": [132, 28, 116, 108, 116, 0], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Physical Support", "stats": [145, 225, 145, 142, 145, 145], "type": ["Poison", "Fighting"], "usage": "This Croagunk makes for a fantastic glue Pokemon and should be directly switched into the myriad of Pokemon it checks, including Mienfoo, Timburr, Chinchou, and Cottonee. After being switched in, Croagunk can take advantage of its wide coverage to pressure the opposing team. Croagunk should be kept healthy as long as it is needed to check foes. Avoid allowing it to take super effective or powerful neutral hits, as Croagunk's defenses are mediocre even when boosted by Eviolite. Additionally, Drain Punch should be used as much as possible to keep Croagunk's health up. Be wary of Pokemon such as Ponyta that can burn Croagunk, drastically lowering its effectiveness for a match. Knock Off should be used often to weaken foes by removing their defensive items and to put pressure on opposing teams by threatening to remove said items. Because Croagunk has only mediocre Attack and Sucker Punch does not get boosted by STAB, it does not hit particularly hard. For this reason, it should usually be used as a way to pick off weakened and faster foes, not as a reliable method of dealing damage. Be especially wary of opposing Diglett, which can come in after Croagunk secures a KO, trap it, and remove it from the match, allowing a foe that Croagunk checks such as Bulk Up Timburr to sweep. Sucker Punch is not a reliable way of dealing with Diglett, as it frequently runs Substitute, forcing Croagunk into mind games, and it only takes out Diglett if it is severely weakened. Croagunk should use Bulk Up on a predicted switch to surprise an incoming foe that will become unable to KO it after it has a Defense boost.", "moves": [["Drain Punch"], ["Gunk Shot"], ["Knock Off", "Thief", "Bulk Up"], ["Sucker Punch", "Bulk Up"]], "item": [" Eviolite"], "ability": ["Dry Skin"], "nature": ["Adamant"], "ev spread": [52, 188, 116, 0, 116, 36], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Poison-types", "Ground-types", "Ghost-types", "Super Effective Attacks"], "credits": ["Written by Nineage", "Quality checked by Hilomilo, Xayah,  and OP", "Grammar checked by Wob and The Dutch Plumberjack"]}