{"name": "Darumaka", "forms": {"Base": {"base stats": [70, 90, 45, 15, 45, 50], "types": ["Fire"], "abilities": ["Hustle", "Inner Focus"], "tier": ["LC"], "form": "Base"}}, "overview": "Darumaka is a great wallbreaker with its exceptional base Attack and a great ability in Hustle, as it 2HKOes almost everything that doesn't resist it with Flare Blitz. Darumaka has access to other great moves like U-turn, allowing it to pivot, as well as good coverage in Superpower, Zen Headbutt, and Rock Slide. However, despite Hustle boosting Darumaka's Attack, it also lowers its accuracy, which can cost Darumaka a lot of damage or a KO from the foe if it misses. Its poor bulk and Flare Blitz recoil make it easy to wear down and really hard to switch in. Furthermore, it has a weakness to Stealth Rock, limiting how many times it can be switched in, as well as common Ground- and Water-types. Its awkward Speed tier forces it to hold a Choice Scarf, which leaves it easily revenge killed by a threat that resists the move it's Choice locked into.\n", "strategies' format": "LC", "strategies": [{"name": "Choice Scarf", "stats": [205, 265, 126, 59, 126, 203], "type": ["Fire"], "usage": "Darumaka acts as a revenge killer, since it will usually move first while holding a Choice Scarf. It's a wallbreaker as well because of its sheer power that is able to severely dent bulky Pokemon. It's best to remove any entry hazards, especially Stealth Rock, from your side of the field before switching Darumaka in to prevent it from being worn down easily. A slow U-turn or Volt Switch can help bring Darumaka in safely due to its poor bulk and tendency to wear itself down with Flare Blitz. Avoid being Choice locked into Flare Blitz when the opponent has a Flash Fire user, such as Houndour or the rare Flash Fire Ponyta, as it can kill all momentum. U-turn is often a safe option that can be used to scout out the foe as well as gain momentum for your team, but it can miss.", "moves": [["Flare Blitz"], ["U-turn"], ["Superpower"], ["Rock Slide", "Zen Headbutt"]], "item": [" Choice Scarf"], "ability": ["Hustle"], "nature": ["Jolly"], "ev spread": [116, 196, 0, 0, 0, 196], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Water-types", "Stealth Rock", "Rock-types"], "credits": ["Written by crusty", "Quality checked by Hilomilo, Xayah,  and Quote", "Grammar checked by Rakan and P Squared"]}