{"name": "Delphox", "forms": {"Base": {"base stats": [75, 69, 72, 114, 100, 104], "types": ["Fire", "Psychic"], "abilities": ["Blaze", "Magician"], "tier": ["NU"], "form": "Base"}}, "overview": "Delphox is a threatening Pokemon in NU due to its high Speed and Special Attack, great offensive typing, and fairly vast movepool that allows it to fulfill a number of roles, including a setup sweeper that breaks through defensive cores, a Wish passer, and a revenge killer that can also clean late-game. While it isn't perfect defensively, Delphox's typing in tandem with its decent bulk gives it the ability to soft check some of the most common special attackers such as Magmortar and Whimsicott as well as Fighting-types like Hariyama and Passimian. Delphox's access to useful coverage moves in Dazzling Gleam and Grass Knot also allows it to bypass a lot of typical Fire-type checks such as Guzzlord, Seismitoad, and Rhydon, and its access to moves such as Calm Mind, Trick, and Wish gives it the ability to support both itself and its teammates. However, Delphox suffers from an unfortunate weakness to Stealth Rock, which limits its ability to check the previously mentioned Pokemon consistently. Delphox's typing also leaves it vulnerable to Dark- and Rock-types such as Sneasel, Houndoom, and Aerodactyl as well as their STAB moves in Pursuit, Sucker Punch, and Stone Edge.\n", "strategies' format": "NU", "strategies": [{"name": "Calm Mind", "stats": [186, 156, 180, 327, 237, 337], "type": ["Fire", "Psychic"], "usage": "Since Delphox excels against slower, more defensive teams, avoid playing recklessly against them and letting Delphox acquire too much damage beforehand in order to use it to its fullest potential. If Delphox is not holding a Colbur Berry, it is rather vulnerable to Dark-types and Pursuit trappers, meaning that preserving it until these Pokemon have been removed may prove useful; however, if a teammate needs a certain defensive core broken through in order to reliably sweep late-game, Delphox can be used to wallbreak for them instead. Exercise caution in regard to using Firium Z. It should mainly be used after Delphox has used Calm Mind in order to break through bulkier foes such as Mega Audino and Piloswine or if Delphox really can't afford to miss against foes like Steelix. While Delphox doesn't appreciate taking a lot of damage before it attempts to set up, it is capable of taking resisted special attacks from Pokemon such as Sceptile.", "moves": [["Calm Mind"], ["Fire Blast"], ["Psychic", "Dazzling Gleam"], ["Grass Knot"]], "item": [" Grassium Z", " Firium Z", " Colbur Berry"], "ability": ["Blaze"], "nature": ["Timid"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Wish + Protect", "stats": [249, 156, 180, 271, 236, 331], "type": ["Fire", "Psychic"], "usage": "Delphox should mainly switch in on special attackers that it checks such as Mega Abomasnow and Whimsicott; however, Delphox must be wary of Earthquake from Mega Abomasnow. Using Wish against these Pokemon as well as others like Steelix is ideal, since Delphox forces them out and can safely use Protect on the following turn to regain HP. Against Choice-locked Pokemon such as Guzzlord and Sneasel, use Protect in order to scout which move they lock themselves into and act accordingly. Toxic should be used whenever Delphox anticipates a Pokemon that it cannot otherwise deal with such as Incineroar, Slowking, or Vaporeon to switch in. Be wary of Toxic from Pokemon such as Mega Audino, as it greatly hinders this set and limits Delphox's ability to check Pokemon like Klinklang while still maintaining longevity. Refrain from switching in if Stealth Rock is up, as this heavily pressures Delphox and forces it to use Wish more often than it would like to.", "moves": [["Wish"], ["Protect"], ["Mystical Fire"], ["Toxic"]], "item": [" Leftovers"], "ability": ["Blaze"], "nature": ["Timid"], "ev spread": [252, 0, 0, 28, 0, 228], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Scarf", "stats": [186, 156, 180, 327, 237, 337], "type": ["Fire", "Psychic"], "usage": "Delphox should mainly be used as a revenge killer due to its high Speed and Special Attack, although it is capable of serving as a late-game cleaner as well. Exercise caution when it comes to using Psychic if the opposing team has a Dark-type like Incineroar or Sneasel, since they can switch into Delphox after it KOes a foe and either set up on it as it switches out or remove it with Pursuit. Delphox should mainly switch in on resisted special attacks such as Moonblast from Whimsicott and Fire Blast from Magmortar; however, note that Stealth Rock will limit its ability to handle these attacks. Trick should mainly be used against defensive teams, as losing Delphox's Choice Scarf isn't as detrimental against them compared to offensive teams and it can effectively hamper bulkier Pokemon like Slowking. However, be sure to scout for Z-Moves on Pokemon like Blastoise before using Trick, since it will fail and force Delphox out.", "moves": [["Fire Blast"], ["Psychic", "Psyshock"], ["Dazzling Gleam", "Grass Knot"], ["Trick"]], "item": [" Choice Scarf"], "ability": ["Blaze"], "nature": ["Timid"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Dark-types and Pursuit Trappers", "Bulky Water-types", "Bulky Rock-types", "Specially Defensive Pokemon", "Revenge Killers"], "credits": ["Written by allstarapology", "Quality checked by banks, Earth,  and quziel", "Grammar checked by The Dutch Plumberjack and martha", "Earlier version by Colonel M"]}