{"name": "Drapion", "forms": {"Base": {"base stats": [70, 90, 110, 60, 75, 95], "types": ["Poison", "Dark"], "abilities": ["Battle Armor", "Keen Eye", "Sniper"], "tier": ["RU"], "form": "Base"}}, "overview": "Bearing a good offensive and defensive typing, above average Speed, access to Swords Dance, and access to useful coverage moves such as Aqua Tail and Earthquake, Drapion carves itself a niche as a decent sweeper and wallbreaker in RU. Its decent Speed allows it to outspeed common Pokemon like Roserade and non Choice Scarf Gardevoir to hit them super effectively with either its STAB attacks or its coverage moves. Drapion is an effective Z-Move user, capable of utilizing Hydro Vortex to break past bulky Ground-types that would otherwise check it such as Donphan and Rhyperior. Furthermore, Drapion is one of the few Pursuit trappers in the tier; it can trap dangerous Ghost- and Psychic-types such as Mismagius, Cresselia, Metagross, and Bronzong. However, while Drapion does have a few advantages over other Pursuit trappers such as Sneasel or Honchkrow, namely a better defensive typing and much better bulk, which let it more easily switch into the Pokemon it is meant to trap, the higher offensive threat the other Pursuit trappers pose is sometimes appreciated more. Furthermore, despite having decent Speed, Drapion still fails to outpace offensive Pokemon that can threaten it such as Flygon and Shaymin. Due to its low Special Defense, Drapion also is highly susceptible to strong special attackers that outpace it like Salazzle and Swellow. It also struggles a great deal to break through many defensive Pokemon such as Mandibuzz, Pyukumuku, and Milotic due to its somewhat lackluster Attack stat in comparison to other Choice Band and Swords Dance users. Drapion relies heavily on Choice Band, Swords Dance, and Z-Moves to boost its damage output, since its base 90 Attack otherwise causes it to be extremely underwhelming as a sweeper and wallbreaker.\n", "strategies' format": "RU", "strategies": [{"name": "Choice Band", "stats": [176, 279, 256, 140, 187, 317], "type": ["Poison", "Dark"], "usage": "Use Knock Off liberally early-game, as many Pokemon dislike having their item removed. However, try to predict if the opponent tries to send in a Pokemon with an irremovable item or a resistance to Dark, such as Mega Ampharos or Florges, and hit them with the appropriate coverage move. Due to its immunity to Toxic, Drapion can switch into predicted uses of Toxic to Pursuit trap and eliminate foes like Bronzong. Drapion's excellent defensive typing allows it to also  switch into Pokemon like Mismagius, Roserade, and variants of Shaymin lacking Earth Power in a pinch. Despite their relative rarity, burns and paralysis severely limit Drapion's effectiveness as a wallbreaker. Drapion's lacking Special Defense leaves it vulnerable to strong special attackers like Salazzle and Swellow that can outpace Drapion and dent it severely with their STAB attacks, so it's advised to not stay in against these types of foes. However, most special attackers dislike switching into Drapion's attacks.", "moves": [["Knock Off"], ["Poison Jab"], ["Aqua Tail", "Earthquake"], ["Pursuit"]], "item": [" Choice Band"], "ability": ["Sniper"], "nature": ["Jolly"], "ev spread": [0, 252, 0, 0, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Swords Dance", "stats": [176, 279, 257, 140, 186, 317], "type": ["Poison", "Dark"], "usage": "Drapion can be sent early-game to chip at entry hazard setters with Knock Off and Aqua Tail. Once its checks have been eliminated, it can set up in front of a passive wall such as Cresselia and proceed to clean the opposing team. Due to its immunity to Toxic, it can set up on Pokemon that rely on Toxic to damage foes like Bronzong. Drapion's excellent defensive typing allows it to comfortably set up on Pokemon like opposing Drapions, Tsareena and Shaymin not carrying Earth Power. Despite their relative rarity, burns and paralysis severely limit its effectiveness as a breaker and sweeper, respectively. Drapion's lacking Special Defense leaves it vulnerable to strong special attackers like Salazzle or Swellow can outpace Drapion and dent it severely with their STAB attacks, so it's advised to not stay in against these types of foes.", "moves": [["Swords Dance"], ["Knock Off"], ["Poison Jab"], ["Aqua Tail"]], "item": [" Waterium Z"], "ability": ["Sniper"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Faster Attackers", "Status Conditions", "Ground-types", "Unaware Pokemon", "Physically Bulky Pokemon", "Poison-types"], "credits": ["Written by zizalith", "Quality checked by Phantom, Mr Aldo,  and Teachable", "Grammar checked by A Cake Wearing A Hat and The Dutch Plumberjack"]}