{"name": "Durant", "forms": {"Base": {"base stats": [58, 109, 112, 48, 48, 109], "types": ["Bug", "Steel"], "abilities": ["Hustle", "Swarm", "Truant"], "tier": ["RUBL"], "form": "Base"}}, "overview": "Durant is a hard-hitting, niche sweeper in the UU metagame and is able to hit harder than Scizor due to Hustle. While Hustle's accuracy drop can cost matches, particularly with moves like Rock Slide having nearly 70% accuracy, it can be remedied with Hone Claws or bypassed through the use of a Z-Move. Durant's nice Speed tier lets it outrun and pressure most of the Fighting-types in the tier, including Cobalion, Terrakion, and Infernape lacking a Choice Scarf, and its higher Speed tier and unique coverage enable it to beat Pokemon Scizor can't, such as Moltres, Chandelure, and Rotom-H. However, the combination of Hustle's unreliability and Durant's fragility ultimately makes Durant subpar when compared to Scizor, which boasts better bulk, can take better advantage of its typing, and can apply more pressure with its priority moves. Durant can be blown back by all the faster special attackers in tier, such as Gengar, Latias, and Starmie, due to its poor Special Defense stat despite having one of the best defensive typings in the game. With Scizor being a top-tier threat, measures normally taken for Scizor on opposing teams, such as Fire Punch Mega Aggron and Babiri Berry Togekiss, can make Durant's job harder.\n", "strategies' format": "UU", "strategies": [{"name": "Hone Claws", "stats": [152, 317, 260, 118, 133, 348], "type": ["Bug", "Steel"], "usage": "Durant should be wallbreaking early-game and trying to sweep late-game. Durant is best brought in through pivoting support, through double switches, or after a teammate has fainted, since it cannot take hits well. Due to its fragility, Durant's best chances to set up are when it is forcing a switch against threatening Pokemon like Terrakion and Mamoswine. Durant struggles to set up more than once in a game, so ensure that faster Pokemon are removed before boosting, and use free turns for attacking. Remain wary of potential Choice Scarf users that Durant would otherwise pressure, such as Hydreigon and Infernape. Look out for stray Fire-type coverage moves on Pokemon like Latias, Florges, and Mega Sceptile, as they can cut Durant's setup short. Keep Durant healthy early-game so it can have enough HP to set up later in the match and pull off a sweep. Save Durant's Corkscrew Crash for bulky Pokemon that otherwise cannot be broken through, such as Gligar and Chesnaught.", "moves": [["Hone Claws"], ["Iron Head"], ["Superpower"], ["Rock Slide", "Crunch"]], "item": [" Steelium Z"], "ability": ["Hustle"], "nature": ["Jolly"], "ev spread": [0, 252, 0, 0, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fast Special Attackers", "Bulky Water-types", "Ghost-types", "Fire-types and Fire-type Coverage"], "credits": ["Written by Scizorphobic", "Quality checked by Hilomilo, A Cake Wearing A Hat,  and martha", "Grammar checked by Kris and The Dutch Plumberjack"]}