{"name": "Dusknoir", "forms": {"Base": {"base stats": [45, 100, 135, 65, 135, 45], "types": ["Ghost"], "abilities": ["Frisk", "Pressure"], "tier": ["Untiered"], "form": "Base"}}, "overview": "Dusknoir is a niche spinblocker with its main attribute being its high defensive stats. This allows it to switch in and spinblock with less fear of being greatly weakened. However, this niche is limited with Dusknoir's poor HP stat and lack of a form of recovery. Its solid movepool is another thing Dusknoir has going for it, with great coverage and priority, but this is held back by Dusknoir's lack of a strong STAB option. This, alongside Dusknoir's only average Attack stat, makes it pretty passive even when holding a Choice Band. Golurk and Spiritomb both outclass Dusknoir because they possess secondary typings; offensively, Golurk has a powerful STAB Earthquake and Spiritomb has a strong STAB Sucker Punch and Pursuit, and defensively, their typing gives them more resistances and immunities.\n", "strategies' format": "PU", "strategies": [{"name": "Choice Band", "stats": [179, 328, 306, 149, 306, 137], "type": ["Ghost"], "usage": "Dusknoir's main goal throughout the game is to switch into Rapid Spin users like Kabutops and Alolan Sandslash to serve as a spinblocker. It can also switch into other moves it resists or is immune to such as Scyther's Bug Bite and Primeape's Close Combat. However, Dusknoir has to watch out for coverage like Kabutops's Knock Off, neutral STAB moves like Scyther's Aerial Ace, and support moves like Alolan Sandslash's Toxic. Dusknoir also serves as a wallbreaker, although it's somewhat unreliable due to its passiveness at times. Because it is locked into a single move, using Dusknoir requires a lot of predicting switches. Especially watch out for Pokemon like Skuntank, which can Pursuit trap Dusknoir if you get the prediction wrong. Otherwise, Dusknoir can use Shadow Sneak to serve as a revenge killer to pick off foes like Jynx and Alolan Raichu or Trick to cripple a foe late-game when it is at low health.", "moves": [["Earthquake"], ["Shadow Sneak"], ["Ice Punch"], ["Trick"]], "item": [" Choice Band"], "ability": ["Frisk"], "nature": ["Adamant"], "ev spread": [212, 252, 0, 0, 0, 44], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Dark-types", "Physical Walls", "Normal-types", "Wallbreakers"], "credits": ["Written by UberSkitty", "Quality checked by tondas, TONE,  and TJ", "Grammar checked by Fireflame479 and The Dutch Plumberjack"]}