{"name": "Espeon", "forms": {"Base": {"base stats": [65, 65, 60, 130, 95, 110], "types": ["Psychic"], "abilities": ["Magic Bounce", "Synchronize"], "tier": ["RU"], "form": "Base"}}, "overview": "Espeon is a wallbreaker capable of punching holes into most balance builds, boasting great power when running Calm Mind or Choice Specs to overcome checks such as Bronzong and Mandibuzz. Nice coverage, a good Speed tier, a high Special Attack stat, and access to recovery in Morning Sun are some of the traits Espeon has to offer. Without a doubt, though, the flashiest aspect of Espeon comes from its ability Magic Bounce, which sends back any status moves and hazards to its user. However, Espeon's high Speed and Special Attack are obfuscated by its mediocre bulk, being only able to take very few special hits. Morning Sun also is a move with abysmal PP, which can be detrimental when Espeon attempts to set up. Despite having good ways to deal with Ghost- and Dark-types, it is still frail and very susceptible to Pursuit trapping. Due to not being able to switch into a lot of hits, Espeon usually needs pivoting to work properly.\n", "strategies' format": "RU", "strategies": [{"name": "Calm Mind", "stats": [166, 149, 157, 359, 226, 350], "type": ["Psychic"], "usage": "Use Magic Bounce to your benefit by switching into possible status moves, such as Toxic and Thunder Wave, and into passive hazard users, such as Bronzong and Registeel, to reflect entry hazards and get setup opportunities. Make use of forced switches to use Calm Mind and deal with whatever comes in. After a Calm Mind boost, Espeon can even deal with the likes of Choice Scarf Gardevoir and Salazzle much more easily. When running Electrium Z, you can bluff Choice Specs and make switch-ins feel comfortable by taking a resisted or ineffective Psychic, just to start setting up or hit them with a super effective move. Note that not all Pursuit trappers can deal with Espeon; Drapion, Escavalier, and Doublade can all be dealt with via Gigavolt Havoc after some residual damage or a boost. However, faster Pursuit trappers such as Sneasel and Choice Scarf Drapion may stop Espeon dead in its tracks. Snorlax is the only Pursuit trapper that can always KO Espeon due to its great Special Defense.", "moves": [["Calm Mind"], ["Psychic"], ["Shadow Ball"], ["Morning Sun", "Zap Cannon"]], "item": [" Leftovers", " Electrium Z"], "ability": ["Magic Bounce"], "nature": ["Timid"], "ev spread": [0, 0, 4, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Specs", "stats": [166, 149, 157, 359, 226, 350], "type": ["Psychic"], "usage": "Make sure Espeon will get in safely, be it with smart switching into status moves or with pivoting. Although Magic Bounce allows Espeon to bounce back entry hazards, you must measure very well when it's time to switch in, since Espeon can be wrecked by Bronzong's Gyro Ball or Mega Steelix's Heavy Slam. Choose wisely what move Espeon will get locked into; opposing Pokemon can take advantage of a Choice-locked Espeon, especially the likes of Escavalier, Snorlax, and Drapion, which can Pursuit trap it when it's locked into Psychic. Trick is a powerful tool that allows Espeon to limit the utility of many defensive switch-ins, so try to Trick Espeon's Choice Specs onto Pokemon like Bronzong, Registeel, and Cresselia.", "moves": [["Psychic"], ["Shadow Ball"], ["Dazzling Gleam"], ["Trick", "Hidden Power Fire"]], "item": [" Choice Specs"], "ability": ["Magic Bounce"], "nature": ["Timid"], "ev spread": [0, 0, 4, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Steel-types", "Dark-types", "Specially Defensive Pokemon", "Faster Pokemon", "Priority Moves"], "credits": ["Written by GustavoYAY", "Quality checked by roman, teachable,  and avocado", "Grammar checked by The Dutch Plumberjack and lotiasite"]}