{"name": "Exeggutor", "forms": {"Base": {"base stats": [95, 95, 85, 125, 75, 55], "types": ["Grass", "Psychic"], "abilities": ["Chlorophyll", "Harvest"], "tier": ["Untiered"], "form": "Base"}}, "overview": "Exeggutor's niche in the PU tier is being a sun sweeper with access to Chlorophyll, doubling its Speed in sun. It also has a massive base 125 Special Attack stat with a 120-Base Power STAB Solar Beam and coverage in Psyshock to hit specially defensive Pokemon like Hitmonchan and Eelektross. Exeggutor has decent physical bulk, which lets it switch into resisted moves like Close Combat from Primeape and Zing Zap from Togedemaru, and it also resists priority moves like Mach Punch and Aqua Jet from Gurdurr, Hitmonchan, and Carracosta. Unfortunately, Exeggutor is weak to the prevalent Sucker Punch from Pokemon like Skuntank, Absol, and Spiritomb and has to rely on Sleep Powder to get around users of the move. Exeggutor has low special bulk, so it takes heavy damage from strong special attacks like Chatot's Boomburst. Exeggutor also has a low base Speed of 55, so even under sun, Exeggutor is still outsped by Choice Scarf users such as Primeape and Togedemaru. Exeggutor also possesses a crippling 4x weakness to Bug, leaving it rather vulnerable to U-turn from Pokemon like Mesprit and the previously mentioned Choice Scarf users. Outside of sun, Exeggutor is effectively unable to use one of its STAB moves, Solar Beam, leaving it more vulnerable to Pokemon such as Golurk and Mesprit. Finally, Exeggutor faces strong competition from other sun sweepers such as Victreebel, Sawsbuck, and Leafeon and competes with them for a teamslot on sun teams.\n", "strategies' format": "PU", "strategies": [{"name": "Chlorophyll Sweeper", "stats": [226, 203, 206, 383, 187, 209], "type": ["Grass", "Psychic"], "usage": "As soon as sun is set up, it is ideal to bring in Exeggutor to start attempting to sweep. Exeggutor can be brought in safely on a resisted move like Golurk's Earthquake, with U-turn from Liepard, Mesprit, or Volbeat, or from a free switch after Regirock has used Explosion. While Exeggutor is on the field, it should be using its offensive moves as much as possible. Hidden Power Fire is boosted by sun and hits Fire-weak Pokemon very hard. Solar Beam is very spammable and can break through defensive cores while sun is active. Before sun ends, using Sleep Powder would be ideal if Exeggutor is outsped the next turn so it can either do more damage or switch out to one of the team's sun setters like Mesprit or Liepard. If Exeggutor is running Sunny Day as the fourth move, it is best to use it when Exeggutor is brought in against something like Clefairy that can't deal meaningful damage to Exeggutor so it can set sun freely. Exeggutor struggles against the multitude of Dark-types in the tier and is very weak to Sucker Punch. To get around this, Exeggutor has to use Sleep Powder so the Dark-types like Absol are unable to OHKO it, and Exeggutor gets free turn to attack them.", "moves": [["Solar Beam"], ["Psyshock", "Psychic"], ["Hidden Power Fire"], ["Sleep Powder"]], "item": [" Life Orb"], "ability": ["Chlorophyll"], "nature": ["Modest"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Faster Attackers", "Opposing Weather Setters", "Dark-types"], "credits": ["Written by Toy Time King", "Quality checked by allstarapology, yogi,  and Megazard", "Grammar checked by A Cake Wearing A Hat and Fireflame479"]}