{"name": "Gigalith", "forms": {"Base": {"base stats": [85, 135, 130, 60, 80, 25], "types": ["Rock"], "abilities": ["Sand Force", "Sand Stream", "Sturdy"], "tier": ["NUBL"], "form": "Base"}}, "overview": "Gigalith's access to Sand Stream, which boosts its Special Defense by 50%, makes it an extremely durable Pokemon with its base 85 / 130 / 80 bulk. Sand Stream is the biggest factor in making Gigalith a good Pokemon, as it makes Stoutland an incredible threat, removes sun, hinders moves such as Synthesis and Moonlight, and provides chip damage that can be an annoyance to the opponent (but to the user as well). Gigalith's movepool is also diverse enough with access to moves such as Stealth Rock, making it one of the most effective users of it, along with Stone Edge, Rock Blast, and Earthquake. In addition, with its Rock typing and incredible defenses, Gigalith makes for a good check against a number of threats such as Swellow, Salazzle, Dragalge, Stoutland, and Ninetales. All that said, its typing also gives it a weakness to the common Water- and Ground-types in the tier such as Slowbro, Milotic, Rhyperior, and Flygon. Additionally, Gigalith is pitifully slow, has no recovery outside of Leftovers, and has to compete with other Rock-types in the tier, including Rhyperior, which can be more hard hitting, and Diancie, which has more utility with its Fairy typing and access to Heal Bell.\n", "strategies' format": "RU", "strategies": [{"name": "Specially Defensive", "stats": [269, 306, 297, 140, 284, 86], "type": ["Rock"], "usage": "Use Gigalith to set up Stealth Rock early in the game, and then try to keep it alive to potentially check Pokemon like Swellow and Salazzle later. Use Toxic to cripple bulky switch-ins such as Slowbro and Gligar. Additionally, if you have Stoutland, then consider keeping Gigalith to set up sand in preparation for Stoutland's sweep.", "moves": [["Stealth Rock"], ["Stone Edge", "Rock Blast"], ["Earthquake"], ["Toxic"]], "item": [" Leftovers"], "ability": ["Sand Stream"], "nature": ["Careful"], "ev spread": [252, 0, 4, 0, 252, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Ground-types", "Water-types", "Grass-types", "Bronzong", "Steel-types"], "credits": ["Written by avocado", "Quality checked by col49, phantom,  and Rakan", "Grammar checked by Fireflame479 and P Squared"]}