{"name": "Greninja", "forms": {"Base": {"base stats": [72, 95, 67, 103, 71, 122], "types": ["Water", "Dark"], "abilities": ["Battle Bond", "Protean", "Torrent"], "tier": ["OU"], "form": "Base"}}, "overview": "Greninja, courtesy of its stellar Speed tier and amazing ability in Protean, is one of the OverUsed metagame's premier offensive threats, as it is more than capable of pressuring both faster, offensively inclined teams and bulkier builds. Its expansive movepool is a major contributing factor to its potency as an offensive force as well: because it has such a high number of move options, it can circumvent would-be counters and defensive checks and leave one's opponent guessing at Team Preview. Additionally, Greninja is one of the few viable offensively inclined user of Spikes and Toxic Spikes, which it is a stellar user of. Greninja only truly falls short when it comes to bulk, which renders it incapable of taking even resisted hits repeatedly, and the inability to run every coverage move on one set.\n", "strategies' format": "OU", "strategies": [{"name": "Specially Based Protean", "stats": [180, 227, 153, 305, 178, 377], "type": ["Water", "Dark"], "usage": "Take advantage of Greninja's ability to hit a vast amount of the metagame for super effective damage to weaken popular defensive cores consisting of Pokemon such as Heatran, Tapu Bulu, and Clefable. Attempt to set up Spikes as early as possible on expected switches to weaken Greninja's switch-ins throughout the game, giving them fewer opportunities to switch in. Try to save Greninja's Hydro Vortex for a scenario where an OHKO is guaranteed instead of prematurely wasting it early-game. Due to Greninja's vast movepool and flexibility, bluffing a Choice Scarf set can let you surprise opponents that think Greninja is Choice-locked with Hydro Vortex or a super effective coverage move. However, Greninja's subpar bulk means it struggles to come in even on resisted hits, so attempt to bring it in on predicted double switches or through VoltTurn support.", "moves": [["Hydro Pump"], ["Gunk Shot"], ["Hidden Power Fire"], ["Spikes"]], "item": [" Waterium Z"], "ability": ["Protean"], "nature": ["Hasty"], "ev spread": [0, 4, 0, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Physically Based Protean", "stats": [180, 289, 153, 243, 178, 377], "type": ["Water", "Dark"], "usage": "Attempt to bluff using Ash-Greninja because it is much more common, and utilize this to try to blow back typical Ash-Greninja answers using coverage moves. Since Greninja is excellent at forcing switches against foes such as Heatran and Tornadus-T, use this to your advantage to easily set up Spikes and slowly wear down the opposing team. Greninja is also able to beat most Defoggers in the tier, letting it keep up entry hazards. Don't use up Greninja's Z-Move right away, as your opponent might scout for it and try to pivot around it; instead, try to first put your opponent into a false state of security. Play aggressively and try to get Greninja in through double switches and the use of VoltTurn tactics to maximize its offensive presence.", "moves": [["Low Kick"], ["Gunk Shot"], ["Ice Beam"], ["Spikes"]], "item": [" Fightinium Z"], "ability": ["Protean"], "nature": ["Hasty"], "ev spread": [0, 252, 0, 4, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Scarf", "stats": [180, 270, 153, 262, 178, 377], "type": ["Water", "Dark"], "usage": "Hard switching Greninja into attacks is not recommended, as it's very frail and gets worn down easily from entry hazards. Choice Scarf Greninja is best used as a revenge killer of boosting Pokemon such as Volcarona and Gyarados. While Greninja can't actually switch into any boosting Pokemon, it can revenge kill them with the appropriate coverage move. U-turn is often a solid move to use against the Pokemon that it naturally forces out, such as Landorus-T and Heatran, so use it often to gain momentum. Use Gunk Shot and Ice Beam on targets such as Tangrowth and Zapdos, which usually check Greninja, that might be lured in; if running it, use Low Kick against Pokemon such as Tyranitar and Bisharp.", "moves": [["Rock Slide", "Gunk Shot"], ["U-turn"], ["Ice Beam"], ["Spikes", "Low Kick"]], "item": [" Choice Scarf"], "ability": ["Protean"], "nature": ["Hasty", "Naive"], "ev spread": [0, 176, 0, 80, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Dual Hazards", "stats": [180, 203, 170, 305, 179, 377], "type": ["Water", "Dark"], "usage": "Greninja does a great job at setting up Spikes early-game on offense teams and throughout a match on balance ones. When used on offense, Greninja should be either led with or sent out after the Stealth Rock user to set up as many layers of Spikes and Toxic Spikes as possible and then faint. In order to maximize the amount of hazards it sets up in a game, Greninja should try to get into the field against passive Pokemon or Pokemon it forces out such as Celesteela, Toxapex, and Landorus-T. If the opponent lacks a Toxic Spikes absorber like Toxapex or Mega Venusaur and a majority of the opposing team is vulnerable to the hazard, Greninja should prioritize setting up Toxic Spikes as opposed to Spikes, though it should aim to set both up if possible. If the opponent sends out a Defog user that doesn't fear Ice Beam like Mega Scizor or Mew, Greninja should make use of Taunt to prevent them from removing the hazards even if Greninja sacrifices itself in the process, though balance teams can afford to switch Greninja out and find another opportunity to set up hazards.", "moves": [["Spikes"], ["Toxic Spikes"], ["Taunt"], ["Ice Beam"]], "item": [" Focus Sash"], "ability": ["Protean"], "nature": ["Timid"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Set-dependent Switch-ins", "Naturally Faster Revenge Killers", "Powerful Choice Scarf Users"], "credits": ["Written by dk, Indigo Plateau, Nuked, Leo,  and Felixx", "Earlier versions by Jukain", "Quality checked by Gary, Hootie, Colonel M, p2, Subject 18, meeps, GMars, Jordy, ABR, Leo,  and lyd", "Grammar checked by The Dutch Plumberjack, Fireflame479, fleurdyleurse, Kris, Haund, Lemonade, martha,  and lotiasite"]}