{"name": "Hawlucha", "forms": {"Base": {"base stats": [78, 92, 77, 74, 63, 118], "types": ["Fighting", "Flying"], "abilities": ["Limber", "Mold Breaker", "Unburden"], "tier": ["OU"], "form": "Base"}}, "overview": "Hawlucha is a very threatening sweeper with the combination of a terrain seed such as Electric Seed, Grassy Seed, or Psychic Seed and the Unburden ability, capable of outspeeding even extremely fast foes, such as all common Choice Scarf users, Mega Alakazam, and sweepers such as Shift Gear Magearna and Mega Swampert. Additionally, it can threaten out many defensive Pokemon such as Ferrothorn, Tangrowth, and Mega Venusaur by virtue of its offensive typing. Hawlucha is also able to setup on defensive variants of Landorus-T, which is found on nearly every team. Its relatively low base Attack leaves it unable to OHKO foes such as Latios without a Swords Dance boost and even more defensive Pokemon such as Toxapex and Mew after a Swords Dance boost. It is also prone to being revenge killed by strong priority moves, such as Mega Pinsir's Quick Attack or Ash-Greninja's Water Shuriken.\n", "strategies' format": "OU", "strategies": [{"name": "Terrain Seed Sweeper", "stats": [216, 311, 190, 165, 171, 303], "type": ["Fighting", "Flying"], "usage": "Hawlucha works best as a late-game sweeper, aiming to break through teams once defensive threats such as Landorus-T, Mew, and Toxapex have been eliminated or sufficiently weakened. It is necessary to preserve Hawlucha's Terrain Seed until this time because otherwise, Hawlucha will lack the speed necessary to outrun offensive Pokemon. The Defense boost granted by Electric or Grassy Seed improve's Hawulucha's matchup against physical attackers, such as Tapu Bulu, whereas Psychic Seed's Special Defense increase ensures a better matchup against Ash-Greninja, Landorus-T and Clefable. Hawlucha can use these boosts to its bulk to set up Swords Dance before breaking through the opposing team with its STAB moves.", "moves": [["Acrobatics"], ["Swords Dance"], ["High Jump Kick"], ["Roost"]], "item": [" Electric Seed", " Grassy Seed", " Psychic Seed"], "ability": ["Unburden"], "nature": ["Adamant"], "ev spread": [96, 252, 0, 0, 36, 124], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Priority Users", "Physical Walls", "Offensive Pokemon that resist Fighting-type Moves"], "credits": ["Written by Gurpreet Patel (Sent you a Friend Request)", "Quality checked by Subject 18, Colonel M,  and Gary", "Grammar checked by Lotiasite and Fireflame479"]}