{"name": "Honedge", "forms": {"Base": {"base stats": [45, 80, 100, 35, 37, 28], "types": ["Steel", "Ghost"], "abilities": ["No Guard"], "tier": ["LC"], "form": "Base"}}, "overview": "Honedge's Steel / Ghost typing, good Attack stat, and access to STAB priority allow it to function as a decent offensive check to Fairy- and Psychic-types like Spritzee and Abra. It can also soft check Flying-types like Doduo and Rufflet, though it fears Knock Off from the former. Honedge also has a good movepool, which includes coverage options in Sacred Sword and Rock Slide to complement its STAB moves, Pursuit to trap and KO Abra while being immune to Counter from Focus Sash variants, and Swords Dance to boost its already good Attack stat. However, Honedge's typing is a double-edged sword, as it leaves it weak to common moves such as Knock Off and Earthquake. In addition, these moves are often run as coverage by Pokemon it would otherwise be able to check, such as Fighting-types like Mienfoo and Rock-types like Dwebble. Honedge also lacks any form of recovery outside of Berry Juice, which in combination with its bad Special Defense, leaves it open to being worn down, and its STAB moves have low Base Power and only average coverage, meaning that despite its good Attack stat, it's unable to deal significant damage to a big portion of the metagame. Lastly, Honedge faces a lot of competition from other Steel-types like Ferroseed, which has access to Stealth Rock, Spikes, and Thunder Wave, as well as Pursuit trappers like Alolan Grimer, which has a more powerful Pursuit thanks to it being STAB, access to STAB Knock Off, and a great ability in Poison Touch.\n", "strategies' format": "LC", "strategies": [{"name": "Offensive", "stats": [145, 247, 265, 95, 145, 105], "type": ["Steel", "Ghost"], "usage": "Honedge's role compression allows it to do many things for its team depending on what is needed, such as switching into and Pursuit trapping Abra, checking Flying-types like Rufflet and Doduo, and wallbreaking thanks to its high Attack stat and access to Swords Dance. Be careful of Honedge being worn down, as it doesn't have any form of recovery. As such, also try to avoid getting burned, as this will make Honedge significantly weaker and wear it down quickly. Because of this, Honedge should avoid attacking Flame Body users such as Ponyta and Larvesta. Shadow Sneak can be used to revenge kill threats that are weak to Ghost, such as Abra and Gastly, as well as other foes if they are weakened enough. The combination of Shadow Sneak and Pursuit can create mind games in the matchup against Gastly; however, Honedge has to be very careful, as Gastly can easily knock it out if you mispredict. Always try to avoid Knock Off users like Mienfoo and Vullaby unless it is to lure them with a super effective coverage move, as Knock Off will not only deal significant damage to Honedge but also cripple it by removing its item. Honedge has a plethora of resistances, so these should be taken advantage of to get Honedge into play against Psychic- and Fairy-types. However, it should still be wary of super effective coverage on Pokemon it can otherwise check, such as Abra and Snubbull.", "moves": [["Shadow Sneak"], ["Iron Head"], ["Sacred Sword", "Rock Slide"], ["Pursuit", "Swords Dance"]], "item": [" Eviolite", " Berry Juice"], "ability": ["No Guard"], "nature": ["Adamant"], "ev spread": [76, 116, 116, 0, 140, 52], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Dark-types", "Fighting-types", "Fire-types", "Burns", "Ground-types"], "credits": ["Written by Xayah", "Quality checked by Nineage, Hilomilo,  and Corporal Levi", "Grammar checked by Fireflame479 and Rakan"]}