{"name": "Incineroar", "forms": {"Base": {"base stats": [95, 115, 90, 80, 90, 60], "types": ["Fire", "Dark"], "abilities": ["Blaze", "Intimidate"], "tier": ["NU"], "form": "Base"}}, "overview": "Thanks to Incineroar's great Attack, incredibly wide movepool containing many support and coverage options, and ability Intimidate, it is a very flexible Pokemon in the NU metagame, being able to function as either a potent wallbreaker or a useful pivot. High base Attack and wide coverage make Incineroar one of NU's most potent offensive threats, which is only boosted by its access to the exclusive Z-Move Malicious Moonsault, which lets it OHKO nearly any Pokemon that doesn't resist it after a Swords Dance boost. A good defensive typing and great defensive stats combined with Intimidate mean that Incineroar has the natural bulk to take on Fire-, Ice-, and Dark-types. Intimidate also allows it to function as a very useful pivot, increasing its physical bulk, and helping it to support its team. However, a weakness to passive damage and no recovery moves means that it is easily worn down, which, combined with its low Speed stat, leaves it easily revenge killed.\n", "strategies' format": "NU", "strategies": [{"name": "Swords Dance", "stats": [226, 329, 217, 176, 216, 240], "type": ["Fire", "Dark"], "usage": "Even unboosted Incineroar hits very hard, so it is often helpful to throw out strong attacks early-game. Flare Blitz can 2HKO Passimian unboosted, so it is often useful to use it if you expect Passimian to switch in, as removing Passimian means Incineroar is significantly harder to revenge kill. If Incineroar needs to set up Swords Dance to break the opponent's team, its HP must be preserved, so avoid switching it into unnecessary attacks. As Incineroar cannot typically break past its checks, such as Rhydon and Quagsire, without significant prior damage or a Z-Move, time its Z-Move usage very carefully. Intimidate can be used as a last-ditch effort to weaken a foe that Incineroar's team can't otherwise take on, so letting Incineroar be KOed to get an Intimidate off can occasionally be justified.", "moves": [["Swords Dance"], ["Darkest Lariat", "Knock Off"], ["Earthquake"], ["Flare Blitz"]], "item": [" Incinium Z", " Groundium Z", " Firium Z"], "ability": ["Intimidate"], "nature": ["Jolly", "Adamant"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Defensive Pivot", "stats": [287, 266, 265, 176, 257, 156], "type": ["Fire", "Dark"], "usage": "This set functions primarily as a pivot and, as such, Incineroar should aim to come in on attacks it takes little damage from and either throw off a safe attack or U-turn out, bringing a teammate in. Will-O-Wisp should be used when expecting a physical attacker to switch in that threatens Incineroar out, such as Rhydon or Passimian. Knock Off is generally a fairly safe move to use and can be thrown out without much risk if the opponent doesn't have a clear play. Stealth Rock and other forms of passive damage can be taken advantage of to guarantee that Incineroar consumes its Iapapa Berry, but in general, Incineroar's teammates should keep the field clear of hazards. Using Intimidate to reduce a foe's Attack and then using U-turn to switch out to an appropriate teammate is often a good strategy to help wall an opposing Pokemon and reduce the damage Incineroar's team takes. Incineroar can often freely U-turn out against enemies it expects to switch out, such as Decidueye and Rotom, giving its team momentum. Intimidate can be used as a last-ditch effort to weaken a foe that Incineroar's team can't otherwise take on, so letting Incineroar be KOed to get an Intimidate off can occasionally be justified.", "moves": [["Flare Blitz", "Fire Blast"], ["Knock Off"], ["U-turn"], ["Earthquake", "Will-O-Wisp"]], "item": [" Iapapa Berry"], "ability": ["Intimidate"], "nature": ["Impish"], "ev spread": [244, 0, 100, 0, 164, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Rock-types", "Fighting-types", "Faster Pokemon", "Entry Hazards", "Water-types"], "credits": ["Written by quziel", "Quality checked by Blast, poh,  and kay", "Grammar checked by martha and The Dutch Plumberjack"]}