{"name": "Infernape", "forms": {"Base": {"base stats": [76, 104, 71, 104, 71, 108], "types": ["Fire", "Fighting"], "abilities": ["Blaze", "Iron Fist"], "tier": ["UU"], "form": "Base"}}, "overview": "Infernape is among the UnderUsed metagame's premier offensive threats, thanks to its multitude of valuable traits. Between a great Speed tier, good mixed offenses, and access to both physical and special boosting moves in Swords Dance and Nasty Plot, Infernape is extremely offensively versatile, capable of running several different viable sets and always leaving its opponent guessing. Furthermore, Infernape's excellent STAB combination in tandem with the massive amount of coverage options at its disposal allows it to hit almost the entire tier for super effective damage, severely limiting its checks. Access to two powerful STAB priority attacks in the forms of Mach Punch and Vacuum Wave further bolsters Infernape's offensive prowess, allowing it to pick off weakened threats with relative ease. Unfortunately, Infernape can often suffer from four-moveslot syndrome, which prevents it from covering everything it'd like to and allows certain Pokemon to check some of its sets. Infernape is also very frail without defensive investment, which leaves it extremely vulnerable to Pokemon that can hit it for super effective damage, such as Moltres and Mega Aerodactyl. Infernape also sits at a slightly exploitable Speed tier, given that big threats like Gengar and Latias can outpace and threaten it, which in tandem with its poor bulk can require intelligent play to put Infernape to full use.\n", "strategies' format": "UU", "strategies": [{"name": "Nasty Plot", "stats": [188, 219, 179, 307, 178, 346], "type": ["Fire", "Fighting"], "usage": "This set's best function is as a late-game sweeper, as Infernape sweeps quite well once its checks are removed. It can, however, also be put to use as an early-game wallbreaker that weakens opposing teams for another sweeper and as a stallbreaker. If Infernape is looking to sweep late-game, it is best that faster Pokemon that can revenge kill it, such as Zeraora, Choice Scarf Krookodile, Mega Aerodactyl, and especially Latias are removed from play or have had their Speed lowered by either Sticky Web or paralysis. Various Water-types are also important to remove in order to allow Infernape to clean up. These Water-types include Starmie, which can outspeed and revenge kill Infernape, Primarina, which isn't OHKOed by Grass Knot, and Mega Sharpedo, which fears Vacuum Wave but otherwise can reach +1 with Speed Boost, outspeed Infernape, and OHKO it. Due to Infernape's frailty, it should only be switched into threats that it can tank hits from, like Scizor, and otherwise be brought into play with support from a pivot or after a teammate has fainted. It should mainly look to set up against foes that it forces out, such as Scizor, Blissey, and Mamoswine. Infernape should look to use All-Out Pummeling against Blissey in order to reliably secure a KO against it, though foes like Alomomola, Nihilego, and Alolan Muk also make good targets due to their ability to potentially cripple Infernape if they aren't KOed.", "moves": [["Nasty Plot"], ["Fire Blast"], ["Focus Blast"], ["Vacuum Wave", "Grass Knot"]], "item": [" Fightinium Z", " Life Orb"], "ability": ["Blaze"], "nature": ["Timid"], "ev spread": [0, 0, 4, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Scarf", "stats": [188, 307, 179, 219, 178, 346], "type": ["Fire", "Fighting"], "usage": "This set's main function is as a very reliable revenge killer, thanks to Infernape's good Attack and Speed. As such, Infernape should come in on a boosted setup sweeper, such as Cobalion or Terrakion, after a teammate has pivoted it in or fainted, and revenge kill it. If a setup sweeper with moderate bulk, like Kommo-o or Mega Altaria, is to be revenge killed by Infernape, it is important that they are first weakened a bit through either pivoting or entry hazard damage. U-turn should be utilized as much as possible throughout the match, as it easily generates momentum and also allows Infernape's checks to be chipped fairly adequately. It is best to use U-turn when predicting a switch to a threat like Latias or Jellicent, as this will allow Infernape to deal some damage to them while bringing in a teammate capable of taking them on. Due to the drawbacks of Infernape's STAB attacks, they should only be used later on in a game when Pokemon resistant to them are removed or when Infernape can use them to a revenge kill a foe that doesn't resist them. This set has some use as an anti-lead thanks to Infernape's fast U-turn, which should be utilized against common leads on hyper offensive teams in Azelf, Froslass, and Terrakion to break their Focus Sashes and allow another teammate to finish them off. This set can also be put to use as a late-game cleaner due to Infernape's good Speed, but it should be noted that lots of support is required for this due to Infernape's middling power and the tier's plentiful number of Pokemon resistant to its STAB attacks.", "moves": [["Flare Blitz"], ["U-turn"], ["Close Combat"], ["Gunk Shot", "Stone Edge"]], "item": [" Choice Scarf"], "ability": ["Blaze"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Mixed Attacker", "stats": [188, 286, 178, 266, 160, 346], "type": ["Fire", "Fighting"], "usage": "This set has multiple potential uses in a match. It can be used as an early-game wallbreaker due to Infernape's good coverage, and it can also be used to clean up late-game when checks have been weakened, thanks to Infernape's good Speed. So not to further limit Infernape's longevity with Life Orb recoil, it is best that careful prediction is used with this set. For example, if predicting the switch to a Pokemon that tanks either of Infernape's STAB attacks, such as Swampert or Sylveon, it is best to use super effective coverage, like Grass Knot and Gunk Shot, to nail these threats. Since it will often wear itself down with Life Orb recoil alone, Infernape should be brought into play when it's capable of punching as big of holes in opposing teams as possible, which means that faster Pokemon capable of KOing it should be removed or weakened into range of a KO from Mach Punch. It should also be brought in via support from a pivot or after a teammate has fainted for similar reasons. Slack Off is best used when Infernape forces a foe out with super effective STAB options or coverage moves so it can help mitigate Life Orb recoil and enable it to wallbreak more easily and for longer, particularly against defensive teams.", "moves": [["Overheat", "Fire Blast"], ["Close Combat"], ["Slack Off", "Gunk Shot"], ["Grass Knot", "Gunk Shot"]], "item": [" Life Orb"], "ability": ["Blaze"], "nature": ["Naive"], "ev spread": [0, 168, 0, 88, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Band", "stats": [188, 307, 179, 219, 178, 346], "type": ["Fire", "Fighting"], "usage": "This set's main function is as a powerful wallbreaker, thanks to Infernape's good Speed and high Attack with a Choice Band. It is best to use U-turn as much as possible earlier on in a match, as this will adequately chip Infernape's checks for teammates to finish them off. Flare Blitz and Close Combat should only be used once Pokemon resistant to them are significantly weakened, as they become quite easy for Infernape to spam late-game to punch holes for sweeping teammates. If it's being run, Mach Punch should only be used for revenge killing purposes. This means that when a foe like Mega Pidgeot or Cobalion is significantly weakened, it is best for Infernape to then be switched into play, as it can then reliably pick them off with priority.", "moves": [["Flare Blitz"], ["U-turn"], ["Close Combat"], ["Mach Punch", "Gunk Shot", "Stone Edge"]], "item": [" Choice Band"], "ability": ["Iron Fist", "Blaze"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Swords Dance", "stats": [188, 307, 179, 219, 178, 346], "type": ["Fire", "Fighting"], "usage": "This set's function is as a late-game cleaner, as Infernape can break past teams most reliably once its checks have been removed or weakened. Pokemon that outspeed and pressure Infernape, like Mega Aerodactyl and Mega Pidgeot, are very important to remove so not to leave it vulnerable to being revenge killed, while Choice Scarf users like Krookodile and Latias are important to dispose of for similar reasons. Various Water-types are also important to remove; Mega Sharpedo can outspeed Infernape after Speed Boost and threaten it if it doesn't have Mach Punch, Swampert can tank any of Infernape's hits comfortably aside from a boosted All-Out Pummeling, and Starmie outspeeds and revenge kills it. Setup opportunities can be found against Pokemon that Infernape forces out, Scizor and Blissey, as well as against Pokemon that can't adequately damage it, like Chesnaught.", "moves": [["Swords Dance"], ["Close Combat"], ["Flare Blitz"], ["Mach Punch", "Thunder Punch"]], "item": [" Fightinium Z", " Electrium Z"], "ability": ["Iron Fist"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Water-types", "Flying-types", "Latias", "Faster Pokemon", "Residual Damage"], "credits": ["Written by Hilomilo", "Quality checked by Bouff, A Cake Wearing A Hat,  and Eyan", "Grammar checked by The Dutch Plumberjack and martha"]}