{"name": "Kartana", "forms": {"Base": {"base stats": [59, 181, 131, 59, 31, 109], "types": ["Grass", "Steel"], "abilities": ["Beast Boost"], "tier": ["OU"], "form": "Base"}}, "overview": "Kartana is one of the most threatening Pokemon in the USM metagame due to it having insanely high Attack and superb Speed, making Kartana incredibly hard to counter defensively. Unfortunately, low base HP and pitiful Special Defense make Kartana one of the most specially frail Pokemon in the tier. It is able to salvage its decent physical bulk thanks to a high Defense stat, however. Its Grass / Steel typing also assists Kartana defensively, as it resists many different types and only has two weaknesses, Fighting and Fire. Offensively, Kartana's typing is also appreciated, especially alongside the coverage move Sacred Sword. Finally, Beast Boost allows Kartana to boost its Attack every time it gets a KO and makes consistent defensive counterplay incredibly hard to come by.\n", "strategies' format": "OU", "strategies": [{"name": "Paper Cut (Swords Dance)", "stats": [154, 461, 299, 138, 98, 348], "type": ["Grass", "Steel"], "usage": "Be cautious about wasting Kartana's Z-Move, as without it, Kartana cannot break through its typical checks and is easily walled by Tornadus-T and Zapdos. Kartana's offensive prowess usually gives it at least one opportunity to set up on a foe that it threatens out during a match; thus, try to set up a Swords Dance against Pokemon that it can beat, such as Rotom-W, Ferrothorn, and Gliscor. Bulkier teams tend to have Pokemon faster than Kartana, such as Mega Latias and Mega Alakazam, that can easily revenge kill it. If your ultimate goal is to sweep, make it your primary task to eliminate these faster Pokemon before setting up; with these threats gone, Kartana can easily punch holes in these teams and pave the way for other teammates to sweep. Offensive teams tend to struggle switching into Kartana with the exception of glue Pokemon like Tornadus-T, but they can easily revenge kill it with faster Pokemon like Mega Alakazam, Greninja, and Tapu Koko, so try to weaken the opposing team as much as possible to allow a teammate to sweep easier late-game. It is important to note that even without a Swords Dance Attack boost, Kartana can OHKO Tornadus-T if it tries to pivot into Kartana to scout for a Choice set. Use this to your advantage, as removing Tornadus-T from opposing teams can open up a big hole for Kartana to do some serious damage.", "moves": [["Swords Dance"], ["Leaf Blade"], ["Sacred Sword"], ["Giga Impact"]], "item": [" Normalium Z"], "ability": ["Beast Boost"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Paper Plane (Choice Scarf)", "stats": [155, 461, 298, 138, 98, 348], "type": ["Grass", "Steel"], "usage": "Choice Scarf Kartana is meant to clean teams later on in games with the assistance of its ability, Beast Boost. Beast Boost lets it snowball Attack boosts and run through weakened teams. In addition, Choice Scarf Kartana functions as a revenge killer earlier on in games, outrunning and defeating or forcing out most common offensive threats in the metagame such as Greninja, Tapu Lele, and Keldeo. While locking into Defog is not particularly ideal, as Kartana has to switch out afterwards or become fodder, it is still convenient in some situations and should be used when entry hazards are proving to be problematic to your team during the early- to mid-game. Due to the fact that Swords Dance Kartana is the more common and threatening of the two sets, there are many occasions where you are facing an offensive team that lacks a true Kartana counter and you can take advantage of this via strategic utilization of this Kartana variant. Essentially, the opponent will often try to pivot to their faster, offensive checks that resist a certain move or predict you to use Swords Dance to break through a defensive pivot and Kartana can take advantage of this by hitting them with a strong attack right off the bat, making prediction easier to make, as you know it has to lock into a move.", "moves": [["Leaf Blade"], ["Sacred Sword"], ["Smart Strike", "Knock Off"], ["Knock Off", "Defog"]], "item": [" Choice Scarf"], "ability": ["Beast Boost"], "nature": ["Jolly"], "ev spread": [4, 252, 0, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Paper Press (Choice Band)", "stats": [155, 461, 298, 138, 98, 348], "type": ["Grass", "Steel"], "usage": "Due to Choice Band locking Kartana into one move, it is important to predict your opponent's move to use Kartana to its fullest potential. Kartana has the tools to heavily threaten several balance and bulky offense teams, but good opponents will try to pivot around and circumvent its power, thus it's important to ponder risk and reward and keep up the prediction game to prevent your opponent from taking advantage of Kartana. Knock Off is usually a great move to spam early-game, as it does solid damage to most walls. Meanwhile, Leaf Blade is usually ideal to use later on, once Steel- and Flying-types are successfully weakened. Also, try to find opportunities to get Kartana in. It can be after one of your Pokemon has been knocked out, with the use of a slow U-turn or Volt Switch, or even on an expected switch from your opponent. For the latter, just be careful to not risk Kartana too much, as it will often be important to break your opponent's defensive core. For Kartana's success as a wallbreaker, try to keep entry hazards on your opponent's side of the field for as long as possible, since they really help Kartana's duty as a wallbreaker, allowing it to take down walls and enable teammates to seal the game down the line. Finally, Kartana shouldn't be used as a revenge killer, as even if it can outspeed and knock out a threat, it is still going to be locked into a move and taken advantage of, thus losing valuable momentum.", "moves": [["Leaf Blade"], ["Knock Off"], ["Sacred Sword"], ["Smart Strike"]], "item": [" Choice Band"], "ability": ["Beast Boost"], "nature": ["Jolly"], "ev spread": [4, 252, 0, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Defensive Steel-types", "Faster Special Attackers", "Bulky Grass-types", "Defensive Zapdos and Volcarona"], "credits": ["Written by Finchinator, lyd,  and Indigo Plateau", "Earlier versions by Gary, p2,  and Rakan", "Quality checked by Leo, Gary, ABR, Jordy,  and Lyd", "Grammar checked by martha, P Squared, NixHex,  and The Dutch Plumberjack"]}