{"name": "Lapras", "forms": {"Base": {"base stats": [130, 85, 80, 85, 95, 60], "types": ["Water", "Ice"], "abilities": ["Hydration", "Shell Armor", "Water Absorb"], "tier": ["Untiered"], "form": "Base"}}, "overview": "Lapras has a small niche in the PU metagame thanks to its decent power with Choice Specs, which allows it to serve as a wallbreaker. In addition, Water Absorb coupled with Freeze-Dry and good bulk allows Lapras to pressure a myriad of Water-type Pokemon such as Gastrodon, Lanturn, and Swanna. Lapras also sports a solid offensive typing that allows it to hit a wide array of offensive Pokemon with its powerful STAB attacks. On the downside, Lapras's typing leaves it weak to common Electric-, Grass-, and Fighting-type Pokemon such as Abomasnow, Eelektross, and Hitmonchan. Lapras is also vulnerable to all entry hazards, which make it easily worn down over the course of a match. Furthermore, Lapras's lackluster base 60 Speed stat puts it below a wide variety of threats including Lycanroc, Alolan Raichu, and Primeape, meaning it is easily revenge killed. Finally, even when Lapras is wielding Choice Specs, bulky Pokemon such as Clefairy are able to switch into and tank its STAB attacks with ease. Because of this, Lapras is outclassed by other Water- and Ice-types such as Ludicolo and Aurorus, which have higher Special Attack stats that allow them to 2HKO special  walls more easily than Lapras.\n", "strategies' format": "PU", "strategies": [{"name": "Choice Specs", "stats": [326, 185, 196, 295, 226, 190], "type": ["Water", "Ice"], "usage": "Lapras is best used as an early- or mid-game wallbreaker to punch holes in the opponent's team, and a good way to start doing so is bringing it in against slower and passive Pokemon such as Weezing. Make sure to remove entry hazards with Pokemon like Hitmonchan before you bring Lapras onto the field, as entry hazards greatly cripple it. Identify your opponent's Hydro Pump switch-ins, and if they don't have any, it's practical to try wearing down the opposing team with repeated Hydro Pumps. If your opponent's team carries checks, Freeze-Dry can be used to chip switch-ins like Lanturn, while Hidden Power Fire can be used to lure and KO bulky Grass-types like Ferroseed and Abomasnow that take Hydro Pump with ease. Due to Lapras's great bulk and defensive typing, it should be used to pivot into predicted Water-type attacks from Pokemon such as Gastrodon and Floatzel so it can put pressure on the opposing team with Freeze-Dry or Hydro Pump. Lastly, be wary that predicting wrong comes with very big risks, as it could cost the team's momentum or end up giving Pokemon like Lilligant setup opportunities when Lapras locks into Hydro Pump.", "moves": [["Freeze-Dry"], ["Hydro Pump"], ["Ice Beam"], ["Hidden Power Fire"]], "item": [" Choice Specs"], "ability": ["Water Absorb"], "nature": ["Modest"], "ev spread": [120, 0, 0, 252, 0, 136], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Faster Pokemon", "Electric-type Pokemon", "Fighting-type Pokemon", "Grass-type Pokemon", "Residual Damage"], "credits": ["Written by TJ", "Quality checked by yogi, Megazard,  and Twix", "Grammar checked by The Dutch Plumberjack and A Cake Wearing A Hat"]}