{"name": "Liepard", "forms": {"Base": {"base stats": [64, 88, 50, 88, 50, 106], "types": ["Dark"], "abilities": ["Limber", "Prankster", "Unburden"], "tier": ["PU"], "form": "Base"}}, "overview": "Liepard is extremely versatile and unpredictable thanks to its plethora of viable sets such as Choice Band, Nasty Plot, and weather support. As a result of these sets' offensive nature, Liepard fits mostly on offensively based teams that appreciate its good Speed Tier and prowess. Liepard has access to Prankster, as well as useful offensive tools such as Pursuit, Sucker Punch, and Knock Off, allowing it to cripple teams. Despite these positives, Liepard has a notable flaw in the fact that its low Attack stat is low even when supplemented so it, struggles to break past bulky foes such as Weezing. Additionally, Liepard has mediocre bulk and is weak to common Fighting- and Fairy-type attacks. Without the proper coverage, it can struggle to retaliate against foes that use these moves. Lastly, Liepard is a prediction-reliant Pokemon, and being Choice-locked into Sucker Punch can be costly because it can give the opponent free turns to set up.\n", "strategies' format": "PU", "strategies": [{"name": "Choice Band", "stats": [164, 275, 137, 190, 136, 342], "type": ["Dark"], "usage": "Choice Band turns Liepard into a prediction-reliant Pokemon. Liepard should use Knock Off to remove foes' items early-game. However, be careful when using Dark-type moves against Psychic-types like Mesprit and Musharna because they sometimes carry Colbur Berry to weaken them; in Musharna's case, its potential Z-Crystal reduces Knock Off damage and its Z-Move can OHKO Liepard back. Bringing Liepard in on predicted Psychic-type attacks from Mesprit or choice-locked Ghost-type attacks from Oricorio-G and Haunter is ideal for Pursuit trapping. Be wary when locking Liepard into Sucker Punch because setup sweepers like Carracosta can take advantage of it. Liepard should pivot out on its hard counters with U-turn.", "moves": [["Knock Off"], ["Pursuit"], ["Play Rough"], ["U-turn", "Sucker Punch", "Copycat"]], "item": [" Choice Band"], "ability": ["Limber", "Prankster"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Nasty Plot", "stats": [165, 190, 136, 275, 136, 342], "type": ["Dark"], "usage": "Liepard should lock foes into setup moves or status moves using Encore. Liepard should use Nasty Plot on resisted attacks or after locking a foe with Encore. Copycat gives Liepard's attacks priority, so it should be used immediately after an attack. Since Liepard's only attacking move is Dark Pulse, it should be preserved until late-game, when its checks are eliminated from the battle.", "moves": [["Nasty Plot"], ["Dark Pulse"], ["Encore"], ["Copycat"]], "item": [" Black Glasses", " Leftovers"], "ability": ["Prankster"], "nature": ["Timid"], "ev spread": [4, 0, 0, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Weather", "stats": [164, 275, 137, 190, 136, 342], "type": ["Dark"], "usage": "Once Liepard sets the weather, it should exit battle as soon as possible in order to let its team take advantage of as many weather turns as possible. Do not use Liepard as a lead for weather teams; Liepard should be preserved because it has great utility in setting up weather, so your best bet is to send it in whenever the weather is needed or is about to expire. Liepard isn't bulky at all, so don't switch it in mindlessly. Liepard's Dark typing allows it to be immune to Prankster moves such as Sableye's Will-O-Wisp, so feel free to switch it in on Sableye or any other passive Pokemon.", "moves": [["Knock Off"], ["Rain Dance", "Sunny Day"], ["Encore", "Thunder Wave"], ["U-turn"]], "item": [" Damp Rock", " Heat Rock"], "ability": ["Prankster"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fighting-types", "Faster and Stronger Pokemon", "Weather Setters"], "credits": ["Written by TJ", "Quality checked by TONE, Megazard,  and Akir", "Grammar checked by talkingtree and Cryogyro"]}