{"name": "Ludicolo", "forms": {"Base": {"base stats": [80, 70, 70, 90, 100, 70], "types": ["Water", "Grass"], "abilities": ["Own Tempo", "Rain Dish", "Swift Swim"], "tier": ["PU"], "form": "Base"}}, "overview": "Ludicolo is a fearsome sweeper in the PU metagame by virtue of its access to Swift Swim, which allows it to outspeed the entire unboosted metagame under rain. Furthermore, a decent Special Attack stat in tandem with a good STAB combination and nearly unresisted coverage allows it to adequately pressure offensive and defensive teams alike, and a fairly decent defensive typing and good special bulk allow it to tank some hits and find easy opportunities to set up on Pokemon like Floatzel and Lanturn. Unfortunately, Ludicolo is hindered by its poor Defense and Speed stats, as they can complicate setup and leave it susceptible to common threats in Skuntank, Primeape, and Scyther. It also suffers from the prevalence of Pokemon that can tank a hit in the rain and cripple or KO it in return, including Guzzlord, Roselia, and Assault Vest Hitmonchan. Lastly, Ludicolo's physical frailty can leave it prone to getting revenge killed by strong priority users, including Absol, Alolan Raticate, and especially Kangaskhan, which can stall out rain turns with Fake Out.\n", "strategies' format": "PU", "strategies": [{"name": "Rain Sweeper", "stats": [194, 158, 176, 306, 237, 239], "type": ["Water", "Grass"], "usage": "Ludicolo should look to set up against Pokemon that can't adequately damage it, like Lanturn and Choice-locked Floatzel, or against Pokemon that it forces out, like Regirock or Gastrodon. It is also important to note that when not on a full rain team Ludicolo should be preserved for the late-game and rarely used early on, as it has an easier time sweeping once checks and counters are weakened. It can, however, be used as a late-game breaker if need be. If Ludicolo is up against a slower foe that is within range of a KO and isn't likely to switch out, it should usually just use an attack to revenge kill the opposing Pokemon so as not to take any damage. Lastly, Ludicolo should look for the opposing team to be generally weakened to begin its sweep, as while its good coverage lets it cover most of the metagame on its own, its middling power can compromise its sweeping chances.", "moves": [["Rain Dance"], ["Hydro Pump"], ["Giga Drain", "Energy Ball"], ["Ice Beam"]], "item": [" Life Orb"], "ability": ["Swift Swim"], "nature": ["Modest", "Timid"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [29, 31, 31, 31, 31, 31]}], "counters": ["Specially Bulky Pokemon", "Bulky Attackers", "Strong Priority", "Abomasnow and Aurorus"], "credits": ["Written by Hilomilo", "Quality checked by yogi, Megazard,  and g", "Grammar checked by The Dutch Plumberjack and A Cake Wearing A Hat"]}