{"name": "Lycanroc", "forms": {"Base": {"base stats": [75, 115, 65, 55, 65, 112], "types": ["Rock"], "abilities": ["Keen Eye", "Sand Rush", "Steadfast"], "tier": ["PU"], "form": "Base"}}, "overview": "Lycanroc is a solid late-game sweeper thanks to its high Attack, stellar Speed tier, and access to a uniquely powerful Z move in Splintered Stormshards. However, it heavily relies on Lycanium Z along with Swords Dance to help break through many of its would-be checks. A somewhat shallow movepool also leaves Lycanroc walled and checked by common Ground- and Fighting-type Pokemon such as Mudsdale and Gurdurr. Additionally, mediocre bulk means Lycanroc can be revenge killed by priority moves and Choice Scarf users like Primeape that aren't threatened by Accelerock.\n", "strategies' format": "PU", "strategies": [{"name": "Swords Dance", "stats": [186, 329, 167, 131, 166, 355], "type": ["Rock"], "usage": "Lycanroc should be used primarily as a late-game sweeper utilizing its combination of a one-time nuke, priority, and coverage to clean up weakened teams. If the opposing team has a hard counter like Gurdurr, try to pressure and eliminate it before attempting to sweep. Use Accelerock to handle Choice Scarf users such as Dodrio, but be aware that non-Choice Scarfed foes, such as Colbur Berry Mesprit, may attempt to bluff the item. Lycanroc's Z-Move is fully accurate whereas Stone Edge is not, so if a sweep relies on landing Stone Edge, make sure your other moves such as Drill Run and Accelerock won't already KO a foe before using it.", "moves": [["Swords Dance"], ["Stone Edge"], ["Drill Run"], ["Accelerock"]], "item": [" Lycanium Z"], "ability": ["Steadfast"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Offensive Stealth Rock", "stats": [186, 329, 166, 131, 167, 355], "type": ["Rock"], "usage": "Lycanroc can find wallbreaking opportunities mid- to late-game against offensive and balanced teams once it has set up Stealth Rock and its checks like Gurdurr, Mudsdale, and Claydol have been either severely crippled or weakened. Wallbreaking shouldn't be Lycanroc's main priority, though; it should aim to set up Stealth Rock and check Pokemon like Simisear before it starts looking for wallbreaking opportunities. The optimal time for Lycanroc to set up Swords Dance or Stealth Rock is against a Pokemon that it threatens out like Scyther and Dodrio. However, if you expect a bulky foe like Claydol or Regirock to come in, you should use Toxic to wear it down. Lycanroc should use Accelerock to hit faster Pokemon like Choice Scarf Swanna and revenge kill a +1 Speed Jynx. Lastly, Lycanroc should try to preserve its Z-Move for a scenario where it needs to OHKO a Pokemon that Stone Edge would miss out on or when it needs to break through a Pokemon like Regirock for a teammate instead of wasting it early-game.", "moves": [["Stealth Rock"], ["Stone Edge"], ["Accelerock"], ["Swords Dance", "Toxic", "Taunt"]], "item": [" Lycanium Z"], "ability": ["Steadfast"], "nature": ["Jolly"], "ev spread": [0, 252, 0, 0, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Bulky Ground-types", "Fighting-types", "Physically Bulky Walls"], "credits": ["Written by TJ", "Quality checked by Megazard, HJAD, yogi, tondas,  and TONE", "Grammar checked by Jukain, Haund, Estronic,  and The Dutch Plumberjack"]}