{"name": "Machamp", "forms": {"Base": {"base stats": [90, 130, 80, 65, 85, 55], "types": ["Fighting"], "abilities": ["Guts", "No Guard", "Steadfast"], "tier": ["RU"], "form": "Base"}}, "overview": "Machamp's niche over other Fighting-types in the RU tier is its ability Guts, which can transform it into a powerful wallbreaker with Flame Orb, boasting over 590 Attack, while maintaining the flexibility to switch its moves and not worry about Toxic. Machamp's STAB move usefully threatens many of the tier's Stealth Rock setters, including Registeel, Rhyperior, and Gigalith, and the rest of its movepool allows it to either OHKO or 2HKO the remainder of the metagame. Even stall teams have little in the way of checks for Machamp, as Close Combat, Knock Off, and Facade can break through everything in conjunction with Machamp's Guts-boosted power and ability to switch moves. However, Machamp competes for a spot with Bewear and Pangoro, the tier's other premier Fighting-types, which both have access to Swords Dance along with better physical bulk in the former's case and a stronger Knock Off for the latter. In addition, without defensive investment, Machamp is fairly easy to revenge kill due to its poor Speed tier and lack of a STAB priority move, and it is worn down quickly thanks to residual damage stacking up from Flame Orb and pivoting into entry hazards.\n", "strategies' format": "RU", "strategies": [{"name": "Guts Wallbreaker", "stats": [216, 394, 197, 149, 206, 209], "type": ["Fighting"], "usage": "Play Machamp aggressively, bringing it on double switches expecting the opponent to send in a Pokemon it threatens out, such as Registeel or Umbreon. Use Facade liberally, as it provides a high-Base Power move that comes without drawback and can 2HKO a majority of switch-ins along with one of Machamp's coverage moves. Be careful to preserve Close Combat PP against stall teams, as they will often attempt to Protect stall your team and pivot around in order to waste PP due to them lacking proper switch-ins to Machamp's Guts-boosted attacks. Be wary of leading with Machamp, as without Guts activated it will be significantly weaker on the first turn.", "moves": [["Close Combat"], ["Knock Off"], ["Facade"], ["Bullet Punch"]], "item": [" Flame Orb"], "ability": ["Guts"], "nature": ["Adamant"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Assault Vest", "stats": [279, 380, 196, 149, 206, 160], "type": ["Fighting"], "usage": "Against offensive teams, Machamp should try to switch in for free so it can take hits and KO back. Chances to switch in come from predicted switches to bulky Pokemon like Registeel and Milotic as well as to threatening special attackers such as Roserade and Ninetales. It makes for an excellent lead, as few Pokemon can immediately threaten it with an OHKO, it beats common Stealth Rock setters such as Registeel and Bronzong, and it can pick off suicide leads like Froslass and Archeops with Bullet Punch before they make more than one move. If it needs to switch in on something, it should switch in on a passive, status-reliant wall like Registeel or Milotic; inexperienced opponents might take your Machamp's lack of Flame Orb to mean it's using No Guard, so even if Machamp doesn't get statused on the switch, it might in subsequent turns. Another source of switch-in opportunities is Mega Blastoise if running Thunder Punch; only its Aura Sphere does much damage. Should an offensive foe let itself get KOed to hit Machamp hard, Machamp will likely be left too weak to check anything else. Thus, Machamp is often limited to forcing a trade; make the Pokemon it trades with a valuable team component like Mega Blastoise so the opponent will be at the greater disadvantage. Try to get Machamp burned or paralyzed as soon as possible against defensive teams so it can start wallbreaking. Toxic poison also works, but it takes Machamp down much faster. Machamp should prioritize eliminating Pokemon that keep teammates from sweeping, as it's unlikely to last long enough to win on its own.", "moves": [["Close Combat"], ["Knock Off"], ["Ice Punch", "Thunder Punch"], ["Bullet Punch"]], "item": [" Assault Vest"], "ability": ["Guts"], "nature": ["Adamant"], "ev spread": [252, 200, 0, 0, 0, 56], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Psychic-types", "Fairy-types", "Faster Wallbreakers", "Residual Damage"], "credits": ["Written by KW and CryoGyro", "Quality checked by Phantom, zizalith, roman, Averardo, Avocado,  and Mr Aldo", "Grammar checked by P Squared, Electrolyte,  and The Dutch Plumberjack"]}