{"name": "Magnemite", "forms": {"Base": {"base stats": [25, 35, 70, 95, 55, 45], "types": ["Electric", "Steel"], "abilities": ["Analytic", "Magnet Pull", "Sturdy"], "tier": ["LC"], "form": "Base"}}, "overview": "Magnemite is a solid Pokemon in the LC metagame, able to act as a pivot or as a powerful attacker. Its viability stems from its fantastic Special Attack, allowing it to fire off powerful attacks without requiring a boosting item. It is further set apart from other special attackers by its fantastic typing that gives it a plethora of resistances, access to Volt Switch that allows it to serve as a pivot, and access to Sturdy + Berry Juice, allowing it to recover health consistently. However, Magnemite is hindered in the LC metagame by weaknesses to the common Fighting- and Ground-type moves. Additionally, Magnemite only hits 15 Speed, leaving it reliant on a Choice Scarf if it wants to outspeed the metagame or an intact Berry Juice to take hits against offensive teams.\n", "strategies' format": "LC", "strategies": [{"name": "Choice Scarf", "stats": [86, 95, 176, 314, 146, 186], "type": ["Electric", "Steel"], "usage": "Choice Scarf Magnemite is especially useful against frailer offensive teams, where it can outspeed unboosted attackers and wear them down over the course of a battle. Care should be taken not to lock Magnemite into Electric-type moves early in the game if the opponent has a Ground-type or Chinchou, which could come into the attack and potentially use it as a setup opportunity. As the game wears on, and the opponent's Electric-type checks are weakened, Magnemite can spam Volt Switch more freely. This Magnemite set does not appreciate taking unresisted, or even powerful resisted, hits, so it works best when sent in to revenge kill an opposing Pokemon, when cleaning an opponent's team late-game, or when you are sure that the foe won't use an attacking move.", "moves": [["Volt Switch"], ["Flash Cannon"], ["Thunderbolt"], ["Hidden Power Fire", "Hidden Power Ground"]], "item": [" Choice Scarf"], "ability": ["Analytic", "Magnet Pull"], "nature": ["Modest", "Timid"], "ev spread": [0, 0, 0, 240, 0, 240], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "SturdyJuice", "stats": [86, 95, 185, 313, 146, 185], "type": ["Electric", "Steel"], "usage": "This set relies on avoiding Knock Off, which removes Magnemite's ability to regenerate its Berry Juice and recover HP. While some Knock Off users are obvious, such as Pawniard, others, such as Cottonee, Abra, and Ferroseed, can be more unexpected, and a mispredict against these Pokemon can lead to Magnemite being crippled for the rest of the match. Most resisted attacks can be switched into and out of throughout the match, with Magnemite using Volt Switch to pivot in and out and Recycle to recover its health. Strong neutral and super effective attacks should not be switched into if entry hazards are on the field, or if Magnemite has taken prior damage, because Sturdy will no longer be intact. Magnemite can use Endure when its Sturdy is broken but when it has an intact Berry Juice to survive a hit that would otherwise KO it and get to full health, where it will almost always survive any attack with Sturdy. However, if an opponent expects an Endure, they can use the free turn as an opportunity to boost stats, set entry hazards, or recover their own Pokemon's health.", "moves": [["Volt Switch"], ["Flash Cannon"], ["Recycle"], ["Endure", "Hidden Power Ground"]], "item": [" Berry Juice"], "ability": ["Sturdy"], "nature": ["Modest", "Timid"], "ev spread": [0, 0, 36, 236, 0, 236], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Ground-types", "Chinchou", "Fighting-types", "Specially Bulky Pokemon"], "credits": ["Written by Nineage", "Quality checked by tahu, sparktrain,  and Corporal Levi", "Grammar checked by Haund and P Squared"]}