{"name": "Malamar", "forms": {"Base": {"base stats": [86, 92, 88, 68, 75, 73], "types": ["Dark", "Psychic"], "abilities": ["Contrary", "Infiltrator", "Suction Cups"], "tier": ["NU"], "form": "Base"}}, "overview": "Malamar's ability Contrary in combination with its access to Superpower makes it a threatening setup sweeper and allows it to increase both its Attack and Defense, augmenting its offensive and defensive presence. Malamar also has solid bulk when invested and a decent defensive typing, meaning that it can effectively run a RestTalk set that pressures balance teams and capitalizes on defensive staples like Vileplume and Steelix while also shrugging off status conditions. Because of its access to Happy Hour, Malamar is also capable of running a more offensive set with Z-Happy Hour, which increases all of Malamar's stats by one stage and gives it an easier time sweeping teams late-game. Offensive and defensive teams alike can find dealing with Malamar difficult due to its near unresisted coverage in Knock Off + Superpower. However, Malamar's all-around average stats leave it fairly weak unboosted and can make setting up difficult, especially against more offensive teams. Malamar's typing also leaves it vulnerable two common attacking types in Bug and Fairy and provides Malamar with no useful resistances or immunities except Psychic. Fairy-types also resist Malamar's main coverage, which gives Malamar further difficulty in dealing with them.\n", "strategies' format": "NU", "strategies": [{"name": "RestTalk", "stats": [271, 221, 212, 154, 273, 182], "type": ["Dark", "Psychic"], "usage": "Since Malamar works best as a late-game sweeper, it should be preserved until its checks and counters, which are mostly Bug-, Poison-, and Fairy-types, are weakened or removed; however, against bulkier teams, Malamar can be used a bit more liberally in order to apply constant pressure. Knock Off should be the main move that Malamar uses early-game, since it cripples Malamar's checks by limiting the number of times they can be used to check it, which can make sweeping easier. Malamar should set up against Pokemon like Blastoise, non-Signal Beam Slowking, and Silvally-Steel due to their passivity preventing them from threatening Malamar out. Use Rest once Malamar takes a noticeable amount of damage, as this prevents Malamar from being worn down too quickly and allows it to consistently check special attackers like Delphox throughout the match. Due to the combination of Rest and Sleep Talk, Malamar doesn't mind being statused very much, meaning that it can act as a status absorber against Pokemon like Steelix, defensive Slowking, and Vivillon if nothing else on its team wants to take a status condition.", "moves": [["Knock Off"], ["Superpower"], ["Rest"], ["Sleep Talk"]], "item": [" Leftovers"], "ability": ["Contrary"], "nature": ["Careful"], "ev spread": [252, 4, 0, 0, 252, 0], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Z-Happy Hour", "stats": [208, 283, 213, 154, 186, 269], "type": ["Dark", "Psychic"], "usage": "Malamar performs best as a late-game sweeper that can finish off weakened teams, so preserving it until all checks and counters, such as Bug- and bulky Fairy-type Pokemon like Scyther and Aromatisse, are heavily weakened or removed is ideal, especially considering that Malamar can only boost all of its stats once. Malamar should preserve its HP to the best of its ability, since it cannot reliably finish off teams if it is weakened. Early-game, Malamar should mostly use Knock Off, as it's spammable and cripples defensive switch-ins, which can potentially make sweeping late-game easier for Malamar. After using Z-Happy Hour, Superpower should be used against Pokemon that cannot deal much damage to Malamar in return such as Piloswine and non-Roar Steelix. Though Malamar should be wary of switching directly in on attacks, it can be switched in on the predicted use of Defog against Pokemon like Silvally-Steel and Golbat in order to have its evasion increased due to Contrary, which can make taking it down more difficult. Silvally-Steel is notable, since it can also potentially increase Malamar's Attack with Parting Shot. Variants with Taunt should use the move against passive Pokemon that are overly reliant on status to deal damage like Pyukumuku and Mega Audino in order to use them as setup fodder.", "moves": [["Happy Hour"], ["Knock Off"], ["Superpower"], ["Psycho Cut", "Taunt"]], "item": [" Normalium Z"], "ability": ["Contrary"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Bug-types and Bug-type Coverage", "Fairy-types", "Pyukumuku"], "credits": ["Written by allstarapology", "Quality checked by quziel, banks,  and Eternally", "Grammar checked by The Dutch Plumberjack and Fireflame479"]}