{"name": "Masquerain", "forms": {"Base": {"base stats": [70, 60, 62, 100, 82, 80], "types": ["Bug", "Flying"], "abilities": ["Intimidate", "Unnerve"], "tier": ["Untiered"], "form": "Base"}}, "overview": "Masquerain stands out as the premier Sticky Web user in the tier, as it is able to muscle through Xatu and pressure a myriad of other entry hazard removers. Its combination of a good ability and an impressive movepool allows it to be the best Sticky Web setter in the tier, able to keep up offensive pressure on fast-paced offensive teams. However, it has a 4x weakness to Rock-type moves and, as a result, a 4x weakness to Stealth Rock, making it easy to pressure outside of early-game, which makes it harder for Masquerain to set up Sticky Web if it does not lead immediately. Furthermore, it is fairly weak prior to boosting with Quiver Dance and extremely one dimensional due to its viability deriving from solely Sticky Web.\n", "strategies' format": "NU", "strategies": [{"name": "Sticky Web Setter", "stats": [176, 140, 160, 299, 201, 284], "type": ["Bug", "Flying"], "usage": "Masquerain is best used as a lead to get Sticky Web up as soon as possible. If the opponent has a Defogger or spinner, it may be best to keep Masquerain around just in case it has to set Sticky Web up again. It can also use Quiver Dance on a predicted switch into Xatu, gaining momentum off of what would otherwise be Sticky Web getting bounced back. Once it has set up Sticky Web, Masquerain can use Quiver Dance or just fire off attacks in order to weaken the opposing team. Moreover, it can also be used as a pivot with Intimidate in order to let a teammate come in more safely.", "moves": [["Sticky Web"], ["Quiver Dance"], ["Bug Buzz"], ["Hydro Pump", "Ice Beam"]], "item": [" Focus Sash"], "ability": ["Intimidate"], "nature": ["Timid"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Entry Hazard Removal", "Specially Defensive Pokemon", "Fire-types"], "credits": ["Written by rozes", "Quality checked by Rabia, Eternally,  and Yoshi", "Grammar checked by Fireflame479 and Estronic"]}