{"name": "Misdreavus", "forms": {"Base": {"base stats": [60, 60, 60, 85, 85, 85], "types": ["Ghost"], "abilities": ["Levitate"], "tier": [""], "form": "Base"}}, "overview": "Misdreavus finds its place in the PU metagame as a Fighting-type check, a spinblocker, and a good utility Pokemon with an unpredictable support movepool. For example, it is able to punish potential switch-ins like Lilligant and Swanna with Thunder Wave and can run a number of other options in its last moveslot, such as Pain Split, Memento, Destiny Bond, and Nasty Plot. However, Misdreavus is often overshadowed as a Ghost-type by the likes of Jellicent, Oricorio-G, Froslass, and Sableye, as these Pokemon have more reliable means of recovery and are not overly reliant on Eviolite like Misdreavus is. Misdreavus does, however, have some niche attributes that allows allow it to stand out among the other Ghost-types in the tier. The main niche Misdreavus holds is its ability to outspeed Pokemon such as Skuntank and Absol and cripple them with Will-O-Wisp, which Sableye is unable to do due to Dark-types being immune to Prankster moves. Another quality Misdreavus brings to the table is being a fast Taunt user that can put pressure on bulkier teams consisting of Pokemon such as Clefairy and Munchlax that are easily shut down by Taunt. However, Misdreavus's reliance on Eviolite can often be a burden for it, as this makes Misdreavus very weak to Knock Off, meaning it can struggle to check Fighting-types such as Gurdurr and Throh that threaten it on the switch. This is one of the main reasons why other Ghost-types such as Colbur Berry Jellicent and bulky Oricorio-G are more easy to fit on teams; the former only takes neutral damage from Knock Off and threatens Fighting-types with Psychic, while the latter often carries Flyinium Z or Colbur Berry, which allows it to take reduced damage from Knock Off.\n", "strategies' format": "PU", "strategies": [{"name": "Utility", "stats": [219, 140, 157, 206, 206, 295], "type": ["Ghost"], "usage": "Misdreavus should be primarily used as a check to Fighting-type Pokemon such as Primeape and Hitmonchan. One of Misdreavus's other main roles is that of a spinblocker, as it can switch into common Rapid Spin users such as Hitmonchan and Alolan Sandslash decently well. Be wary of Pokemon such as Eelektross and Audino, as they often carry Knock Off, which compromises Misdreavus's defenses and also deals super effective damage. Luring in Dark-type Pokemon like Skuntank and burning them with Will-O-Wisp is a big part of Misdreavus's viability, as this can give teammates such as Bellossom and Musharna more opportunities to set up. Pain Split is usually used when Misdreavus is low on HP while the opposing Pokemon is healthy, as this maximizes the recovery Misdreavus gains from using it. Memento is often used when Misdreavus has done its job in the battle already and there is an opportunity to set up with a teammate. However, Memento can even be used as soon as Misdreavus comes in, if there is a sweeper in the back that is guaranteed to win the game and just needs an opportunity to safely set up. Thunder Wave should be used against faster Pokemon that do not care about getting burned or are immune to Will-O-Wisp such as Froslass and Floatzel. A good idea is to not be too hasty when using this move and surprise the opponent later on in the battle, when they are more likely to switch in their offensive threats with a false sense of security. Misdreavus can work very well against bulkier builds such as stall and balance, since it can use Taunt can shut down recovery and utility moves like Roost and Heal Bell while spreading burns with Will-O-Wisp to deal residual damage. Pain Split helps a lot in this matchup, as staying healthy is key.", "moves": [["Hex"], ["Will-O-Wisp"], ["Taunt"], ["Pain Split", "Memento", "Thunder Wave"]], "item": [" Eviolite"], "ability": ["Levitate"], "nature": ["Timid"], "ev spread": [252, 0, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Normal-types", "Dark-types", "Fire-types", "Special Attackers"], "credits": ["Written by Taskr", "Quality checked by yogi, Megazard,  and jklioe", "Grammar checked by A Cake Wearing A Hat and The Dutch Plumberjack"]}