{"name": "Natu", "forms": {"Base": {"base stats": [40, 50, 45, 70, 45, 70], "types": ["Psychic", "Flying"], "abilities": ["Early Bird", "Magic Bounce", "Synchronize"], "tier": ["LC"], "form": "Base"}}, "overview": "With a great ability in Magic Bounce, Natu carves itself an effective niche in the PU metagame. As the only Pokemon in the tier that has access to the ability, Natu is able to deflect entry hazards and other status moves such as Stealth Rock and Will-O-Wisp. Natu has a great utility movepool that complements its role as a defensive Magic Bounce user, including options such as U-turn, Reflect, and reliable recovery in Roost. Natu, however, has a rather poor defensive typing, and it is easily targeted by common Dark-, Ice-, Rock-, and Electric-types such as Spiritomb, Aurorus, and Eelektross. Natu cannot switch into all entry hazard setters, as some setters like Aggron can be a problem if they predict Natu switching into them; therefore, mind games are usually played to keep entry hazards away from the field consistently by keeping the opponent guessing if Natu is switching in or not. Aside from Reflect, Natu has very poor bulk even with its Eviolite intact and can be easily threatened by powerful Pokemon or Pokemon that deal super effective damage to it such as Kingler, Lycanroc, and Pyroar, with the latter targeting Natu's uninvested Special Defense. Furthermore, due to its reliance on Eviolite, Knock Off is an extremely dangerous tool against Natu, as it sports a weakness to the move and losing Eviolite severely hinders its longevity. Despite Natu's typing, it makes for a terrible check to Fighting-types because Fighting-types such as Gurdurr and Throh are able to take any of Natu's moves once and retaliate with Knock Off, while other Fighting-types such as Hitmonchan carry other threatening coverage moves such as Ice Punch. Natu's relative passivity means that setup sweepers can generally switch into it with ease, not fearing much aside from Thunder Wave, though Substitute users like Mesprit can avoid the move. Being reliant on Night Shade for damage also allows Normal-type wallbreakers like Kangaskhan and Zangoose to easily switch in.\n", "strategies' format": "PU", "strategies": [{"name": "Defensive Magic Bounce", "stats": [178, 94, 205, 176, 126, 180], "type": ["Psychic", "Flying"], "usage": "Natu should generally switch into predicted entry hazards and other status moves to prevent them from being used and bounce them back to the opponent's team. Natu can also do this to a certain extent without even being present; the opponent will think twice about setting entry hazards or using status-inducing moves, as they will be unsure if Natu will switch in or not. However, one important thing to look for is when Natu is switching in to deflect entry hazards or status-inducing moves, as it needs to be extremely careful of being predicted to switch in. Natu does not want to get hit by a super effective coverage move such as Knock Off from Pokemon like Mesprit and Clefairy, which can deter it from switching in due to its poor bulk. Natu should use Thunder Wave to cripple faster switch-ins such as Articuno and Lycanroc early-game, making them more vulnerable to Natu's teammates. U-turn should generally be used to avoid threatening situations, such as using it on a Pursuit trapper, and also to create momentum by allowing a teammate to switch in. Natu can use Reflect in conjunction with Roost to stall out and take less damage from more passive entry hazard setters such as Regirock to force switches. Reflect can also be used to take less damage from Pursuit, unless it's from Spiritomb. If Natu is used on stall teams, it is able to be played more passively just to bounce entry hazards and pivot; however, if it is used on more offensive teams, it can be played aggressively by switching in more often to ensure entry hazards are off the field.", "moves": [["Night Shade", "Psychic"], ["U-turn"], ["Reflect", "Thunder Wave"], ["Roost"]], "item": [" Eviolite"], "ability": ["Magic Bounce"], "nature": ["Bold"], "ev spread": [248, 0, 244, 0, 0, 16], "iv spread": [31, 0, 31, 31, 31, 31]}], "counters": ["Dark-types", "Electric-types", "Rock-types", "Steel-types", "Ghost-types", "Powerful Attackers", "Knock Off", "Ice-types"], "credits": ["Written by Conni", "Quality checked by allstarapology, yogi,  and jklioe", "Grammar checked by Fireflame479 and A Cake Wearing A Hat"]}