{"name": "Pineco", "forms": {"Base": {"base stats": [50, 65, 90, 35, 35, 15], "types": ["Bug"], "abilities": ["Overcoat", "Sturdy"], "tier": ["LC"], "form": "Base"}}, "overview": "Thanks to a great ability in Sturdy, a great Defense stat, and access to Stealth Rock, Spikes, Toxic Spikes, Rapid Spin, and Explosion, Pineco can function as a great suicide lead, as it can usually ensure that it gets its own entry hazards up while preventing your opponent from setting theirs up. However, Pineco is incredibly one-dimensional. Opponents will easily be able to predict a Pineco lead and act accordingly. Oftentimes, they will be able to set up on it, as it's very passive. It also has a very low Speed stat, meaning it will often be unable to set up multiple entry hazards and then go for Explosion. In addition, your team needs to prevent your opponent from removing Pineco's entry hazards in order to take advantage of them. Thus, a spinblocker and a Defiant user are mandatory, which restricts teambuilding a lot. Lastly, Pineco faces a lot of competition from the faster, stronger, and more versatile Dwebble.\n", "strategies' format": "LC", "strategies": [{"name": "Lead", "stats": [136, 225, 225, 95, 106, 137], "type": ["Bug"], "usage": "Pineco should typically be used as a lead, as switching it into an attack or entry hazards will break its Sturdy and often leave it unable to set up entry hazards. Stealth Rock should almost always be the first move used, as it is a great entry hazard that can severely weaken the opponent's team over time. Use Rapid Spin if your opponent sets up their own entry hazards while Pineco is still in. Rapid Spin can also be used to break Sturdy on opposing entry hazard setters such as Onix and Dwebble. Explosion should be used against more offensive teams to take out or heavily dent a threat and only on the turn just before Pineco will be KOed, as otherwise you waste a potential layer of Spikes. Explosion can also be used on Pokemon that set up on Pineco to significantly hurt them or sometimes even take them out. Payback can be used on a predicted switch to a Ghost-type to deal significant damage to it. Pineco should always avoid being hit by Taunt, as it will be left unable to perform its role. Thus, it is usually recommended to switch out when Pineco is in against Taunt users such as Mienfoo and Onix.", "moves": [["Stealth Rock"], ["Spikes"], ["Rapid Spin"], ["Explosion", "Payback"]], "item": [" Berry Juice"], "ability": ["Sturdy"], "nature": ["Jolly"], "ev spread": [0, 236, 36, 0, 0, 236], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Taunt Users", "Entry Hazard Removers", "Setup Sweepers"], "credits": ["Written by Xayah", "Quality checked by OP, sparktrain,  and Fiend", "Grammar checked by CryoGyro and The Dutch Plumberjack"]}