{"name": "Raikou", "forms": {"Base": {"base stats": [90, 85, 75, 115, 100, 115], "types": ["Electric"], "abilities": ["Inner Focus", "Pressure"], "tier": ["RU"], "form": "Base"}}, "overview": "Raikou's viability in the UU tier comes from the option of running Toxic and Protect paired with its Pressure ability to effectively wear down foes such as Hydreigon and Krookodile, as well as its potential to sweep teams with Calm Mind, two options that other Electric-types cannot offer as effectively; this ability to run two viable sets that require opponents to play around them differently also leaves it unpredictable. Raikou's great Speed tier allows it to outspeed some of the tier's biggest threats such as Infernape, Cobalion, and Terrakion. However, Raikou faces tough competition from Zeraora and Mega Manectric as an offensive Electric-type due to their superior Speed tiers, Manectric's far superior Special Attack, as well as Zeraora's ability to run a mixed set. Raikou must rely on Toxic stall, Calm Mind boosts, and Z-Moves to beat its common checks, whereas Manectric can 2HKO Hydreigon with Hidden Power Ice or hit Swampert with Hidden Power Grass. Zeraora is also able to make use of Grass Knot to hit Swampert, Close Combat to hit Hydreigon, and Knock Off to hit Latias. Raikou is also outclassed by Rotom-H as a defensive Electric-type, due to the latter's access to Defog to remove entry hazards and Levitate to answer some Ground-types. While Calm Mind does help Raikou boost its already respectable Special Attack and Special Defense, it is held back due to its inability to take physical attacks and come in easily to set up, so proper support is necessary. Raikou's pure Electric typing can also be very limiting due to the prevalence of Ground-types such as Gligar, Choice Scarf Krookodile, and Hippowdon in the current UU metagame.\n", "strategies' format": "UU", "strategies": [{"name": "Substitute + Toxic", "stats": [279, 185, 186, 267, 236, 361], "type": ["Electric"], "usage": "Substitute + Toxic Raikou cannot directly switch in due to its poor defensive stats. This limitation is compounded by its inability to come in on entry hazards due to the need to keep its health high. For this reason, it is best to bring in when the field is clear of hazards and preferably after a Pokemon faints, through double switching, or via VoltTurn support. Raikou also needs to keep its Leftovers for longevity throughout the game, so it is very important to not switch it in on a Trick from Togekiss or Knock Off from Pokemon such as Tentacruel and Empoleon. It's important to not allow Raikou to be hit by any status ailments, such as Toxic from Empoleon, in order to prevent it from being worn down. After getting a Toxic off on an opposing Pokemon, Raikou can use Substitute and Protect to stall PP, avoid being attacked while the opposing Pokemon takes residual damage, and gain back its own health with Leftovers. Substitute can be used on many Pokemon that are threatened out by Raikou, and Toxic is a useful move to punish Pokemon that think that they can safely switch into Raikou. Toxic is best used early in the game in order to wear down opposing Pokemon, such as Krookodile, with Substitute and Protect over the course of the battle. Protect is also helpful in scouting for moves, particularly from Pokemon like Choice Scarf Krookodile and Choice Scarf Hydreigon, while Substitute can be used to outplay status users and Pokemon such as Sucker Punch Bisharp.", "moves": [["Substitute"], ["Toxic"], ["Protect"], ["Thunderbolt"]], "item": [" Leftovers"], "ability": ["Pressure"], "nature": ["Timid"], "ev spread": [252, 0, 0, 4, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Calm Mind", "stats": [216, 185, 186, 329, 237, 361], "type": ["Electric"], "usage": "It is best to avoid setting up early in the game when Raikou's checks, such as Hippowdon and Choice Scarf Krookodile are still healthy. Getting off chip damage for a setup sweep later is more productive and maximizes Raikou's chance for success. Remember that whatever walls Raikou will be dependent on the moves being run, so it could differ slightly between games. For instance, when running Shadow Ball, Hippowdon, Mega Steelix, and Swampert will rarely have to fear Raikou, but if Hyper Beam is run they will not be as problematic. On the other hand, running Hyper Beam will make it difficult for Raikou to break through Pokemon such as Latias, particularly when Latias is running Roost. It is important to not send Raikou out when there are entry hazards on the field in order for it to be able to take priority attacks such as Crawdaunt's Aqua Jet and Bisharp's Sucker Punch. Toxic Spikes, in particular, can severely decrease the threat level that Raikou possesses. Keeping Raikou healthy is also crucial because its low defensive stats already make it very difficult to set up. Raikou can be brought into the game on an aggressive double switch when you product that your opponent will bring in a Pokemon that Raikou will match up well against, such as Tentacruel or Togekiss. Raikou can also be brought in easily with support from a pivot so that it does not have to take unnecessary damage.", "moves": [["Calm Mind"], ["Thunderbolt"], ["Hidden Power Ice"], ["Shadow Ball", "Hyper Beam"]], "item": [" Ghostium Z", " Normalium Z"], "ability": ["Pressure"], "nature": ["Timid"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Ground-types", "Special Walls", "Fast Offensive Threats"], "credits": ["Written by MunchlaxAndChill", "Previous versions by Bouff", "Quality checked by Nuked, Surgeon,  and Hilomilo", "Grammar checked by NixHex and The Dutch Plumberjack"]}