{"name": "Remoraid", "forms": {"Base": {"base stats": [35, 65, 35, 65, 35, 65], "types": ["Water"], "abilities": ["Hustle", "Moody", "Sniper"], "tier": ["LC"], "form": "Base"}}, "overview": "Remoraid is able to fit on offensive teams functioning as a revenge killer and cleaner, which is helped by great mixed attacking stats, a respectable 17 Speed tier, and a vast movepool. Water Spout is Remoraid's main selling point, as its high Base Power at full health allows Remoraid to significantly damage the opposition. Remoraid has access to coverage options such as Fire Blast to hit Grass-types and Bullet Seed for Water-types, which is boosted by Hustle. However, Hustle lowers the accuracy of physical moves, leading to unfortunate misses when using Bullet Seed. Additionally, Remoraid has terrible bulk, leaving it easily revenge killed by priority attacks such as Mach Punch and Sucker Punch. Lastly, it faces competition from other special Water-types such as Chinchou and Frillish, as they provide defensive utility and are more reliable.\n", "strategies' format": "LC", "strategies": [{"name": "Choice Scarf", "stats": [106, 166, 106, 225, 95, 247], "type": ["Water"], "usage": "Remoraid should always be at full health, as it functions the best when Water Spout is at its most powerful. As such, it should never switch directly into any Pokemon because it risks losing power on Water Spout and being KOed. Rather, it should be brought in safely after a KO or by a slow U-turn or Volt Switch. Furthermore, try to avoid taking damage from entry hazards and status, since they lower the Base Power of Water Spout. Lastly, if the opponent has a Frillish or Croagunk, be careful of locking Remoraid into Water Spout or Hydro Pump, which they're immune to, as this will kill all momentum.", "moves": [["Water Spout"], ["Hydro Pump"], ["Fire Blast"], ["Bullet Seed"]], "item": [" Choice Scarf"], "ability": ["Hustle"], "nature": ["Naive"], "ev spread": [0, 0, 0, 236, 0, 236], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Priority", "Grass-types", "Water-types", "Water-immune Pokemon", "Residual Damage"], "credits": ["Written by crusty", "Quality checked by tahu, Xayah,  and Corporal Levi", "Grammar checked by Eyan and Fireflame479"]}