{"name": "Reuniclus", "forms": {"Base": {"base stats": [110, 65, 75, 125, 85, 30], "types": ["Psychic"], "abilities": ["Magic Guard", "Overcoat", "Regenerator"], "tier": ["RUBL"], "form": "Base"}}, "overview": "Reuniclus is a unique Calm Mind user in the OU metagame that makes use of its solid typing, bulk, and access to Magic Guard and Recover to quickly overwhelm passive teams that rely on more passive Pokemon like Toxapex, Celesteela, and Tangrowth. Thanks to these traits, Reuniclus is also a really effective stall and balance breaker. In addition to this, if opted for, it can outlast Dark-types like Tyranitar and Mega Tyranitar with the combination of Acid Armor and Toxic Spikes or Spikes support, making it a versatile threat. Reuniclus also finds itself coming out on top in wars against Calm Mind users like Clefable and Magearna thanks to its access to Psyshock. While Reuniclus's bulk is solid, Reuniclus is very slow and will often have to take a hit before it can move, which can force it into rather awkward situations when attempting to set up. If Reuniclus opts to run Acid Armor, it will find itself overly reliant on Toxic Spikes and Spikes support, meaning that it has to be played very patiently before it can pull off a sweep.\n", "strategies' format": "OU", "strategies": [{"name": "2 Attacks", "stats": [319, 149, 262, 286, 206, 107], "type": ["Psychic"], "usage": "Early-game, Reuniclus should attempt to stay healthy to check Pokemon such as Mega Medicham, Mega Lopunny, and Protean Greninja. Be careful about what to set up on early-game, as Reuniclus will often be forced out, and the opposing team will still be healthy enough to check it. Try to set up entry hazards early-game to use Reuniclus to force in checks like Greninja, Tyranitar, and Heatran that are easily worn down to facilitate a late-game sweep. If Reuniclus is running Focus Blast, take advantage of the fact that it can often lure in Dark-types that think they're safe hard switching in and try to catch them on the switch. However, be sure to sufficiently wear down Tyranitar into range of Focus Blast. Reuniclus should attempt to set up on Pokemon that can’t severely threaten it like Ferrothorn, Celesteela, and Chansey.", "moves": [["Calm Mind"], ["Psyshock"], ["Focus Blast", "Energy Ball"], ["Recover"]], "item": [" Leftovers", " Psychium Z"], "ability": ["Magic Guard"], "nature": ["Bold"], "ev spread": [252, 0, 212, 0, 0, 44], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Double Dance", "stats": [319, 149, 262, 286, 206, 107], "type": ["Psychic"], "usage": "Use Reuniclus to check Pokemon such as Mega Medicham, Mega Lopunny, and Protean Greninja early-game. Switch Reuniclus into Steel-types like Ferrothorn and Celesteela and other passive Pokemon such as Toxapex and Tangrowth to use them as setup bait. Use Recover liberally to stay healthy throughout the match to stay out of range from critical hits and to consistently check Fighting-types. If Toxic Spikes is up on the opposing side of the field, use Reuniclus to force in a Dark-type such as Ash-Greninja, Weavile, or Tyranitar. In a situation where Weavile or Tyranitar is expected to switch in, Reuniclus should use Acid Armor so that it can set up safely after. If Toxic Spikes isn't up on the field, Reuniclus should either double switch out to a teammate that can take on these respective Dark-types or use Acid Armor to safely escape Pursuit.", "moves": [["Calm Mind"], ["Acid Armor"], ["Psyshock"], ["Recover"]], "item": [" Leftovers", " Rocky Helmet"], "ability": ["Magic Guard"], "nature": ["Bold"], "ev spread": [252, 0, 212, 0, 0, 44], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Dark-types", "Ghost-types", "Taunt and Trick", "Strong Wallbreakers"], "credits": ["Written by Jordy and Ophi0n", "Earlier versions by Martin and GMars", "Quality checked by ABR, Talah, lyd, Jordy,  and DKM", "Grammar checked by lotiasite, The Dutch Plumberjack,  and Estronic"]}