{"name": "Sandile", "forms": {"Base": {"base stats": [50, 72, 35, 35, 35, 65], "types": ["Ground", "Dark"], "abilities": ["Anger Point", "Intimidate", "Moxie"], "tier": ["LC"], "form": "Base"}}, "overview": "Sandile's high Attack and decent Speed make it a decent Choice Scarf sweeper, especially when combined with its unique Dark / Ground typing, which very few Pokemon resist, and its fantastic ability, Moxie, which boosts its Attack each time it scores a KO. It also has good coverage moves, such as Fire Fang, that allow it to surprise slower would-be counters, hitting them even harder after Moxie boosts its Attack. However, Sandile is weak to several common offensive types such as Water, Grass, and Fighting, as well as to common priority moves such as Mach Punch, Vacuum Wave, and Aqua Jet, which is further compounded by its terrible bulk. Its mediocre Speed also means that it's reliant on a Choice Scarf in order to not get outsped and OHKOed, which means that it can be very difficult for Sandile to get going, as the opponent can just switch in a Pokemon that resists the move Sandile is locked into. Its lack of Knock Off and recovery moves also means that it faces stiff competition as an offensive Dark-type from Pawniard and Vullaby and as an offensive Ground-type from Diglett, which is faster and hits harder before Moxie.\n", "strategies' format": "LC", "strategies": [{"name": "Choice Scarf", "stats": [136, 247, 125, 95, 106, 225], "type": ["Ground", "Dark"], "usage": "Choice Scarf Sandile is best used as a cleaner later in the match when Pokemon that can wall it have been eliminated, especially after any Flying-types or Pokemon such as Cottonee and Vullaby that resist both of Sandile's STAB moves have been eliminated. Sandile is also very weak to a number of priority moves such as Mach Punch and Vacuum Wave, so it's good to clear out Pokemon such as Timburr and Croagunk that often have priority moves. The biggest difficulty with this set is beginning its sweep; Sandile is a nightmare for anything that doesn't resist it once Moxie activates, but before that happens, it's very difficult to score a KO on anything to activate Moxie. As a result, Sandile should be brought in on a weakened Pokemon or one that it can hit super effectively to score a quick KO. Sandile can also be used as either a revenge killer with its excellent Speed from Choice Scarf or a Pursuit trapper for Pokemon such as Abra and Gastly. However, if you're using Sandile as a revenge killer, keep in mind that its Attack is rather low before Moxie activates. Avoid switching Sandile into an attack, as its awful bulk means that it cannot take a hit from anything that it does not resist, and when predicting a switch-in that is resistant or immune to Sandile's STAB attacks, always use super effective or neutral coverage. Avoid using Fire Fang unless you are expecting the opponent to switch into a Pokemon such as Ferroseed that would wall Sandile's STAB moves.", "moves": [["Earthquake"], ["Crunch"], ["Fire Fang", "Stone Edge"], ["Pursuit", "Stone Edge"]], "item": [" Choice Scarf"], "ability": ["Moxie"], "nature": ["Adamant", "Jolly"], "ev spread": [0, 180, 76, 0, 0, 236], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fairy-types:", "Flying-types:", "Fighting-types:", "Grass-types:"], "credits": ["Written by lalden", "Quality checked by Hilomilo, Xayah,  and Nineage", "Grammar checked by Fireflame479 and Kris"]}