{"name": "Scraggy", "forms": {"Base": {"base stats": [50, 75, 70, 35, 70, 48], "types": ["Dark", "Fighting"], "abilities": ["Intimidate", "Moxie", "Shed Skin"], "tier": ["LC"], "form": "Base"}}, "overview": "Scraggy's unique Dark / Fighting typing gives it access to dual STAB coverage that hits a huge chunk of the LC metagame at least neutrally, which coupled with its fairly high Attack stat turns it into a threatening offensive Pokemon. Scraggy most often opts for a sweeper set, first using Dragon Dance to boost its Attack and patch up its mediocre Speed and then attempting to sweep opposing teams with its STAB attacks and variety of coverage moves. Alternatively, Scraggy can also become a threatening cleaner by using a Choice Scarf. Access to useful STAB moves helps Scraggy take advantage of the coverage that its typing gives it, especially Knock Off, Drain Punch, and High Jump Kick. Scraggy also can use two distinct abilities, both of which assist it in different ways. Moxie makes Scraggy more difficult to beat every time it KOes a foe, while Shed Skin gives it a way to shrug off status and more easily set up on status inducers. However, Scraggy suffers significantly from weaknesses to the common Fairy-, Flying-, and Fighting-types, which leave it often struggling to set up, despite its good defensive stats. Fairy-type Pokemon are especially troublesome, as they resist both of Scraggy's STAB moves. Additionally, though it has access to a wide variety of coverage moves, Scraggy must choose which to use, which means that depending on its set Scraggy can be walled by different Pokemon.\n", "strategies' format": "LC", "strategies": [{"name": "Dragon Dance Sweeper", "stats": [145, 225, 185, 95, 185, 203], "type": ["Dark", "Fighting"], "usage": "Dragon Dance Scraggy is a late-game sweeper and should be somewhat preserved throughout a match. It is primarily checked by Fairy-types, which resist both of its STAB attacks, and bulky Fighting- and Poison-types, such as Croagunk, Foongus, Timburr, and Mienfoo, so these Pokemon should be weakened and, if possible, hit by Knock Off before Scraggy attempts to sweep. Additionally, when choosing when to set up, keep in mind that Scraggy's coverage moves, especially Poison Jab, aren't particularly powerful even after a boost, so its checks should be weakened as much as possible even if Scraggy does carry a super effective coverage move. However, that doesn't mean it should not be used at all before attempting a sweep: early- to mid-game, Scraggy can lure in its checks and use Knock Off to weaken them for a sweep later in the game. After said checks have been weakened over the course of a battle, Scraggy should be brought in against a Pokemon that can't hit it super effectively, such as Ferroseed or Slowpoke, to set up and then sweep. Be careful, however, about letting Scraggy get worn down too much too early in a match, as if this happens, Scraggy will be susceptible to priority later in the game.", "moves": [["Dragon Dance"], ["High Jump Kick", "Drain Punch"], ["Knock Off"], ["Zen Headbutt", "Poison Jab", "Drain Punch"]], "item": [" Eviolite"], "ability": ["Shed Skin", "Moxie"], "nature": ["Jolly", "Adamant"], "ev spread": [36, 156, 36, 0, 36, 212], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Scarf", "stats": [145, 245, 176, 95, 176, 203], "type": ["Dark", "Fighting"], "usage": "Throughout the majority of the game, Scraggy should be used to revenge kill foes. Scraggy can bluff a Dragon Dance set early in the game, which will make Ghost-types less likely to switch into it for fear of Knock Off. After Scraggy's Choice Scarf has been revealed, Knock Off and Drain Punch are the safest moves to spam early in the game to wear down opposing teams if there are Ghost-types on the opponent's team. Ghost-types should be defeated before Scraggy locks itself into Drain Punch, but if there are no Ghost-types remaining on the field, Scraggy should lock itself into High Jump Kick when possible, as it is by far its most powerful attack. Be careful, however, of Protect users, such as Spritzee and Carvanha, when locking Scraggy into High Jump Kick, especially if Scraggy has revealed its Choice Scarf. Poison Jab, and Zen Headbutt if it is run, should only be used when absolutely necessary to weaken the Pokemon they are super effective against, as High Jump Kick will almost always hit harder. Late in a game, when the opponent's Fighting-type switch-ins have been worn down, Scraggy can use its Choice Scarf to clean an opposing team with High Jump Kick. The most efficient way to allow Scraggy to clean is to send it in when it can KO a foe and get a Moxie boost, as it immediately becomes very hard to switch into. Although it has decent bulk, Scraggy should usually not be switched in on opposing attacks, as if it is worn down it will be vulnerable to priority moves when attempting to clean late-game.", "moves": [["High Jump Kick"], ["Knock Off"], ["Poison Jab"], ["Drain Punch", "Zen Headbutt"]], "item": [" Choice Scarf"], "ability": ["Moxie"], "nature": ["Jolly"], "ev spread": [36, 236, 0, 0, 0, 212], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fairy-types", "Fighting-types", "Powerful Choice Scarf Users", "Abra"], "credits": ["Written by Nineage", "Quality checked by Rowan, Xayah,  and Hilomilo", "Grammar checked by P Squared and The Dutch Plumberjack"]}