{"name": "Servine", "forms": {"Base": {"base stats": [60, 60, 75, 60, 75, 83], "types": ["Grass"], "abilities": ["Contrary", "Overgrow"], "tier": [""], "form": "Base"}}, "overview": "Servine's main niche is being a bulky Defog user that can take on most Stealth Rock users due to its Grass typing. Access to Contrary and Leaf Storm also allows it to boost its Special Attack while using a strong STAB move, and access to reliable recovery in Synthesis helps Servine stay around longer. A decent Speed tier also lets Servine outspeed base 80 Speed Pokemon like Mesprit and Shiftry. Servine's bulk is decent, but a mediocre defensive typing isn't anything to write home about, and as it relies on Eviolite, it is very susceptible to Knock Off and should be wary of Pokemon that commonly use it. A low Special Attack stat means that Servine won't be doing much damage until it gets a boost, meaning that Pokemon like Assault Vest Hitmonchan can take it on. Servine also lacks special coverage moves, leaving offensive sets limited to a Grass-type STAB attack and Hidden Power and forcing it to choose which Pokemon it wants to beat. Leaf Storm's low PP also limits how much Servine can break through a team. Furthermore, Servine faces competition as a Defog user from Pokemon like Skuntank and Shiftry, which have either a better typing or better utility. Its main competition is Lurantis, which has the ability to run physical or mixed sets, is stronger and bulkier, and can afford to run different items, though Servine's main niche over Lurantis is its Speed.\n", "strategies' format": "PU", "strategies": [{"name": "Fast Utility", "stats": [219, 140, 186, 157, 186, 291], "type": ["Grass"], "usage": "Servine should be brought in on defensively oriented Pokemon like Clefairy, Ferroseed, and Gastrodon and Defog away entry hazards that the former two can set up. It also can switch into and beat other common Stealth Rock setters like Regirock and Carracosta, with its Grass-typing allowing it to check them. Servine can switch into some offensively oriented Pokemon, though only ones it has a type advantage against, as its bulk isn't too great. Servine is generally used more in a support role and shouldn't be solely relied on for an offensive sweep, though it can do this in a pinch. Servine should try and keep its HP as high as possible with Synthesis so it has more opportunities to come in and take care of hazards. Contrary also allows Servine to be a Defog and Sticky Web deterrent, as the boosts they give to Servine's evasion and Speed can be annoying for opposing teams. However, Servine is heavily pressured by many common offensive Pokemon like Pyroar and Skuntank, meaning that it may have to switch out immediately if it isn't absolutely necessary to remove hazards.", "moves": [["Leaf Storm"], ["Defog"], ["Synthesis"], ["Hidden Power Ice"]], "item": [" Eviolite"], "ability": ["Contrary"], "nature": ["Timid"], "ev spread": [252, 0, 0, 4, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fire-types", "Ice-types", "Flying-types", "Pokemon Resistant to or Immune to Grass", "Strong Wallbreakers"], "credits": ["Written by SergioRules", "Quality checked by Twix, Many,  and Megazard", "Grammar checked by The Dutch Plumberjack and lotiasite"]}