{"name": "Shelmet", "forms": {"Base": {"base stats": [50, 40, 85, 40, 65, 25], "types": ["Bug"], "abilities": ["Hydration", "Overcoat", "Shell Armor"], "tier": ["LC"], "form": "Base"}}, "overview": "Shelmet is set apart from other Spikes setters in the tier due to its good bulk and access to both Recover and a slow Baton Pass, allowing it to set up multiple layers of Spikes throughout the match and sponge a hit to bring a teammate in safely. It can also switch in on powder moves such as Foongus's Spore thanks to its access to Overcoat, giving it more opportunities to switch in. However, Shelmet has a small movepool and is often rendered setup bait due to its passivity and weak offenses. Its poor offensive presence means it cannot outdamage spinners and loses to them. Though its typing makes it resist the STAB moves of common Fighting-types, Shelmet cannot do much back to them, as they resist its attacks, and some of these Pokemon such as Timburr and Croagunk can still use Shelmet as setup bait if carrying a boosting move. Furthermore, Shelmet is weak to common Flying-types like Vullaby and Doduo, as well as the omnipresent Stealth Rock, forcing it to lose a quarter of its health as it switches in. While Shelmet's lack of Speed does help with bringing teammates in safely with Baton Pass, it also makes it more susceptible to Taunt from the likes of Mienfoo and Onix. Lastly, Shelmet faces competition with other entry hazard setters such as Ferroseed, Onix, and Dwebble due to them being more reliable.\n", "strategies' format": "LC", "strategies": [{"name": "Spikes", "stats": [165, 116, 269, 104, 225, 86], "type": ["Bug"], "usage": "Shelmet's primary focus should be on setting Spikes when its on the field. After setting up Spikes or if Shelmet needs to switch, Baton Pass should be used to bring in another Pokemon safely, as Shelmet can sponge a hit first before switching. Its nice bulk and access to Recover allow it to switch in throughout the match, and it can switch in on Foongus and Fighting-types lacking setup moves to set more layers of Spikes. It could also work as a lead to set up Spikes, but it has to be wary of other common leads like Onix and Dwebble, as Shelmet dislikes facing those. Lastly, Shelmet's passivity means it should avoid staying in on setup sweepers such as Shellder, Croagunk, and Vullaby, and instead pivot into a check with Baton Pass.", "moves": [["Spikes"], ["Recover"], ["Baton Pass"], ["Leech Life"]], "item": [" Eviolite"], "ability": ["Overcoat"], "nature": ["Impish"], "ev spread": [116, 0, 156, 0, 236, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fire-types", "Flying-types", "Rock-types", "Setup Sweepers", "Rapid Spin Users"], "credits": ["Written by crusty", "Quality checked by Xayah, Corporal Levi,  and Nineage", "Grammar checked by The Dutch Plumberjack and martha"]}