{"name": "Sigilyph", "forms": {"Base": {"base stats": [72, 58, 80, 103, 80, 97], "types": ["Psychic", "Flying"], "abilities": ["Magic Guard", "Tinted Lens", "Wonder Skin"], "tier": ["NU"], "form": "Base"}}, "overview": "Sigilyph is an offensive Defogger that can threaten entry hazard setters like Nidoqueen, Roserade, Mega Steelix, and Registeel with its combination of Psychic and Heat Wave. Magic Guard prevents damage from Stealth Rock, Life Orb, and status, allowing Sigilyph to avoid chip damage and use Defog more consistently. However, Sigilyph is largely outclassed by other hazard control options such as Mandibuzz and Gligar, which can check a lot of threats due to their superior bulk, and by Mega Blastoise, which offers better offensive presence. Because Sigilyph's Speed stat is only decent for an offensive Pokemon, it will struggle to revenge kill faster threats such as Shaymin, Virizion, and Salazzle. Bad defensive typing and bulk also leave it weak to common threats like Tyrantrum and susceptible to coverage moves found on Pokemon like Feraligatr, Virizion, and Mega Blastoise. Vulnerability to Pursuit from Pokémon like Drapion is another factor that makes it more unreliable. The prevalence of defensive Pokemon such as Mandibuzz, Milotic, and Porygon2 is a big problem, since Sigilyph can't beat them reliably with its STAB moves.\n", "strategies' format": "RU", "strategies": [{"name": "Offensive Defog", "stats": [180, 136, 197, 305, 196, 322], "type": ["Psychic", "Flying"], "usage": "Utilize slow pivots like Mega Ampharos, Gligar, and Mandibuzz to bring Sigilyph in safely. Roost is best used when forcing switches from slower Pokemon like Bewear and Machamp to heal so Sigilyph can find better opportunities to attack or use Defog later in the match. Utilize Magic Guard to switch into passive Pokemon like Milotic and Cresselia and remove entry hazards, especially if running Roost. When Sigilyph is on field, it’s usually good to use an appropriate coverage move, but you have to be attentive in the presence of Pokemon like Drapion and Sneasel, which can switch in on Psychic and Pursuit trap it. If the opposing team lacks a Pursuit trapper, Sigilyph can enter much more aggressively, especially against bulky builds that rely on status and hazard damage.", "moves": [["Psychic"], ["Heat Wave"], ["Roost", "Air Slash"], ["Defog"]], "item": [" Life Orb"], "ability": ["Magic Guard"], "nature": ["Timid"], "ev spread": [0, 0, 4, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Calm Mind", "stats": [180, 136, 197, 305, 196, 322], "type": ["Psychic", "Flying"], "usage": "With this set, Sigilyph can get opportunities to set up against Pokemon like Dragalge and Roserade after the Special Attack drop from their Draco Meteor and Leaf Storm as well as against Choice-locked Pokemon like Bewear, Emboar, and Gardevoir when they are locked into resisted moves. It also can get in against passive threats like Milotic, Florges, and Bronzong without Gyro Ball to set up and hit hard after some Calm Mind boosts. Roost must be used whenever it gets chipped down to minimize the chance of getting KOed by a critical hit after the boosts from Calm Mind. Try scouting for moves that can potentially stop Sigilyph from using Calm Mind comfortably, like Hidden Power Ice from Shaymin and Thunder Wave from Porygon2 and Cresselia. It's also good to reveal Calm Mind only when it's absolutely necessary, and this set must be careful about setting up when switch-ins still exist, especially Pursuit trappers.", "moves": [["Psychic"], ["Heat Wave"], ["Roost"], ["Calm Mind"]], "item": [" Life Orb"], "ability": ["Magic Guard"], "nature": ["Timid"], "ev spread": [0, 0, 4, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Mandibuzz", "Rock-types", "Dark-types", "Faster Attackers"], "credits": ["Written by GustavoYAY", "Quality checked by roman, teachable,  and MrAldo", "Grammar checked by CryoGyro and The Dutch Plumberjack"]}