{"name": "Snorlax", "forms": {"Base": {"base stats": [160, 110, 65, 65, 110, 30], "types": ["Normal"], "abilities": ["Gluttony", "Immunity", "Thick Fat"], "tier": ["RU"], "form": "Base"}}, "overview": "Snorlax's incredible bulk paired with solid setup via Curse and recovery in the forms of Recycle + Iapapa Berry and Rest allows it to be a niche setup sweeper in UU. However, Snorlax's extremely lackluster Defense prevents it from sweeping most teams comfortably, as it still gets destroyed by Fighting-type attacks even after boosting once or twice. Taunt users such as Hydreigon beat Snorlax sets with any sort of setup, as without boosts Snorlax has trouble breaking through most Pokemon.\n", "strategies' format": "UU", "strategies": [{"name": "Papa Lax (Curse + Recycle)", "stats": [419, 256, 204, 149, 310, 96], "type": ["Normal"], "usage": "Be extremely careful when playing around Toxic users such as Blissey, as once inflicted with Toxic poison, Snorlax has no chance of setting up Curse and gets worn down extremely quickly. Also, when unsure about whether or not the opponent has Toxic, make sure to scout for it. Furthermore, utilize Snorlax as a paralysis and burn absorber to prevent the opponent from playing around it with Toxic and boost Facade simultaneously. Utilize Snorlax's bulk to handle most special attackers such as Nidoking throughout a game and send it in for free setup against walls lacking Toxic. Attack offensive checks such as Cobalion by chipping them down with the appropriate attack as they switch in, as once these are gone, Snorlax has much greater breathing room to set up late-game. Take caution when switching into potential Trick users such as Chandelure, as being locked into a move will render Snorlax useless and prevent it from having any sort of recovery. Take advantage of entry hazards by manipulating them so that Snorlax can activate Iapapa Berry on its switch in. Avoid Knock Off from Pokemon such as Scizor and Krookodile at all cost, as without its Iapapa Berry, Snorlax's ability to set up and check special attackers becomes null. Play around Taunt users such as Hydreigon by switching to an offensive teammate that can handle it efficiently, as Snorlax gets completely shut down by Taunt.", "moves": [["Curse"], ["Facade"], ["Recycle"], ["Fire Punch", "Earthquake"]], "item": [" Iapapa Berry"], "ability": ["Gluttony"], "nature": ["Careful"], "ev spread": [252, 0, 152, 0, 104, 0], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "RestTalk", "stats": [419, 256, 204, 149, 310, 96], "type": ["Normal"], "usage": "Utilize Snorlax's immense special bulk to switch in and set up on special attackers such as Nidoking and Choice Scarf Hydreigon. Also capitalize on Snorlax's ability to beat passive Pokemon such as Blissey one-on-one by setting up on them. Make sure to weaken offensive checks lacking recovery such as Infernape by chipping them down with a STAB move as they switch in. If you are running Body Slam, try fishing for paralysis against offensive switch-ins such as Kommo-o. Utilize Snorlax's ability to absorb all status for teammates by switching it into status users such as Empoleon and Rotom-H. Don't try to set up with Snorlax early-game. Instead, use it as a bulky pivot that can absorb status until most of the counterplay your opponent has to it has been properly taken care of. Don't stay in against Taunt Pokemon such as Jellicent. Instead, use the opportunity to offensively pressure your opponent's team by switching to a teammate that threatens it.", "moves": [["Curse"], ["Return", "Body Slam"], ["Rest"], ["Sleep Talk", "Fire Punch", "Earthquake"]], "item": [" Leftovers"], "ability": ["Thick Fat"], "nature": ["Careful"], "ev spread": [252, 0, 152, 0, 104, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Ghost-types", "Knock Off", "Strong Fighting-type Coverage", "Taunt Users", "Toxic Poison", "Unaware Pokemon"], "credits": ["Written by roman", "Quality checked by Eyan, Cynde,  and Amaroq", "Grammar checked by P Squared and lotiasite"]}