{"name": "Stufful", "forms": {"Base": {"base stats": [70, 75, 50, 45, 50, 50], "types": ["Normal", "Fighting"], "abilities": ["Cute Charm", "Fluffy", "Klutz"], "tier": ["LC"], "form": "Base"}}, "overview": "Stufful is a unique and decent setup sweeper that can also function as an emergency check to physical attackers. Thanks to Fluffy and a good HP stat, Stufful is very physically bulky and can check Pokemon like Pawniard. It's not passive, either, hitting 18 Attack and getting access to Swords Dance. Normal / Fighting is a good offensive typing, letting Stufful's STAB moves hit almost the entire metagame, bar Ghost-types, for at least neutral damage. Stufful also gets good coverage moves like Ice Punch to hit Grass-types such as Pumpkaboo-XL and Foongus, Earthquake to hit Poison-types like Mareanie and Alolan Grimer, and Rock Slide to hit Flying- and Fire-types such as Vullaby and Larvesta. Unfortunately, for a sweeper, Stufful is quite slow, and while its physical bulk is phenomenal, its Special Defense is poor. It is completely walled by Ghost-types due to its only way of hitting them hard, Brutal Swing, having such a low Base Power. Fluffy gives Stufful a pseudo-weakness to Fire, meaning it is easily pressured by special Fire-types like Houndour and, to a lesser extent, physical Fire-types like Ponyta and Larvesta. As a result, Stufful is easily revenge killed and requires significant support to thrive. Stufful's best Fighting-type STAB attack with no drawback is Brick Break, and it misses out on the better STAB moves that other Fighting-types get, like Drain Punch, High Jump Kick, and Close Combat. Even with Fluffy, Stufful struggles against opposing Fighting-types and almost always loses against them one-on-one. Thus, it faces incredible amounts of competition from top-tier Fighting-types like Croagunk, Mienfoo, and Timburr, since many of the things Stufful does, they do as well.\n", "strategies' format": "LC", "strategies": [{"name": "Swords Dance", "stats": [176, 269, 145, 113, 185, 145], "type": ["Normal", "Fighting"], "usage": "Stufful can be used to sweep late-game after strong special attackers and its checks have been removed, but it can also be used as an early-game wallbreaker, especially if it's running Superpower. Swords Dance lets it break through bulky Pokemon early-game. Superpower should be saved for when most of the opposing Pokemon are hit hard by it, since Stufful will usually need to switch out after using it due to the stat drops. Stufful can be used to tank weaker attacks that make contact throughout the game like Knock Off from Pawniard. Don't let it take many special hits, or even a few strong ones, from the likes of Staryu, Gastly, and Magnemite; it doesn't have the best special bulk, and you would mainly be wasting its fantastic physical bulk, so you should let a teammate take special hits instead. Fairy-types generally stop Stufful's sweep, so they need to be taken out beforehand; Cottonee can lock Stufful into an undesirable move with Prankster Encore, and Spritzee survives a Swords Dance-boosted Return and can KO a weakened Stufful back with Moonblast. It's important for Stufful to only set up when its checks such as Foongus and Pumpkaboo-XL have been weakened, as they otherwise stop its sweep. Swords Dance should be used against a Pokemon that Stufful forces out, such as Pawniard or Alolan Sandshrew, or a physical attacker that can't do much damage to Stufful, like Onix or Diglett. Finally, be careful of all Fire-type moves; Fluffy doubles all damage taken from Fire-type attacks, effectively giving Stufful a weakness to them.", "moves": [["Swords Dance"], ["Return"], ["Brick Break", "Superpower"], ["Ice Punch", "Earthquake"]], "item": [" Eviolite"], "ability": ["Fluffy"], "nature": ["Adamant"], "ev spread": [0, 236, 36, 0, 196, 36], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fast Special Attackers", "Foongus", "Fire-types", "Ghost-types", "Fairy-types"], "credits": ["Written by Aaron's Aron and Gummy", "Quality checked by Hilomilo, Xayah,  and Corporal Levi", "Grammar checked by The Dutch Plumberjack and Fireflame479"]}