{"name": "Stunfisk", "forms": {"Base": {"base stats": [109, 66, 84, 81, 99, 32], "types": ["Ground", "Electric"], "abilities": ["Limber", "Sand Veil", "Static"], "tier": ["Untiered"], "form": "Base"}}, "overview": "A decent and unique defensive typing along with fairly good stats allows Stunfisk to act as a check to several offensive threats like Skuntank, Dodrio, Lycanroc, Aggron, and Scyther. Access to Stealth Rock allows Stunfisk to also provide entry hazard support, slowly chipping away at the opposing team. Static is also a good ability for a defensive Pokemon, spreading paralysis to further help out teammates. However, lack of reliable recovery is unhelpful for a defensive Pokemon like Stunfisk and leaves it open to being worn down quickly by status and chip damage. Its typing, while being great for checking many physical threats, unfortunately leaves Stunfisk weak to predominately specially based types like Ice, Grass, and Water from Pokemon such as Jellicent and Aurorus as well as giving it a weakness to Earthquake and other Ground-type attacks including those from the likes of Mudsdale and Kangaskhan. Stunfisk also faces heavy competition from other Stealth Rock setters, mainly Mudsdale, which can check most of the same Pokemon and has better overall utility.\n", "strategies' format": "PU", "strategies": [{"name": "Defensive Stealth Rock", "stats": [317, 151, 293, 198, 235, 100], "type": ["Ground", "Electric"], "usage": "Stunfisk is best switched in on attackers that can't do much damage to it and are threatened by paralysis like Scyther. It can then use this pressure to set up Stealth Rock. It is used as a physical sponge with its decent resistances and should be kept healthy so it can check Pokemon like Dodrio. Stunfisk should avoid switching into status, especially Toxic, that can wear it down. Stunfisk should usually use Discharge, as paralysis can be detrimental to almost anything in the metagame by slowing it down. Protect should be used to scout the opponent's moves and can also be used to stall out field effects like rain and Trick Room. Toxic should be used when the opponent has Pokemon that don't mind being paralyzed. Assault Vest Crabominable and Audino are much more threatened by poison.", "moves": [["Stealth Rock"], ["Discharge"], ["Earth Power"], ["Toxic", "Protect"]], "item": [" Leftovers"], "ability": ["Static"], "nature": ["Bold"], "ev spread": [252, 0, 252, 0, 4, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Special Attackers", "Ground-types", "Grass-types", "Bulky Setup Pokemon", "Residual Damage"], "credits": ["Written by SergioRules", "Quality checked by Akir, TJ,  and Megazard", "Grammar checked by Estronic and The Dutch Plumberjack"]}