{"name": "Taillow", "forms": {"Base": {"base stats": [40, 55, 30, 30, 30, 85], "types": ["Normal", "Flying"], "abilities": ["Guts", "Scrappy"], "tier": ["LC"], "form": "Base"}}, "overview": "Taillow is an excellent offensive Pokemon thanks to its two great abilities, Guts and Scrappy, and a base 85 Speed that allows it to outspeed most of the unboosted metagame. It also has extremely powerful STAB attacks in Brave Bird, Facade, and Boomburst. U-turn allows it to play around its checks and whittle them down so it or a teammate can pick them off. However, Taillow is extremely frail and cannot switch into any attack and will faint to most forms of priority. A weakness to Stealth Rock limits the number of times it can switch in. Taillow also does not have many coverage moves, and the ones it does have are not the best. It is heavily outclassed by other birds such as Vullaby and Doduo, which are bulkier or stronger than Taillow is. It has a mediocre Attack stat and a horrible Special Attack stat.\n", "strategies' format": "LC", "strategies": [{"name": "Mixed Life Orb", "stats": [104, 146, 105, 146, 94, 291], "type": ["Normal", "Flying"], "usage": "Try to avoid switching Taillow into any attacks, as it is quite frail and will usually not survive. Scout for Choice Scarf users such as Pawniard, Chinchou, and Magnemite that can threaten Taillow. Remove opposing Rock- and Steel-types first to allow Taillow to fire off Boombursts without anything resisting them. Use Boomburst as much as possible, since it is Taillow's strongest move and takes a large chunk out of the majority of the metagame. U-turn out of Taillow's checks and counters to wear them down so they can be picked off by Boomburst later.", "moves": [["Boomburst"], ["Heat Wave"], ["Hidden Power Grass", "U-turn"], ["Brave Bird"]], "item": [" Life Orb"], "ability": ["Guts", "Scrappy"], "nature": ["Naive"], "ev spread": [0, 0, 36, 200, 36, 236], "iv spread": [19, 31, 31, 31, 31, 31]}, {"name": "Guts Physical Sweeper", "stats": [125, 205, 96, 86, 96, 291], "type": ["Normal", "Flying"], "usage": "Because this set relies on Guts being activated, it is important to try to get Flame Orb activated as soon as possible so Taillow can start doing tons of damage. The best way to do this is to either use Protect or use a slow pivot move user such as Chinchou or Mienfoo. Another way to get Flame Orb activated is to revenge kill an opposing Pokemon that Taillow does not need the Guts boost for. U-turn out of Taillow's checks and counters to wear them down so they can be picked off by Facade later.", "moves": [["Facade"], ["Brave Bird"], ["Quick Attack"], ["U-turn", "Protect"]], "item": [" Flame Orb"], "ability": ["Guts"], "nature": ["Jolly"], "ev spread": [36, 236, 0, 0, 0, 236], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Defensive Rock- and Steel-types", "Revenge Killers"], "credits": ["Written by sam-testings", "Quality checked by Nineage, Rowan,  and Fiend", "Grammar checked by The Dutch Plumberjack and P Squared"]}