{"name": "Toxicroak", "forms": {"Base": {"base stats": [83, 106, 65, 86, 65, 85], "types": ["Poison", "Fighting"], "abilities": ["Anticipation", "Dry Skin", "Poison Touch"], "tier": ["RU"], "form": "Base"}}, "overview": "Toxicroak is able to carve a niche for itself in UU thanks to Dry Skin, which allows it to use the tier's ever-present bulky Water-types as setup bait. In addition to easily setting up against the likes of Alomomola and Suicune, it can utilize its decent typing to threaten a plethora of common threats, including Bisharp, Togekiss, and Primarina, while finding setup opportunities against big presences such as Amoonguss. Toxicroak also has access to useful coverage options like Sucker Punch and Ice Punch, which it can use to deal with the few Pokemon that don't already succumb to its STAB attacks. The former move can also patch up Toxicroak's vulnerability to several faster Pokemon that may try revenge killing it like Latias, Starmie, and Gengar. Unfortunately, Toxicroak is still often outperformed by similar Fighting-types in Infernape, Cobalion, and Terrakion due to its worse Speed, poorer type coverage, and lack of access to a reliable powerful Fighting-type attack. Toxicroak is also quite frail, which alongside its common weaknesses leaves it susceptible to several Pokemon that outspeed it like Mega Aerodactyl, Krookodile, and Hydreigon. Lastly, Toxicroak struggles to break past the tier's common defensive Ground-types, such as Swampert and Hippowdon, which can all tank an attack and OHKO it.\n", "strategies' format": "UU", "strategies": [{"name": "Swords Dance", "stats": [202, 311, 166, 187, 167, 295], "type": ["Poison", "Fighting"], "usage": "Toxicroak should look to begin sweeping once its defensive checks like Hippowdon and Swampert are removed. Revenge killers that don't fear Sucker Punch, such as Infernape and Choice Scarf Krookodile, should also be removed in order to maximize Toxicroak's chances of cleaning up late-game. When it's ready to set up, it should switch in on Water-types like Alomomola and Choice-locked Primarina because of the pseudo-immunity to their Water-type attacks that Dry Skin will provide. Dry Skin also helps Toxicroak check these Pokemon as well, as it may not be able to set up and sweep upon forcing them out but can still prevent them from fulfilling their roles. If running Poisonium Z, Toxicroak should activate it if it needs to secure a crucial KO without worrying about Gunk Shot's accuracy, such as against Volcanion, or if it wants to power through a defensive Pokemon like Alomomola or Suicune in one hit. If it's being run, Darkinium Z should be activated against threats that can cripple Toxicroak upon tanking a hit or evading Sucker Punch. Said threats include Doublade and Slowbro. Toxicroak should keep Sucker Punch hidden if Pokemon like Nihilego and Latias are on the opposing team, as they would likely think that they can easily revenge kill it if under the impression that it isn't running priority to OHKO them after a boost.", "moves": [["Swords Dance"], ["Drain Punch"], ["Gunk Shot"], ["Sucker Punch", "Ice Punch"]], "item": [" Life Orb", " Poisonium Z", " Darkinium Z"], "ability": ["Dry Skin"], "nature": ["Jolly"], "ev spread": [0, 252, 0, 0, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Faster Pokemon", "Flying-types", "Poison-types", "Ground-types", "Psychic-types"], "credits": ["Written by Hilomilo", "Earlier versions by Rakan", "Quality checked by Bouff, martha,  and Eyan", "Grammar checked by martha and The Dutch Plumberjack"]}