{"name": "Vileplume", "forms": {"Base": {"base stats": [75, 80, 85, 110, 90, 50], "types": ["Grass", "Poison"], "abilities": ["Chlorophyll", "Effect Spore"], "tier": ["NU"], "form": "Base"}}, "overview": "Vileplume's incredible defensive typing and access to a wide assortment of utility moves allow it to pivot into and check top-tier threats such as Passimian, Steelix, Heliolisk, and Sceptile. In particular, Vileplume's access to two reliable forms of recovery, Sleep Powder, and Growth enables it to be menacing against offensive and defensive teams alike, and Effect Spore lets Vileplume dissuade Pokemon such as Passimian and Xatu from spamming U-turn. On top of this, Vileplume's high natural Special Attack and Sludge Bomb's chance to poison means Vileplume is considerably less passive than other options and is able to do solid amounts of damage to checks such as Xatu and Incineroar. However, Vileplume's poor Speed and handful of weaknesses to common attacking types mean it fails to hold its own against attackers such as Mega Glalie, Swords Dance Incineroar, and Medicham. In addition, Vileplume's heavy reliance on status moves and lack of coverage options mean it's often setup fodder for the likes of Klinklang, Delphox, and Braviary. Finally, without proper investment, Vileplume can fall short of checking powerful physical attackers such as Swords Dance Torterra and Choice Band Dhelmise.\n", "strategies' format": "NU", "strategies": [{"name": "Specially Defensive", "stats": [249, 176, 207, 256, 306, 136], "type": ["Grass", "Poison"], "usage": "Vileplume can effectively pivot into attackers such as Passimian, Heliolisk, Sceptile, and Rhydon and threaten them with status or a decently powerful attack. Sludge Bomb is the best attacking option to use in terms of dealing damage due to its overall high Base Power and chance to poison. Avoid reckless use of Moonlight, as its low PP count limits its uses. To remedy this, Vileplume should use Giga Drain or Strength Sap in crucial scenarios where the PP preservation of Moonlight is needed to keep attackers like Heliolisk in check. Sleep Powder should be used in order to cripple switch-ins and generate momentum for its team; Pokemon that can normally exploit Vileplume such as Braviary and Klinklang are annoyed by Sleep Powder, letting frail foes such as Heliolisk and Houndoom switch in for free. Growth is best utilized against bulkier teams as a way to pressure defensive Pokemon like Xatu and Steelix, which Vileplume can use as setup fodder.", "moves": [["Giga Drain"], ["Sludge Bomb"], ["Strength Sap", "Moonlight"], ["Growth", "Sleep Powder"]], "item": [" Black Sludge"], "ability": ["Effect Spore"], "nature": ["Calm"], "ev spread": [252, 0, 4, 0, 252, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Poison-types", "Steel-types", "Powerful Wallbreakers", "Psychic-types", "Setup Sweepers"], "credits": ["Written by tondas", "Earlier versions by banks", "Quality checked by quziel, Rabia,  and Espeonage.", "Grammar checked by The Dutch Plumberjack and A Cake Wearing A Hat"]}