{"name": "Weezing", "forms": {"Base": {"base stats": [65, 90, 120, 85, 70, 60], "types": ["Poison"], "abilities": ["Levitate"], "tier": ["NU"], "form": "Base"}}, "overview": "Weezing differentiates itself from other defensive Poison-types such as Garbodor and Golbat due to its access to Levitate, which lets it check Ground-types such as Steelix and Rhydon without a weakness to Spikes. Additionally, Weezing's Poison typing allows it to check both Fighting- and Grass-type Pokemon such as Passimian, Decidueye, and Sceptile. Weezing's access to the combination of Will-O-Wisp and Taunt lets it be effective against more defensive teams. Unfortunately, Weezing faces heavy competition for the spot of a bulky Poison-type from Pokemon like Vileplume and Golbat, which have better Special Defense stats, allowing them to better check specially offensive Grass-types such as Whimsicott and Sceptile, as well as having access to more reliable recovery moves such as Strength Sap and Roost.\n", "strategies' format": "NU", "strategies": [{"name": "Defensive", "stats": [229, 194, 345, 206, 198, 160], "type": ["Poison"], "usage": "Because of Weezing's high Defense and Poison typing, it can be switched directly into Fighting-type Pokemon such as Passimian and Scrafty to check them. Look to use Will-O-Wisp to burn threatening physical attackers such as Decidueye and Sneasel and to cripple defensive Pokemon such as Steelix and Rhydon. Be wary of letting Weezing take too much damage from special attackers such as Whimsicott and Sceptile, as Weezing's low Special Defense does not allow it to check them easily, even with investment. Additionally, Sceptile and Whimsicott can carry coverage moves such as Psychic and Hidden Power Psychic to hit Weezing for super effective damage. Weezing should use Pain Split when low on health and when it can force the opposing Pokemon out, such as when against Passimian, Steelix, and Piloswine, as this maximizes the healing Pain Split will provide. Weezing should aim to set Toxic Spikes as early as possible if the opponent has no grounded Poison-types to absorb them. Taunt should be used both to prevent setup sweepers like Decidueye from setting up and to prevent utility-based Pokemon like Mega Audino and Vaporeon from using moves like Wish and Heal Bell.", "moves": [["Sludge Bomb"], ["Will-O-Wisp"], ["Pain Split"], ["Toxic Spikes", "Taunt"]], "item": [" Rocky Helmet", " Black Sludge"], "ability": ["Levitate"], "nature": ["Bold"], "ev spread": [252, 0, 152, 0, 88, 16], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Strong Special Attackers", "Psychic-types", "Ghost-types", "Chip Damage"], "credits": ["Written by Rabia", "Quality checked by quziel, Eternally,  and banks", "Grammar checked by martha and A Cake Wearing A Hat"]}