{
    "name": "Absol",
    "forms": {
        "Base": {
            "base stats": [
                65,
                130,
                60,
                75,
                60,
                75
            ],
            "types": [
                "Dark"
            ],
            "abilities": [
                "Justified",
                "Pressure",
                "Super Luck"
            ],
            "tier": [
                "PU"
            ],
            "form": "Base"
        },
        "Mega": {
            "base stats": [
                65,
                150,
                60,
                115,
                60,
                115
            ],
            "types": [
                "Dark"
            ],
            "abilities": [
                "Magic Bounce"
            ],
            "tier": [
                "RUBL"
            ],
            "form": "Mega"
        }
    },
    "overview": "Mega Absol has a niche in UU as a fast offensive trapper that's able to utilize its relatively high Speed and good movepool featuring Pursuit and Knock Off to outspeed and trap threats such as Latias and Gengar. Mega Absol also boasts solid coverage, with moves such as Superpower, Iron Tail, and Fire Blast allowing it to hit some if its switch-ins such as Terrakion, Sylveon, and Scizor. Magic Bounce is a decent ability as well, giving Absol the capability to bounce back Thunder Wave and Will-O-Wisp as well as potentially dissuade the use of entry hazards. However, Absol is immensely frail, which makes it very difficult to get into battle safely as well as very vulnerable to priority. It is somewhat weak overall, as its moves have somewhat low power, and it cannot hold any items to boost its damage output. Its typing also burdens it with three very common weaknesses, leaving it vulnerable to popular threats such Cobalion, Scizor, and Mega Altaria. Finally, Absol also faces major competition as a Pursuit trapper from Alolan Muk, Bisharp, and Krookodile, since they do not occupy a Mega slot, have more bulk, and also strong secondary typings to give them defensive utility as well as better coverage offensively. Thus, Absol's combination of power, speed, and coverage become its main selling points over its competition; make sure to take advantage of these traits well to ensure Absol doesn't become outclassed.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "All-Out Attacker",
            "stats": [
                166,
                399,
                156,
                266,
                141,
                361
            ],
            "type": [
                "Dark"
            ],
            "usage": "Mega Absol functions mainly as an offensive utility threat; send it in early- or mid-game and use its coverage, Knock Off, and Pursuit to pressure the opposing team. Since it is very frail, it should not switch directly into anything and needs support to get in safely. Double switching with prediction U-turn and Volt Switch support are useful to help it get into battle. Mega Absol should be used to Pursuit trap threats such as Latias, Gengar, and Chandelure, so it should remain healthy if its trapping abilities are needed. Mega Absol's coverage moves are useful for punishing its potential switch-ins, such as Hydreigon and Terrakion, possibly weakening them for teammates that have trouble with said Pokemon. If Mega Absol is carrying Sucker Punch in particular, it is wise to play carefully when trying to Pursuit trap certain Pokemon; Choice Scarf variants of Chandelure and Latias not locked into a move can easily revenge kill and defeat Absol if it doesn't click Sucker Punch while they can take Pursuit if they stay in. So in some situations, it may be better to use Knock Off or Sucker Punch to get the KO. When using Mega Absol, read situations carefully to win potential mind games with it and win against Pokemon it is supposed to check. In particular, it is advised not to use Pursuit against Starmie and Choice Scarf Latias unless you have revealed Sucker Punch. Mega Absol does not sweep teams on its own, so it is best used to weaken its potential checks and trap certain Pokemon to support its team.",
            "moves": [
                [
                    "Knock Off"
                ],
                [
                    "Pursuit"
                ],
                [
                    "Fire Blast",
                    "Superpower"
                ],
                [
                    "Sucker Punch",
                    "Iron Tail"
                ]
            ],
            "item": [
                " Absolite"
            ],
            "ability": [
                "Justified"
            ],
            "nature": [
                "Naive",
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                0,
                0,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fairy-types",
        "Revenge Killers",
        "Priority",
        "Physically Bulky Pokemon",
        "Fighting-types"
    ],
    "credits": [
        "Written by ScraftyIsTheBest",
        "Quality checked by Cynde, A Cake Wearing a Hat,  and Nuked",
        "Grammar checked by allstarapology and The Dutch Plumberjack"
    ]
}