{"name": "Accelgor", "forms": {"Base": {"base stats": [80, 70, 40, 100, 60, 145], "types": ["Bug"], "abilities": ["Hydration", "Sticky Hold", "Unburden"], "tier": ["NU"], "form": "Base"}}, "overview": "Thanks to Accelgor's blistering Speed stat, great Special Attack in tandem with Choice Specs, and valuable coverage coupled with utility moves like Spikes, Accelgor cements itself as a huge annoyance to teams. Adding onto the point of Accelgor's coverage, Accelgor is capable of dealing massive damage to many unsuspecting Pokemon, such as hitting Steelix with Focus Blast. Accelgor outpaces the most common Choice Scarf user in NU, Passimian, making Accelgor even more menacing to teams where Passimian is the designated Choice Scarf holder. Unfortunately, Accelgor has rather lackluster defensive stats and a poor defensive typing, making it extremely difficult to use efficiently and preventing it from switching into nearly anything in the metagame well.\n", "strategies' format": "NU", "strategies": [{"name": "Choice Specs", "stats": [196, 158, 117, 299, 156, 427], "type": ["Bug"], "usage": "Due to Accelgor's poor defensive stats, it should avoid switching into foes multiple times, and it is best brought in with the help of VoltTurn users against Pokemon like Slowking and Guzzlord that it can capitalize on. If the opponent is expected to bring in a counter to Accelgor, sometimes it's best to use Spikes on the switch, pressuring the opponent heavily throughout the game. On the flip side, if the opponent is likely to switch into a Steel- or Rock-type like Silvally-Steel or Rhydon, predicting that and going for Focus Blast or Energy Ball can throw off the opponent and allow Accelgor to gain momentum rapidly. Likewise, if a Bug-resistant Pokemon is expected to switch in like Palossand or Steelix, Energy Ball and Focus Blast are the best moves Accelgor should go for.", "moves": [["Bug Buzz"], ["Focus Blast"], ["Energy Ball"], ["Spikes"]], "item": [" Choice Specs"], "ability": ["Sticky Hold"], "nature": ["Timid"], "ev spread": [0, 0, 4, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Flying-types", "Faster Pokemon and Priority Users", "Rock-types", "Steel-types", "Fire-types"], "credits": ["Written by banks", "Quality checked by Eternally, kay,  and Earth", "Grammar checked by The Dutch Plumberjack and A Cake Wearing A Hat"]}