{"name": "Aerodactyl", "forms": {"Base": {"base stats": [80, 105, 65, 60, 75, 130], "types": ["Rock", "Flying"], "abilities": ["Pressure", "Rock Head", "Unnerve"], "tier": ["NU"], "form": "Base"}, "Mega": {"base stats": [80, 135, 85, 70, 95, 150], "types": ["Rock", "Flying"], "abilities": ["Tough Claws"], "tier": ["UU"], "form": "Mega"}}, "overview": "Mega Aerodactyl is one of the most dominant offensive Pokemon in the UU metagame thanks to its combination of speed, power, and versatility, allowing it to fit on every team archetype. Its immense base 150 Speed makes it the fastest unboosted Pokemon in the tier. A sizable base 135 Attack coupled with Tough Claws and a wide arsenal of moves, such as Stone Edge, Earthquake, Ice Fang, and Pursuit, allows Mega Aerodactyl to hit a vast amount of Pokemon in the tier super effectively. Pursuit lets it trap common Pokemon, such as Latias, Gengar, and Celebi. However, even with its vast movepool, Mega Aerodactyl still does not possess the necessary firepower to break through some of UU's bulkier walls, such as Swampert and Mega Aggron. Mega Aerodactyl is also susceptible to Stealth Rock due to its part Flying typing and weak to the powerful priority moves that flood the UU metagame, such as Bullet Punch from Scizor and Ice Shard from Mamoswine, meaning that it can be worn down rather easily when not packing Roost. Lastly, Mega Aerodactyl is outsped by common Choice Scarf users such as Krookodile and Hydreigon, which can revenge kill it after Stealth Rock damage.\n", "strategies' format": "UU", "strategies": [{"name": "Offensive", "stats": [196, 369, 207, 158, 226, 438], "type": ["Rock", "Flying"], "usage": "Use Mega Aerodactyl's typing to bring it in against resisted hits from the likes of Mega Pidgeot and Togekiss when Stealth Rock is not present or if it is running Roost. Mega Aerodactyl's high base Speed and good coverage also allow it to be brought in to revenge kill Pokemon such as Mega Manectric, Mega Pidgeot, and Mega Beedrill. Due to its wide arsenal of moves, Mega Aerodactyl is very good against offense. Weaken opposing teams as much as possible to give Mega Aerodactyl a chance to sweep late-game. Avoid bringing Mega Aerodactyl into Stealth Rock, as this limits the number of times it can come in throughout the match; this is especially important if Mega Aerodactyl is lacking Roost. However, do note that Mega Aerodactyl can pivot into some Stealth Rock users like Hippowdon to threaten them with its super effective coverage moves and avoid Stealth Rock damage. If the opposing Pokemon is in range of one of Mega Aerodactyl's coverage moves, use the coverage move instead of Stone Edge to beat it, as Stone Edge has less accuracy. Weakening opposing bulky Water- and Ground-types such as Slowbro, Swampert, and Hippowdon is vital, as they can stop Mega Aerodactyl's sweep with ease. Latias can be Pursuit trapped if it is locked into Draco Meteor after a stat drop. If a Hippowdon has recently been on the field and sandstorm is up, Mega Aerodactyl can pivot into and trap foes like Gengar and Latias more easily due to its increased Special Defense.", "moves": [["Stone Edge"], ["Earthquake"], ["Pursuit", "Roost"], ["Roost", "Ice Fang", "Aqua Tail"]], "item": [" Aerodactylite"], "ability": ["Unnerve"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Water-types", "Ground-types", "Steel-types", "Priority Moves and Faster threats"], "credits": ["Written by Indigo Plateau", "Earlier versions by Amaroq", "Quality checked by Amane Misa, Sage,  and martha", "Grammar checked by martha and A Cake Wearing A Hat"]}