{
    "name": "Altaria",
    "forms": {
        "Base": {
            "base stats": [
                75,
                70,
                90,
                70,
                105,
                80
            ],
            "types": [
                "Dragon",
                "Flying"
            ],
            "abilities": [
                "Cloud Nine",
                "Natural Cure"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        },
        "Mega": {
            "base stats": [
                75,
                110,
                110,
                110,
                105,
                80
            ],
            "types": [
                "Dragon",
                "Fairy"
            ],
            "abilities": [
                "Pixilate"
            ],
            "tier": [
                "UU"
            ],
            "form": "Mega"
        }
    },
    "overview": "Altaria's Mega Evolution gifts it with several notable improvements, ranging from stat boosts to a strong typing in Dragon / Fairy and a fantastic ability in Pixilate. Its well-rounded stats and access to a plethora of utility options like Dragon Dance, Heal Bell, Defog, and Fire Blast among others make Mega Altaria an incredibly versatile Pokemon that can run a variety of sets viably and fit on all playstyles. Due to its fantastic defensive typing, Mega Altaria offers teams a strong answer to threats like Hydreigon, Rotom-H, and Crawdaunt, often no matter what set it opts to use itself. However, Mega Evolving in a timely manner is crucial for Altaria to fulfill these defensive responsibilities. Additionally, while its stats are well-distributed, Mega Altaria is ultimately held back by its unspectacular attacking and Speed stats. Its initial lack of formidable damage output leads to struggles against bulky foes such as Sylveon, defensive Primarina, and Mega Aggron, while its mediocre Speed leaves it easily revenge killed by threats like Nidoking, Nihilego, and Cobalion. Also, while Altaria loses its Stealth Rock weakness upon Mega Evolution, it becomes susceptible to all other entry hazards. This combines with its lack of passive recovery to make Mega Altaria easily worn down, often leading to a constant need to sacrifice momentum by using Roost.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "Offensive Dragon Dance",
            "stats": [
                204,
                350,
                256,
                230,
                246,
                242
            ],
            "type": [
                "Dragon",
                "Fairy"
            ],
            "usage": "Mega Evolve as soon as possible if Mega Altaria's defensive typing is needed to handle threats such as Hydreigon and Crawdaunt. As common checks like Mega Aggron, Mega Steelix, and Choice Band Scizor lack recovery, it is often beneficial to throw out attacks early on, especially in combination with entry hazards, as they can be softened or eventually removed for a sweep late-game. Use Dragon Dance when Mega Altaria's checks have been weakened to the point where a sweep is possible; otherwise, it often results in a large loss of momentum. If running Refresh, Mega Altaria can comfortably set up on bulky status-reliant foes like Rotom-H and Alomomola, while Earthquake variants are heavily annoyed by their Toxic damage and should thus avoid such situations. Otherwise, Mega Altaria can set up fairly easily in front of foes like Hydreigon, Chesnaught, and Zeraora, which often struggle to meaningfully threaten it. As this Mega Altaria set heavily invests into its offensive capabilities, avoid switching it directly into strong neutral attacks like Mega Aerodactyl's Stone Edge and Latias's Psychic. While it is generally preferred to Mega Evolve as soon as possible, at times regular Altaria's defensive typing, specifically its Ground immunity, can come into play and possibly present Altaria with setup opportunities against Pokemon like Krookodile and Hippowdon.",
            "moves": [
                [
                    "Dragon Dance"
                ],
                [
                    "Return"
                ],
                [
                    "Earthquake",
                    "Refresh"
                ],
                [
                    "Roost"
                ]
            ],
            "item": [
                " Altarianite"
            ],
            "ability": [
                "Natural Cure"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                72,
                252,
                0,
                0,
                0,
                184
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Support",
            "stats": [
                249,
                256,
                350,
                256,
                247,
                176
            ],
            "type": [
                "Dragon",
                "Fairy"
            ],
            "usage": "Mega Evolve Altaria as soon as possible if it is necessary to handle foes such as Hydreigon and Crawdaunt. Mega Altaria also makes for a fantastic switch-in to other threats like Krookodile, Infernape, and Crawdaunt, so take advantage of Roost to keep Mega Altaria at adequate amounts of health to handle such foes. Use Heal Bell to cure teammates of status ailments that neuter their longevity. Mega Altaria is capable of stomaching Scizor's Bullet Punch if necessary to KO in return with Flamethrower, although it is best to avoid such situations if Mega Altaria is needed to adequately check other foes. At times it is advantageous to not Mega Evolve immediately, as regular Altaria's Flying typing can aid its one-on-one matchup against foes like Hippowdon, Swampert, and Krookodile, and Natural Cure can heal it of any status conditions upon switching out.",
            "moves": [
                [
                    "Body Slam",
                    "Return"
                ],
                [
                    "Heal Bell",
                    "Defog"
                ],
                [
                    "Roost"
                ],
                [
                    "Flamethrower",
                    "Earthquake",
                    "Defog"
                ]
            ],
            "item": [
                " Altarianite"
            ],
            "ability": [
                "Natural Cure"
            ],
            "nature": [
                "Relaxed",
                "Impish"
            ],
            "ev spread": [
                252,
                0,
                252,
                0,
                4,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Mixed Attacker",
            "stats": [
                248,
                325,
                257,
                230,
                246,
                220
            ],
            "type": [
                "Dragon",
                "Fairy"
            ],
            "usage": "Mega Evolve as soon as possible if Mega Altaria is necessary to handle big threats like Hydreigon and Crawdaunt. Mega Altaria can offensively check Infernape and the aforementioned foes well due to its bulk and defensive typing, but it must use Roost to remain at high enough amounts of HP to handle them consistently, often resulting in losses of momentum. Answers to Dragon Dance Mega Altaria such as Amoonguss and Steel-types make for common initial switch-ins to it, meaning Fire Blast is often a great move to use prior to revealing Mega Altaria's set. Mega Altaria is capable of stomaching one hit from any Scizor set in order to KO in return with Fire Blast, but it is often at the cost of Mega Altaria's future defensive capabilities, so decide accordingly when it is necessary to do so.",
            "moves": [
                [
                    "Return",
                    "Body Slam"
                ],
                [
                    "Earthquake"
                ],
                [
                    "Fire Blast"
                ],
                [
                    "Roost"
                ]
            ],
            "item": [
                " Altarianite"
            ],
            "ability": [
                "Natural Cure"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                248,
                160,
                4,
                0,
                0,
                96
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Steel-types",
        "Ground-immune Fire-types",
        "Bulky Fairy-types",
        "Poison-types"
    ],
    "credits": [
        "Written by Pak",
        "Quality checked by vivalospride, Nuked,  and Hilomilo",
        "Grammar checked by The Dutch Plumberjack and Rabia"
    ]
}