{
    "name": "Ambipom",
    "forms": {
        "Base": {
            "base stats": [
                75,
                100,
                66,
                60,
                66,
                115
            ],
            "types": [
                "Normal"
            ],
            "abilities": [
                "Pickup",
                "Skill Link",
                "Technician"
            ],
            "tier": [
                "NU"
            ],
            "form": "Base"
        }
    },
    "overview": "Ambipom's niche is in its access to STAB- and Technician-boosted Fake Out, which allows it to pressure most offensive teams with a relatively strong priority move. Furthermore, U-turn coupled with decent offensive stats allows Ambipom to act as an offensive pivot. However, STAB priority is much better on Pokemon such as Sneasel, Comfey, and Decidueye because not only do their priority moves provide stronger offensive coverage, they can also be used more than once after they enter battle. While Ambipom may be fast and decently strong, it cannot take a hit thanks to its poor bulk, and it has mediocre firepower due to being reliant on its Normal STAB moves for damage, rather than super effective coverage, which makes it difficult for Ambipom to even dent the top defensive cores in NeverUsed, which is why it is outclassed as an all-out offensive pivot by Pokemon such as Passimian, Heliolisk, Rotom, and Whimsicott. Ambipom is also very easy to wear down because it is vulnerable to all entry hazards, status conditions, and the recoil from Life Orb. All of these flaws make Ambipom a very poor choice to put on a team in the current NeverUsed environment.\n",
    "strategies' format": "NU",
    "strategies": [
        {
            "name": "Offensive Pivot",
            "stats": [
                186,
                299,
                169,
                140,
                168,
                361
            ],
            "type": [
                "Normal"
            ],
            "usage": "Ambipom is a full-on offensive Pokemon that checks frail threats with Fake Out. Fake Out is generally a safe play to make on the first turn and can be used mid- or late-game to check and revenge kill weakened threats. Keep in mind that a predicted Fake Out can lead to a switch to a Pokemon that can resist the move such as Steelix, Rhydon, or Rotom. Return should be used to get good, consistent damage on the opponent's team once Ambipom's normal checks and counters are gone. Low Kick should be used to get sizable damage on Pokemon like Steelix, Silvally-Steel, and Rhydon, which Ambipom can outspeed and has a chance to revenge kill with entry hazards up. Since Ambipom forces so many switches because of Fake Out, you could also take advantage of Pursuit to pressure the opponent even more. This is especially effective on Dark-weak Pokemon like Slowking and Delphox, and frail Pokemon like Heliolisk. Do not switch in Ambipom on any attack because it needs to be as healthy as possible to revenge kill weakened foes, and do not let it take any status condition. Burn halves its Attack, paralysis cripples its speed, sleep makes it a sitting duck, and Toxic depletes its HP, putting Ambipom on a timer. If you must switch in Ambipom, then a partner with a slow U-turn or Volt Switch is highly recommended. Ambipom can also safely come in on a predicted double switch, but try to make sure that all entry hazards are cleared, since they cut into Ambipom's longevity.",
            "moves": [
                [
                    "Fake Out"
                ],
                [
                    "Return"
                ],
                [
                    "Low Kick",
                    "Pursuit"
                ],
                [
                    "U-turn"
                ]
            ],
            "item": [
                " Life Orb"
            ],
            "ability": [
                "Technician"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Rock-type and Steel-type Pokemon",
        "Fighting-type Pokemon",
        "Ghost-type Pokemon",
        "Faster Pokemon",
        "Physically Bulky Pokemon"
    ],
    "credits": [
        "Written by JustoonSmitts",
        "Quality checked by Punchshroom, Earth,  and Rabia",
        "Grammar checked by The Dutch Plumberjack and Kris"
    ]
}