{"name": "Amoonguss", "forms": {"Base": {"base stats": [114, 85, 70, 85, 80, 30], "types": ["Grass", "Poison"], "abilities": ["Effect Spore", "Regenerator"], "tier": ["UU"], "form": "Base"}}, "overview": "With a large HP stat and a good defensive typing that allows it to handle metagame staples such as Ash-Greninja, Tapu Koko, Tapu Bulu, and Tangrowth, Amoonguss is a decent defensive Pokemon. Amoonguss also has five key resistances to Grass, Water, Electric, Fairy, and Fighting and access to a wide number of valuable utility moves such as Spore, Stun Spore, and Clear Smog. Amoonguss's excellent defensive ability in Regenerator only further bolsters Amoonguss's defensive prowess, as it keeps Amoonguss from having to waste time recovering, meaning it doesn't lose momentum as easily and can be a good pick on more offensively oriented teams despite not having a strong offensive presence. Unfortunately, Amoonguss' defensive typing also gives it some nasty weaknesses to common offensive types in Flying, Ice, Fire, and Psychic, and its low Speed and attacking stats can make it somewhat passive, giving setup opportunities or free switches to a vast number of offensive Pokemon once it has used Spore.\n", "strategies' format": "OU", "strategies": [{"name": "Black Sludge", "stats": [326, 185, 190, 206, 271, 96], "type": ["Grass", "Poison"], "usage": "Amoonguss should be brought in safely against Pokemon that it can check, such as Ash-Greninja, Magearna, Tapu Bulu, and Clefable. From there, it should look to cripple the opposition. Thanks to Amoonguss's decent bulk and Regenerator, it can also pivot into Pokemon such as Choice Scarf Landorus-T and Kartana to scout what move they lock themselves into. However, you should be careful when using Amoonguss to check these Pokemon, as it lacks recovery and can't reliably take on Pokemon like Choice Band Kartana and Tapu Bulu because of this. Be mindful of when to use Spore because a fodder Pokemon could come in to take it for other Pokemon such as Mega Alakazam, Heatran, and Tornadus-T, which will actively be looking to take advantage of Amoonguss. If Pokemon such as Tornadus-T, Mega Alakazam, and Zapdos are predicted to switch in once another Pokemon has been put to sleep with Spore, Amoonguss should attempt to cripple them with Stun Spore, in Tornadus-T and Mega Alakzam's case, or poison them with Sludge Bomb. It's also important to actively utilize Regenerator with double switches out of Pokemon that it checks, as Amoonguss needs to be at a high range of HP to consistently check Pokemon, and this allows it to keep up the maximum amount of momentum, especially after using Spore.", "moves": [["Spore"], ["Giga Drain"], ["Hidden Power Fire"], ["Sludge Bomb", "Stun Spore"]], "item": [" Black Sludge"], "ability": ["Regenerator"], "nature": ["Calm"], "ev spread": [248, 0, 56, 0, 204, 0], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Assault Vest", "stats": [327, 206, 200, 206, 259, 86], "type": ["Grass", "Poison"], "usage": "As this set is used to swallow some special moves, try to avoid Amoonguss taking powerful physical moves because it may miss the amount of HP lost while dealing with hits it would otherwise take, even factoring Regenerator. Also, although Amoonguss can check Ash-Greninja and lure in Heatran very well, it's recommended to scout for moves that may disrupt this set, such as Ice Beam on Ash-Greninja and Inferno Overdrive on Heatran. Preserving HP by switching out after checking the desired Pokemon is highly recommended. Leaving Amoonguss at low HP or counting only on Giga Drain for longevity can leave it unable to take special hits anymore. Regenerator is what makes this set a good pivot, so use it wisely. Amoonguss can also be used to remove Toxic Spikes from your side of the field, but keep in mind that a burn from Toxapex's Scald, for example, can be critical, putting Amoonguss in range of some attacks or, if your opponent has a Heatran, Magnezone, or Magearna, leaving it unable to deal with them properly because of the Attack reduction. When facing foes such as Tapu Bulu and Tangrowth, do not hesitate to click Sludge Bomb, even if predicting a Steel-type to come in; Stomping Tantrum is here to be used in these situations.", "moves": [["Giga Drain"], ["Sludge Bomb"], ["Stomping Tantrum"], ["Hidden Power Fire"]], "item": [" Assault Vest"], "ability": ["Regenerator"], "nature": ["Sassy"], "ev spread": [252, 0, 96, 0, 160, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Flying-types", "Psychic-types", "Fire-types", "Ice-types", "Various Defensive Pokemon"], "credits": ["Written by Jordy and OldAmberPlays", "Earlier versions by false and Consignia", "Quality checked by Leo, Finchinator, ABR, Talah,  and lyd", "Grammar checked by Fireflame479, GMars,  and The Dutch Plumberjack"]}