{
    "name": "Arcanine",
    "forms": {
        "Base": {
            "base stats": [
                90,
                110,
                80,
                100,
                80,
                95
            ],
            "types": [
                "Fire"
            ],
            "abilities": [
                "Flash Fire",
                "Intimidate",
                "Justified"
            ],
            "tier": [
                "RU"
            ],
            "form": "Base"
        }
    },
    "overview": "Arcanine is unviable and difficult to justify using on any serious team. Although it has access to the ability Intimidate, active recovery in Morning Sun, and decent utility in Will-O-Wisp and Toxic, Arcanine struggles to function properly as a defensive wall. A weakness to every entry hazard causes Arcanine to be easily chipped away at and struggle to act as a defensive switch-in to the few Pokemon it can check such as Scizor, Mega Sharpedo lacking a Water-type STAB attack, and Choice Scarf Infernape. This issue is furthered by Arcanine's reliance on Morning Sun as its only source of recovery, as the move's low PP makes switching into entry hazards too often a huge risk because the accumulated damage forces Arcanine to burn through Morning Sun's PP. Arcanine is also outclassed by other defensive Fire-types like Moltres, which sports better overall stats, a more reliable source of recovery in Roost that has more PP than Morning Sun and lets it stave off Stealth Rock damage, and a better defensive typing in Fire / Flying, letting it better check Pokemon like Scizor, Cobalion, Mega Altaria, and Infernape. Rotom-H also outclasses Arcanine as a bulky Fire-type Pokemon thanks to the combination of hazard removal in Defog, immunity to Ground-type moves thanks to Levitate, and secondary Electric typing, allowing Rotom-H to threaten most bulky Water-types like Suicune and Alomomola with super effective damage. Arcanine's poor defensive typing also gives it a worse matchup against strong neutral physical attackers. For example, Cobalion can OHKO Arcanine with +1 All-Out Pummeling, and Heracross can KO Arcanine with +1 Close Combat with minor chip damage. This makes Arcanine unreliable as a dedicated physical wall. Additionally, while Arcanine does match up well against Scizor and some other prominent physical attackers, its mono-Fire typing means it is more easily threaten by the plethora of Water- and Ground-types in the tier like Primarina, Starmie, Krookodile, and Hippowdon. Moltres and Rotom-H struggle less against Water- and Ground-types because of their secondary typings and Ground immunity, allowing them to bypass a weakness to Ground-type moves and threaten Water-types with strong STAB moves. Lastly, Arcanine's passivity makes it setup fodder for Pokemon like Calm Mind Latias, Nasty Plot Togekiss, and Nasty Plot Infernape, giving it a poor matchup against more offensively based teams.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "Defensive",
            "stats": [
                278,
                230,
                282,
                236,
                196,
                230
            ],
            "type": [
                "Fire"
            ],
            "usage": "Due to Arcanine's weakness to entry hazards and the limited recovery provided by Morning Sun, it's essential not to switch into entry hazards frequently, as this will greatly reduce Arcanine's longevity. Because of the combination of Arcanine's typing and Intimidate, it can be switched directly into Pokemon like Scizor and Doublade to check them as well as gain valuable chip damage thanks to Rocky Helmet. Since Arcanine draws in bulky Ground- and Water-types like Hippowdon, Swampert, and Alomomola, using Toxic is generally free of drawbacks. Additionally, Pokemon like Kommo-o and Terrakion may try to use Arcanine as setup fodder because they aren't threatened by Flamethrower; therefore, using Will-O-Wisp to cripple them is ideal. If using Flare Blitz, only use it if absolutely necessary to threaten Pokemon like Cobalion, Amoonguss, and Klefki, as the recoil damage is rarely worth its meager damage output on neutral targets. Arcanine's passivity makes it setup bait for Pokemon like Latias, Suicune, and Mega Slowbro. Therefore, it's important to try badly poisoning them with Toxic as they switch in.",
            "moves": [
                [
                    "Flamethrower",
                    "Flare Blitz"
                ],
                [
                    "Will-O-Wisp"
                ],
                [
                    "Morning Sun"
                ],
                [
                    "Toxic"
                ]
            ],
            "item": [
                " Rocky Helmet"
            ],
            "ability": [
                "Intimidate"
            ],
            "nature": [
                "Bold",
                "Impish"
            ],
            "ev spread": [
                248,
                0,
                244,
                0,
                0,
                16
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Entry Hazards",
        "Water-types",
        "Ground-types",
        "Rock-types",
        "Dragon-types",
        "Strong Wallbreakers"
    ],
    "credits": [
        "Written by Rabia",
        "Quality checked by martha, A Cake Wearing A Hat,  and Nuked",
        "Grammar checked by The Dutch Plumberjack"
    ]
}