{
    "name": "Aromatisse",
    "forms": {
        "Base": {
            "base stats": [
                101,
                72,
                72,
                99,
                89,
                29
            ],
            "types": [
                "Fairy"
            ],
            "abilities": [
                "Aroma Veil",
                "Healer"
            ],
            "tier": [
                "PUBL"
            ],
            "form": "Base"
        }
    },
    "overview": "Due to its good offensive typing, access to Trick Room to mitigate its rather low Speed, and access to Nasty Plot to augment its already decent Special Attack, Aromatisse is capable of performing as an effective late-game sweeper that can pose a threat to offensive and defensive teams alike. Aromatisse's typing is solid defensively as well, allowing it to check Pokemon such as Assault Vest Hariyama, Sneasel, and Malamar. This, in combination with its good mixed bulk, gives it an easier time setting Trick Room. Decent coverage in Psychic also allows Aromatisse to deal with Poison-types that would otherwise put a damper on its attempts at sweeping. However, Aromatisse suffers from rather average overall stats, which often forces it to use both Trick Room and Nasty Plot in order to begin sweeping. While good defensively, its pure Fairy typing unfortunately burdens it with weaknesses to Poison- and Steel-type attacks, both of which are fairly common in NU. Aromatisse will often have to take a hit before setting Trick Room for itself, which can be problematic versus stronger attackers such as Mega Glalie, and its susceptibility to all forms of entry hazards making it easier to wear down only makes matters worse.\n",
    "strategies' format": "NU",
    "strategies": [
        {
            "name": "Offensive Trick Room",
            "stats": [
                300,
                149,
                180,
                326,
                216,
                56
            ],
            "type": [
                "Fairy"
            ],
            "usage": "Since Aromatisse excels as a late-game sweeper, it should wait until Pokemon it cannot break through such as Silvally-Steel have been either weakened enough or removed entirely to begin its sweep. While Aromatisse's bulk is good, it shouldn't be recklessly switched in on attacks when it doesn't have to, as this cuts into its longevity. Furthermore, being weakened limits Aromatisse's ability to find setup opportunities. Aromatisse should mainly set up on Pokemon that are Choice locked into Dark- or Fighting-type attacks such as Sneasel and Braviary, as well as on Dragon-types such as Druddigon. After setting up Trick Room, Aromatisse should aim to use Nasty Plot in order to increase its damage output and become more threatening. However, against frailer, offensive teams, this may not always be necessary. Exercise caution when it comes to using Aromatisse's Z-Move. It should mainly be used to KO Fairy-resistant foes that can take a +2 Moonblast or to break through very specially bulky Pokemon such as Type: Null.",
            "moves": [
                [
                    "Trick Room"
                ],
                [
                    "Nasty Plot"
                ],
                [
                    "Moonblast"
                ],
                [
                    "Psychic",
                    "Hidden Power Fire"
                ]
            ],
            "item": [
                " Fairium Z"
            ],
            "ability": [
                "Aroma Veil"
            ],
            "nature": [
                "Quiet"
            ],
            "ev spread": [
                248,
                0,
                0,
                252,
                8,
                0
            ],
            "iv spread": [
                31,
                0,
                31,
                31,
                31,
                0
            ]
        }
    ],
    "counters": [
        "Poison-types",
        "Steel-types",
        "Specially Defensive Pokemon",
        "Residual Damage"
    ],
    "credits": [
        "Written by allstarapology",
        "Earlier versions by Nuked",
        "Quality checked by quziel, Evan.,  and Blast",
        "Grammar checked by The Dutch Plumberjack and Fireflame479"
    ]
}