{
    "name": "Articuno",
    "forms": {
        "Base": {
            "base stats": [
                90,
                85,
                100,
                95,
                125,
                85
            ],
            "types": [
                "Ice",
                "Flying"
            ],
            "abilities": [
                "Pressure",
                "Snow Cloak"
            ],
            "tier": [
                "PU"
            ],
            "form": "Base"
        }
    },
    "overview": "Articuno's ability to compress roles as both a Defog and a Heal Bell user allows it to carve a niche on stall teams as a specially bulky support Pokemon, capable of removing entry hazards against Pokemon like Hippowdon, Empoleon, and Nidoking. Pressure is also one of Articuno's most useful traits, allowing it to stall out moves like Stealth Rock and Toxic, making it hard for the opponent to spread residual damage around the team, which any bulky build would appreciate. On top of this, Articuno is able to sponge hits from very strong special attackers like Hydreigon, Mega Blastoise, and Nidoking thanks to its incredibly high Special Defense stat and overall bulk. Articuno also possesses a decent Speed tier for a bulky Pokemon, which gives it the opportunity to outspeed Pokemon like Crawdaunt and non-Timid Primarina with the right EV investment. Despite this, Articuno's 4x weakness to Stealth Rock makes it hard for it to come into play all the time and perform its role, meaning it mandates a lot more team support than most other Pokemon. Its subpar defensive typing also holds it back, providing it with only two resistances and an immunity to Ground-type attacks, aggravating its difficulty to come into play and making it weak to common offensive threats like Scizor, Mega Aerodactyl, and Cobalion. Furthermore, Pokemon like Mega Aggron and Nihilego can easily set up Stealth Rock and prevent Articuno from coming in and using Defog as well. Although Articuno is able to compress roles by running both Defog and Heal Bell on its set, it still faces heavy competition as a Defogger from Pokemon like Moltres, which has a much better defensive typing and consequently a relatively easier time finding an opportunity to Defog. Its passive nature can also provide free turns for certain setup sweepers that are particularly threatening to defensive builds like Terrakion and Infernape.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "Specially Defensive",
            "stats": [
                278,
                185,
                237,
                226,
                358,
                230
            ],
            "type": [
                "Ice",
                "Flying"
            ],
            "usage": "In order to utilize Articuno effectively, it's advised to switch into entry hazard setters like Hippowdon and Seismitoad as often as possible to Defog their hazards away. Articuno will come out on top most of the time, as it can PP stall their moves with Pressure. However, Articuno shouldn't be switching in when Stealth Rock is already up, as it will take a lot of damage . Instead, it's best to use a different Pokemon like Gligar or Tentacruel to remove it first, if feasible. It's also encouraged to take advantage of Pressure and switch into moves like Stealth Rock, Toxic, and Defog as often as possible in order to stall out their PP and consequently make it harder for the opponent to continually damage the team. Roost should be used proactively, as keeping Articuno as healthy as possible is extremely important, in case it's forced to come into play while Stealth Rock is up. Due to its high Special Defense stat, Articuno can also be used to sponge special attacks from Pokemon like Primarina and Starmie if necessary. Be aware and scout for coverage moves such as Krookodile's Stone Edge that could be aimed at Articuno, as they could either OHKO it or leave it at a very low amount of HP. Watch out for Heal Bell's PP, since it can run out very quickly, and defensive teams heavily rely on cleric support in order to succeed.",
            "moves": [
                [
                    "Defog"
                ],
                [
                    "Heal Bell"
                ],
                [
                    "Freeze-Dry"
                ],
                [
                    "Roost"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Pressure"
            ],
            "nature": [
                "Calm"
            ],
            "ev spread": [
                248,
                0,
                4,
                0,
                160,
                96
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Stealth Rock",
        "Rock-types",
        "Steel-types",
        "Strong Physical Attackers",
        "Fire-types",
        "Electric-types"
    ],
    "credits": [
        "Written by Surgeon",
        "Quality checked by Hilomilo, martha,  and Nuked",
        "Grammar checked by lotiasite and The Dutch Plumberjack"
    ]
}