{"name": "Banette", "forms": {"Base": {"base stats": [64, 115, 65, 83, 63, 65], "types": ["Ghost"], "abilities": ["Cursed Body", "Frisk", "Insomnia"], "tier": ["Untiered"], "form": "Base"}, "Mega": {"base stats": [64, 165, 75, 93, 83, 75], "types": ["Ghost"], "abilities": ["Prankster"], "tier": ["RU"], "form": "Mega"}}, "overview": "Mega Banette relies on using Prankster Destiny Bond to put opponents into a double KO situation at best, and Banette massively benefits from gaining immediate access to Prankster the moment it Mega Evolves. Meanwhile, the fact that Destiny Bond cannot be used consecutively doesn't apply to Mega Banette; by alternating between Prankster Destiny Bond and an attack without increased priority, any faster foe without effective priority of their own is always subject to a KO by Destiny Bond, making Mega Banette an effective tool for halting setup sweepers. It also has tools to prevent opponents from attempting to stall out Destiny Bond's low PP, such as Taunt to force bulkier foes to attack and even Infestation to prevent switching. Being a Ghost-type to block Rapid Spin as well as having access to Prankster Taunt and Destiny Bond, Mega Banette is quite capable of preventing the opponent from clearing entry hazards off the field.\nHowever, while Mega Banette has a high Attack stat, its moves don't have terrific Base Power, and it lacks a boosting move to contend with fellow Ghost-types, such as Mismagius and Alolan Marowak, both of which have much better matchups against bulkier Pokemon. Mega Banette also has lackluster bulk, has few resistances, and lacks reliable recovery, meaning it usually only has a few chances at best to set up the Destiny Bond lock throughout the course of a match. Thus, Mega Banette overall can have a difficult time fitting onto teams despite its unique niches. As a Mega Pokemon, its playstyle is primarily reactive compared to other Mega Pokemon that are superior offensively or defensively.\n", "strategies' format": "RU", "strategies": [{"name": "Offensive", "stats": [174, 471, 186, 199, 202, 240], "type": ["Ghost"], "usage": "252 Attack EVs and an Adamant nature maximize Mega Banette's damage output, allowing its attacks to 3HKO most uninvested foes at worst. The Speed investment is more customizable, with 216 Speed EVs being just enough to underspeed Adamant Honchkrow to maintain the Destiny Bond lock on it. Alternatively, if you rely on Mega Banette to stop Bewear and Pangoro as well, you can run 112 Speed EVs to be able to underspeed them but retain enough Speed to outrun the likes of Milotic and fast Mantine. Because Banette wants to Mega Evolve right away, Frisk is the only ability of real use, as it can help scout for items such as Choice items or Z-Crystals, which may even help you discern the more important Destiny Bond target.", "moves": [["Destiny Bond"], ["Shadow Claw"], ["Gunk Shot"], ["Taunt", "Knock Off"]], "item": [" Banettite"], "ability": ["Frisk"], "nature": ["Adamant"], "ev spread": [40, 252, 0, 0, 0, 216], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Umbreon and Mandibuzz", "Status Ailments", "Slower Tanks", "Sacrificing the Least Valuable Pokemon"], "credits": ["Written by Punchshroom", "Quality checked by Phantom, Avocado,  and eren", "Grammar checked by Fireflame479 and The Dutch Plumberjack"]}