{"name": "Barbaracle", "forms": {"Base": {"base stats": [72, 105, 115, 54, 86, 68], "types": ["Rock", "Water"], "abilities": ["Pickpocket", "Sniper", "Tough Claws"], "tier": ["NUBL"], "form": "Base"}}, "overview": "Barbaracle has carved itself a niche in the UnderUsed metagame as a potent Shell Smash sweeper due to its access to Liquidation and ability to viably run Rockium Z. Most teams are easily swept due to lack of preparation for Barbaracle, as they usually only have a couple decent checks for it and are more often than not unable to prevent it from gaining a good setup opportunity thanks to its great Defense and strong offensive typing. Barbaracle is also one of the tier's better stallbreakers, thanks to its ability to be a boosting Pokemon that can break past most of stall's typical answers like Quagsire. However, while Barbaracle is generally effective against most playstyles, it tends to struggle against most matchups where the opponent has one or two strong checks to Barbaracle and thus can dissuade it from ever setting up a Shell Smash. Furthermore, Barbaracle is a one-trick pony and requires its teammates to cater to it in order to function successfully in the tier. This reliance on being built around as well as its reliance on Shell Smash in order to become a potent threat make Barbaracle a rather mediocre option when compared to other setup sweepers with more overall utility like Azumarill and Scizor.\n", "strategies' format": "UU", "strategies": [{"name": "Shell Smash", "stats": [180, 309, 266, 145, 187, 258], "type": ["Rock", "Water"], "usage": "The first thing to be done when starting a match with Barbaracle is seeing what Barbaracle checks are present and if Barbaracle has any opportunities to set up. If Barbaracle's checks are many and are unable to be removed without at the same time still ensuring Barbaracle is able to set up, Barbaracle can be used as a sacrificial lamb in order to break past certain Pokemon through the use of Continental Crush for its teammates to clean afterwards. Barbaracle should only be sent in whenever an opportunity to set up and sweep is available. When a sweeping opportunity is taken and Barbaracle has already used Shell Smash, it is important to evaluate the use of Continental Crush, as sometimes it may be better to save it for targets that require the extra damage in order to be KOed, such as Suicune and Alomomola. If up against stall teams, typically one would attempt to use Barbaracle to either completely sweep through once anything bulky enough to take a hit, such as Mega Aggron, is weakened to a point whereby Barbaracle can KO it or try to weaken as many Pokemon as possible in order to clean up with another teammate.", "moves": [["Shell Smash"], ["Stone Edge"], ["Liquidation"], ["Grass Knot", "Earthquake"]], "item": [" Rockium Z"], "ability": ["Tough Claws"], "nature": ["Naive", "Jolly"], "ev spread": [0, 252, 0, 4, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Revenge Killers", "Status", "Offensive Pressure"], "credits": ["Written by Kreme", "Quality checked by Bouff, Nuked,  and Eyan", "Grammar checked by The Dutch Plumberjack and A Cake Wearing A Hat"]}