{"name": "Bronzor", "forms": {"Base": {"base stats": [57, 24, 86, 24, 86, 23], "types": ["Steel", "Psychic"], "abilities": ["Heatproof", "Heavy Metal", "Levitate"], "tier": ["LC"], "form": "Base"}}, "overview": "Bronzor is an incredibly passive Pokemon that must rely on the combination of Psywave and Toxic to chip down opposing Pokemon. This often leaves it as potential setup fodder for Pokemon like RestTalk Spiritomb that don't mind Toxic; additionally, when asleep, Bronzor can be exploited by Pokemon like Nasty Plot Alolan Raichu and Shell Smash Omastar. Its passivity generally leaves Bronzor outclassed by less passive Stealth Rock setters like Mesprit, Aggron, and Mudsdale. Bronzor is incapable of threatening Skuntank, one of the most common Defoggers in PU, making it difficult to keep Stealth Rock up against Black Sludge and Pursuit Skuntank. Bronzor relies heavily on its Eviolite to serve as an effective defensive switch-in, meaning if it loses its Eviolite to Knock Off from Gurdurr or Trick from Mesprit, Bronzor struggles to keep up defensively. Furthermore, because it must hold an Eviolite to actually check what it wants to, Bronzor cannot hold an item such as Leftovers or a pinch Berry to provide it with passive recovery and must rely on the unreliable Rest. For these reasons, Bronzor is at best a niche defensive Pokemon with many useful resistances and immunities, letting it serve as a stop to many threatening wallbreakers and setup sweepers in the tier such as Aggron, Aurorus, Lilligant, and Lycanroc as well as set Stealth Rock against other Stealth Rock setters.\n", "strategies' format": "PU", "strategies": [{"name": "Defensive", "stats": [213, 75, 268, 84, 236, 82], "type": ["Steel", "Psychic"], "usage": "Bronzor can gain good opportunities to set up Stealth Rock by switching into Pokemon it checks like Aurorus and setting Stealth Rock as they switch out. Additionally, Bronzor can use this opportunity to throw off a Toxic or Psywave to prevent a setup sweeper or Taunt user like Omastar, non-Lum Berry Pinsir, or Jellicent from freely switching in. Playing around Skuntank is a key to getting any success out of Bronzor, as Skuntank can easily switch into Bronzor and clear Stealth Rock with no fear of Toxic and Psywave and potentially threaten to Pursuit trap Bronzor. If the opponent has a Skuntank, it's best to just double switch out to a Skuntank check. Although Bronzor is capable of checking Pokemon such as Lilligant and Alolan Sandslash, scouting these Pokemon for super effective coverage options is crucial to keep Bronzor healthy enough to check Pokemon such as Togedemaru, Lurantis, and Choice Scarf Primeape. Be careful of switching Bronzor into Pokemon that can carry Trick or Knock Off like Mesprit, Rotom-F, and Gurdurr, as Bronzor needs its Eviolite to check prominent Rock- and Normal-type wallbreakers like Aggron and Stoutland. While Rest is great for clearing status like burn and paralysis from Bronzor as well as healing it back to full, it comes with the drawback of putting Bronzor asleep. Because of this, don't rely heavily on Rest as the main means of restoring Bronzor's health, as an asleep Bronzor can be easily exploited by setup sweepers like Gurdurr and Dodrio.", "moves": [["Stealth Rock"], ["Psywave"], ["Toxic"], ["Rest"]], "item": [" Eviolite"], "ability": ["Levitate"], "nature": ["Bold"], "ev spread": [252, 0, 144, 0, 112, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Dark-types", "Loss of Eviolite", "Ghost-types", "Setup Sweepers"], "credits": ["Written by Rabia", "Quality checked by Megazard, yogi,  and tondas", "Grammar checked by The Dutch Plumberjack and frostration"]}