{"name": "Budew", "forms": {"Base": {"base stats": [40, 30, 35, 50, 70, 55], "types": ["Grass", "Poison"], "abilities": ["Leaf Guard", "Natural Cure", "Poison Point"], "tier": ["LC"], "form": "Base"}}, "overview": "Budew is the only Pokemon in LC with access to both Spikes and Sleep Powder, making it an excellent lead. Furthermore, Budew's decent defensive typing, usable bulk, and good ability in Natural Cure allow it to beat common Rapid Spin users such as Staryu and Kabuto as well as check common threats such as Mienfoo and Chinchou. However, Budew's low offensive stats make it relatively passive against Pokemon it can't hit for super effective damage, which can leave it as setup bait for common threats such as Vullaby. Furthermore, Budew suffers from slight four-moveslot syndrome, meaning it struggles to do everything it wants to do. Finally, Budew is usually outclassed by Ferroseed as a Grass-type Spikes user because of the latter's superior bulk and typing.\n", "strategies' format": "LC", "strategies": [{"name": "Entry Hazard Setter", "stats": [125, 86, 181, 146, 225, 146], "type": ["Grass", "Poison"], "usage": "Budew works best as a lead, as it has a good matchup against common leads such as Mienfoo and Onix. Set Spikes up as early as possible so they can weaken opposing Pokemon right from the get-go. Switch Budew into Rapid Spin users such as Staryu and Kabuto, as it is able to avoid being 2HKOed from the most common users of the move and 2HKO them in return with a super effective STAB Giga Drain and set up Spikes again. Use Natural Cure to absorb status from the likes of Pumpkaboo-XL and Snubbull. Finally, use Sleep Powder to cripple threats that Budew can't otherwise beat such as Timburr.", "moves": [["Spikes"], ["Sleep Powder", "Sludge Bomb"], ["Synthesis", "Giga Drain"], ["Giga Drain", "Sludge Bomb", "Hidden Power Fire"]], "item": [" Eviolite"], "ability": ["Natural Cure"], "nature": ["Bold"], "ev spread": [36, 0, 236, 40, 196, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Flying-types", "Fire-types", "Strong Attackers", "Steel-types", "Setup Sweepers"], "credits": ["Written by tahu", "Quality checked by Hilomilo, Xayah,  and Berks", "Grammar checked by Fireflame479 and CryoGyro"]}