{
    "name": "Buneary",
    "forms": {
        "Base": {
            "base stats": [
                55,
                66,
                44,
                44,
                56,
                85
            ],
            "types": [
                "Normal"
            ],
            "abilities": [
                "Klutz",
                "Limber",
                "Run Away"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Despite its stiff competition as an offensive Normal-type from Zigzagoon and Bunnelby, Buneary carves itself a unique niche in the LC metagame in its access to Healing Wish and Z-Splash. When using Splash with a Normalium-Z, Buneary is able to gain a +3 boost in its Attack and make great use of its ability to hit 19 Speed to sweep. Furthermore, Buneary has ideal coverage options in Drain Punch, Jump Kick, and the elemental punches to complement its powerful STAB Return, as well as having two unique abilities in Limber and Klutz and an expansive utility movepool consisting of gems in Healing Wish, Thunder Wave, and Heal Bell, providing it with quite a bit of versatility. Unfortunately, Buneary is unable to hold an Eviolite when attempting to sweep and is thus extremely frail and susceptible to priority, especially considering its lack of resistances and weakness to the ever-present Fighting-types like Mienfoo and Timburr. Furthermore, Buneary faces stiff competition from Zigzagoon due to the latter's access to Extreme Speed, is walled by Ghost-type Pokemon if it's running Quick Attack due to its lack of a move to hit them super effectively, and struggles to find setup opportunities due to its frailty. As a result, Buneary requires a lot of support to effectively sweep or support its team. Nevertheless, Buneary packs quite the punch as a Pokemon capable of either supporting its team with Healing Wish or sweeping late-game and definitely deserves consideration as your team's offensive Normal-type.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Offensive Utility",
            "stats": [
                146,
                225,
                125,
                111,
                148,
                291
            ],
            "type": [
                "Normal"
            ],
            "usage": "Healing Wish is best used once Buneary's been weakened, as its Speed tier usually allows it to quickly use the move before losing to the foe and heal one of its teammates. When Buneary is healthy, it is best to either attack or use Thunder Wave so it doesn't waste all of its HP just to heal a teammate. If Buneary is running Thunder Wave, it should be used when predicting a switch to a Ghost-type or a Pokemon that doesn't take much from either Return or Buneary's coverage, as this will cripple the switch-in and allow Buneary to switch out into a teammate that beats the foe. Switcheroo should only be used against a defensive Pokemon or special attacker or when predicting a switch to one of these, as neither will benefit from being locked into a move whereas physical attackers will be able to take advantage of the power boost. If Buneary is against a faster threat, such as Elekid, as well as Focus Sash Diglett, but will be able to survive their attack, it should use Healing Wish to grant one teammate full recovery and guarantee that it isn't wasting the moveslot.",
            "moves": [
                [
                    "Healing Wish"
                ],
                [
                    "Return"
                ],
                [
                    "Drain Punch",
                    "Jump Kick",
                    "Fire Punch"
                ],
                [
                    "Thunder Wave",
                    "Switcheroo",
                    "Quick Attack"
                ]
            ],
            "item": [
                " Eviolite",
                " Choice Band"
            ],
            "ability": [
                "Limber"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                228,
                4,
                0,
                0,
                236
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Z-Splash",
            "stats": [
                146,
                225,
                125,
                111,
                148,
                291
            ],
            "type": [
                "Normal"
            ],
            "usage": "This set is best used as a late-game cleaner, as it is very capable of picking off weakened threats and sweeping the remains of an opponent's team after setting up. However, due to its frailty, Buneary shouldn't be switching into any attacks unless they're Ghost-type, which is why it is best brought in after one of its teammates has fainted or via slow pivot support from bulky Vullaby or Mienfoo. If Buneary is in danger of fainting but hasn't yet used Z-Splash, it can opt to use Breakneck Blitz instead to deliver one final blow to its foe and either KO them or weaken them for one of Buneary's teammates. Buneary's susceptibility to strong priority attacks often means that Pokemon like Timburr and Croagunk should be removed before Buneary attempts its sweep, while its vulnerability to all forms of status bar paralysis means that it should always be aware of these things on the opponent's team. Burns will halve its Attack stat and make it harder to break bulkier threats, and sleep will completely immobilize Buneary and halt its sweep. Common phazers in Hippopotas and Mareanie are also best removed before Buneary attempts to sweep, as Buneary can only set up once and will be rather useless if its stat boosts have been removed. Lastly, setting up with Z-Splash can be a monumental task due to Buneary's frailty. Common defensive Pokemon in Ferroseed and Munchlax make for good Pokemon to set up on as a result of this.",
            "moves": [
                [
                    "Splash"
                ],
                [
                    "Return"
                ],
                [
                    "Drain Punch"
                ],
                [
                    "Fire Punch",
                    "Quick Attack"
                ]
            ],
            "item": [
                " Normalium Z"
            ],
            "ability": [
                "Limber"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                228,
                4,
                0,
                0,
                236
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fighting-types",
        "Revenge Killers",
        "Priority",
        "Ghost-types",
        "Status"
    ],
    "credits": [
        "Written by Hilomilo",
        "Quality checked by Nineage, Corporal Levi,  and Fiend",
        "Grammar checked by Kris and The Dutch Plumberjack"
    ]
}