{"name": "Buzzwole", "forms": {"Base": {"base stats": [107, 139, 139, 53, 53, 79], "types": ["Bug", "Fighting"], "abilities": ["Beast Boost"], "tier": ["UUBL"], "form": "Base"}}, "overview": "Buzzwole's great physical bulk in conjunction with its rare defensive typing allows it to function as a blanket check on stall teams to many of the metagame's most dangerous physical attackers such as Kartana, Garchomp, and Tapu Bulu. Having a Bulk Up-boosted Buzzwole can be a win condition for stall teams, potentially sweeping bulky offensive teams in the late-game after they've been whittled down by Buzzwole's team. Buzzwole's movepool gives it access to a wide variety of coverage options such as Ice Punch for Gliscor and Landorus-T, allowing it to effectively utilize its high Attack stat. On the other hand, Buzzwole's mediocre special bulk leaves it susceptible to being KOed by strong special attacks such as Tapu Koko's Thunderbolt and Greninja's Hydro Pump after prior damage. Buzzwole's defensive typing also leaves it easily preyed upon by common attacking types in Flying, Fairy, and Psychic, and Buzzwole is easy to KO due to its poor Speed tier, so Pokemon like Mega Pinsir, Tapu Lele, and Clefable all force Buzzwole out with ease.\n", "strategies' format": "OU", "strategies": [{"name": "Bulk Up", "stats": [313, 314, 385, 127, 142, 222], "type": ["Bug", "Fighting"], "usage": "Buzzwole should be switched primarily into physical attackers that it checks such as Kartana and Tapu Bulu. Avoid letting Buzzwole absorb status such as burn or poison, as status conditions limit its ability to effectively beat the aforementioned threats. Keep entry hazards off your side of the field so that Buzzwole can reliably beat Pokemon such as Corkscrew Crash Kartana. Additionally, analyze the opposing team and scout for lures such as Supersonic Skystrike Landorus-T if Buzzwole is meant to check multiple Pokemon so it can avoid being KOed in the early-game. When utilizing Buzzwole as part of the team's win condition, wait for the opposing team to be worn down before setting up and attempting to win the battle.", "moves": [["Drain Punch"], ["Ice Punch"], ["Bulk Up"], ["Roost"]], "item": [" Leftovers"], "ability": ["Beast Boost"], "nature": ["Impish"], "ev spread": [252, 0, 144, 0, 0, 112], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fairy-types", "Psychic-types", "Flying-types", "Residual Damage"], "credits": ["Written by LL", "Quality checked by Lyd, Leo,  and Jordy", "Grammar checked by martha and P Squared"]}