{"name": "Cacturne", "forms": {"Base": {"base stats": [70, 115, 60, 115, 60, 55], "types": ["Grass", "Dark"], "abilities": ["Sand Veil", "Water Absorb"], "tier": ["Untiered"], "form": "Base"}}, "overview": "Cacturne finds its niche in the PU metagame as a strong offensive Spikes setter. High base offensive stats allow Cacturne to wallbreak, and Water Absorb and Cacturne's ability to use Spikes are the main features that set it apart from Shiftry, which would mostly outclass it otherwise. Water Absorb notably allows Cacturne to come in on passive Water-type Pokemon such as Gastrodon and Lanturn without fearing Scald burns. Also, Cacturne's offensive typing allows it to threaten a lot of opposing Stealth Rock setters such as Regirock, Mesprit, and Bronzor. However, its subpar defensive stats make Cacturne very vulnerable to any type of super effective hit or any strong attack in general. Cacturne also has an awful base 55 Speed tier, meaning it is outsped by a lot of offensive Pokemon like Aurorus and Abomasnow; this also means it is very reliant on Sucker Punch to hit faster threats. Its inability to hit Skuntank for a lot of damage can also hinder its ability to effectively wallbreak and set up Spikes.\n", "strategies' format": "PU", "strategies": [{"name": "Offensive Spikes", "stats": [176, 267, 140, 361, 156, 209], "type": ["Grass", "Dark"], "usage": "Cacturne should be used for firing off powerful attacks against teams without reliable switch-ins or to break down opposing specially defensive Pokemon such as Assault Vest Hitmonchan. Cacturne should set up Spikes against teams that have reliable switch-ins to it such as Throh and Type: Null because the Spikes can pressure them the next time they switch in. Spikes are also useful for putting faster threats like Lilligant and Pyroar into KO range of Sucker Punch. Bringing Cacturne in on predicted Water-type moves from defensive Water-types like Carracosta and Gastrodon gives Cacturne a free switch due to its ability, Water Absorb. Double switching can also allow Cacturne to come in for free so it can avoid taking unnecessary damage. Use Dark Pulse if the opponent has good Grass-type switch-ins such as Sap Sipper Drampa and Abomasnow. On the other hand, use Energy Ball in situations where the opponent has good Dark-resistant Pokemon like Assault Vest Hitmonchan and Gurdurr.", "moves": [["Spikes"], ["Dark Pulse"], ["Sucker Punch"], ["Energy Ball", "Giga Drain"]], "item": [" Life Orb"], "ability": ["Water Absorb"], "nature": ["Mild"], "ev spread": [0, 4, 0, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fighting-types", "Fairy-types", "Specially Defensive Walls", "Skuntank", "Faster Attackers"], "credits": ["Written by Taskr", "Quality checked by yogi, Megazard,  and Many", "Grammar checked by martha and The Dutch Plumberjack"]}