{"name": "Carbink", "forms": {"Base": {"base stats": [50, 50, 150, 50, 150, 50], "types": ["Rock", "Fairy"], "abilities": ["Clear Body", "Sturdy"], "tier": ["Untiered"], "form": "Base"}}, "overview": "Carbink is one of the best Trick Room setters in the tier thanks to its access to Sturdy, which give it great odds at setting Trick Room successfully. It is also one of PU's premier special walls thanks to its amazing defensive typing and stats, which allow it to check threatening offensive Pokemon such as Drampa, Oricorio-G, and Pyroar. Furthermore, these traits almost guarantee that Carbink will set up Stealth Rock in a match. On the downside, Carbink's abysmal Speed leaves it as an open target for Taunt users like Weezing. Despite Carbink's amazing defenses, its low HP stat, along with its weakness to common attacking types like Water, Ground, and Grass means that it struggles to take hits from powerful attackers such as Kingler and Alolan Exeggutor, which both 2HKO Carbink with ease, and while Steel-type coverage moves may not be as common, Steel-types like Alolan Dugtrio and Aggron can easily exploit Carbink's 4x weakness. Unfortunately, Carbink faces competition from other bulky Stealth Rock users such as Regirock and Carracosta, which have a combination of better offensive presence, better stats, and better support movepools. Despite these weaknesses, Carbink still holds a niche as one of the best Trick Room setters, and its ability to switch into Drampa is unrivaled.\n", "strategies' format": "PU", "strategies": [{"name": "Trick Room Lead", "stats": [199, 137, 438, 136, 336, 94], "type": ["Rock", "Fairy"], "usage": "Carbink functions best as a suicide lead on Trick Room teams. Since the opponent will usually lead with a check to Carbink, it should always set up Trick Room before using Stealth Rock. Carbink should then use Explosion to preserve Trick Room turns and get a teammate like Marowak in for free. However, if you play against a Pokemon with access to Encore such as Liepard, Carbink should set up Trick Room and hard switch so it doesn't waste a turn of Trick Room. Carbink should also use Magic Coat to reflect incoming entry hazards like Regirock's Stealth Rock and status moves that would prevent Carbink from setting up Trick Room or Stealth Rock successfully like Weezing's Taunt.", "moves": [["Trick Room"], ["Stealth Rock"], ["Explosion"], ["Magic Coat"]], "item": [" Mental Herb"], "ability": ["Sturdy"], "nature": ["Relaxed"], "ev spread": [252, 4, 252, 0, 0, 0], "iv spread": [31, 31, 31, 31, 31, 0]}, {"name": "Stealth Rock", "stats": [199, 122, 337, 136, 438, 136], "type": ["Rock", "Fairy"], "usage": "Carbink should set up Stealth Rock and blanket check powerful special attackers throughout the match, using Toxic against setup sweepers in order to cut their sweep short. If Stealth Rock has already been set, Carbink can use the switches it forces by virtue of its typing and defenses to whittle down its foes with Toxic or its STAB moves. Carbink should mostly be used to counter special attackers such as Drampa, Musharna, and Mesprit, but Carbink can also check physical attackers such as Kangaskhan and Zangoose because of its high Defense and resistances. Carbink should be wary of Taunt users, as it's slow, and Taunt prevents it from using Toxic and Stealth Rock. Lastly, when Carbink is low on health make sure to use Rest so it can consistently check special attackers like Drampa and Pyroar. Carbink should use Protect to scout Choice-locked Pokemon like Primeape and wear down checks in tandem with Toxic.", "moves": [["Stealth Rock"], ["Moonblast", "Rock Slide"], ["Toxic"], ["Rest", "Protect"]], "item": [" Leftovers"], "ability": ["Sturdy"], "nature": ["Calm", "Sassy"], "ev spread": [252, 0, 4, 0, 252, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Taunt and Encore", "Ground-types", "Steel-types", "Water-types"], "credits": ["Written by TJ", "Quality checked by Megazard, yogi,  and 2xTheTap", "Grammar checked by Fireflame479 and The Dutch Plumberjack"]}