{
    "name": "Celesteela",
    "forms": {
        "Base": {
            "base stats": [
                97,
                101,
                103,
                107,
                101,
                61
            ],
            "types": [
                "Steel",
                "Flying"
            ],
            "abilities": [
                "Beast Boost"
            ],
            "tier": [
                "OU"
            ],
            "form": "Base"
        }
    },
    "overview": "Celesteela is a solid defensive Pokemon in the tier, with a fantastic typing, well-rounded stats, and a large movepool. Steel / Flying typing along with massive bulk allows Celesteela to check many threats in the tier such as Tapu Lele, Mega Diancie, Mega Alakazam, Mega Latios, Garchomp, Tapu Bulu, and Landorus-T. Even though Celesteela lacks reliable recovery, access to Leech Seed allows it to sustain itself against non-Grass-types. Celesteela struggles with the high usage of Zapdos, which shuts down all sets and PP stalls Leech Seed easily. On top of this, many Pokemon Celesteela is supposed to beat are constantly adapting to its presence and running Z-Moves in order to remove it or drastically weaken it, with examples being Fightinium Z on Tapu Lele.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Defensive",
            "stats": [
                292,
                238,
                249,
                250,
                325,
                142
            ],
            "type": [
                "Steel",
                "Flying"
            ],
            "usage": "Celesteela should be sent out against Pokemon it can easily wall like Tapu Lele, Mega Pinsir, most variants of Protean Greninja, Landorus-T, and most Garchomp sets. Be wary of moves that can easily break down Celesteela or lure it such as Rockium Z Landorus-T. While Protect can be used to scout these, be careful your opponent doesn't take advantage of this by setting up further or preserving their Z-Move. Avoid letting Celesteela get too weak because a healthy Celesteela is one of the most annoying things to face in the entire tier. This includes avoiding Knock Off and using Leech Seed with Protect whenever necessary.",
            "moves": [
                [
                    "Leech Seed"
                ],
                [
                    "Protect"
                ],
                [
                    "Heavy Slam"
                ],
                [
                    "Flamethrower"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Beast Boost"
            ],
            "nature": [
                "Sassy"
            ],
            "ev spread": [
                248,
                0,
                28,
                0,
                232,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Zapdos",
        "Fire-types",
        "Other Electric-types",
        "Various Offensive Lures"
    ],
    "credits": [
        "Written by p2",
        "Quality checked by Colonel M, Hootie,  and Gary",
        "Grammar checked by The Dutch Plumberjack and CryoGyro"
    ]
}