{
    "name": "Charizard",
    "forms": {
        "Base": {
            "base stats": [
                78,
                84,
                78,
                109,
                85,
                100
            ],
            "types": [
                "Fire",
                "Flying"
            ],
            "abilities": [
                "Blaze",
                "Solar Power"
            ],
            "tier": [
                "PUBL"
            ],
            "form": "Base"
        },
        "Mega-X": {
            "base stats": [
                78,
                130,
                111,
                130,
                85,
                100
            ],
            "types": [
                "Fire",
                "Dragon"
            ],
            "abilities": [
                "Tough Claws"
            ],
            "tier": [
                "OU"
            ],
            "form": "Mega-X"
        },
        "Mega-Y": {
            "base stats": [
                78,
                104,
                78,
                159,
                115,
                100
            ],
            "types": [
                "Fire",
                "Flying"
            ],
            "abilities": [
                "Drought"
            ],
            "tier": [
                "OU"
            ],
            "form": "Mega-Y"
        }
    },
    "overview": "Mega Charizard X\nMega Charizard X is an extremely strong wallbreaker and setup sweeper that can offensively pressure key Steel- and Grass-types such as Magearna, Ferrothorn, and Tangrowth. Its great offensive typing after Mega Evolving and strong STAB options boosted by Tough Claws allow it to break past most of the metagame with near-unresisted STAB and coverage options. Mega Charizard X's good Speed tier enables it to outpace fast foes such as Tapu Lele, Kyurem-B, and Gliscor, giving it the edge over other slower wallbreakers. Access to Dragon Dance makes Mega Charizard X extremely threatening after a boost, outspeeding even some Choice Scarf users like Landorus-T. However, it is extremely susceptible to entry hazards; before Charizard Mega Evolves, it is 4x weak to Stealth Rock and struggles to effectively switch in, and after Mega Evolving it becomes vulnerable to all forms of entry hazards. Furthermore, it is also chipped down by residual damage like Rocky Helmet from Tornadus-T and Iron Barbs from Ferrothorn as well as taking substantial Flare Blitz recoil to deal with these foes, which limits its ability to break these Pokemon without being worn down into range of faster attackers or priority itself.\nMega Charizard Y\nMega Charizard Y is able to use Drought and its high Special Attack stat to become a fierce wallbreaker. Access to Solar Beam allows it to muscle through bulky Water-types such as Gastrodon, and Alomomola, while Focus Blast hits Heatran and Tyranitar for a ton of damage. Unfortunately, Mega Charizard Y has no way of breaking through Toxapex, one of the most commonly used Pokemon on balance, as well as Chansey. Its massive Stealth Rock weakness limits its opportunities to switch in, and its average Speed stat leaves it prone to being revenge killed by common offensive Pokemon such as Garchomp, Tapu Koko, and Mega Diancie.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Dragon Dance X",
            "stats": [
                192,
                267,
                192,
                228,
                207,
                328
            ],
            "type": [
                "Fire",
                "Flying"
            ],
            "usage": "Mega Charizard X should avoid switching in directly on neutral attacks, especially when Stealth Rock is up. It is optimal to bring it in either on weaker moves, through pivot support, or after a teammate has fainted. Mega Evolving as soon as possible is optimal to grant Mega Charizard X a new resistance to Electric as well as a neutrality to Water. This also removes Charizard's 4x weakness to Stealth Rock; however, it becomes susceptible to Spikes and Toxic Spikes as a result. However, if Charizard has the opportunity to set up on Landorus-T lacking Stone Edge, it can hold off on Mega Evolving to avoid Ground-type attacks. Despite its ability to check a variety of Grass-types, Mega Charizard X's 4x weakness to Stealth Rock prior to Mega Evolving and vulnerability to all forms of entry hazards after mean it cannot consistently pivot into them. It can, however, use weak Grass-type attacks such as Tangrowth's Giga Drain as an opportunity to switch in and gain setup turns. It is best to use Mega Charizard X and set up mid- or late-game after its checks in bulky Water-types such as Tapu Fini and Gastrodon have been weakened or eliminated. Priority users such as Ash-Greninja and Mega Mawile should also be removed if Mega Charizard X is not able to heal itself with Roost, as these Pokemon can revenge kill it after some chip damage. Mega Charizard X should be cautious of using its STAB moves; Flare Blitz forces it to take heavy recoil damage, which can be used to weaken Mega Charizard X into range of priority, so when it KOes a Fire-weak foe, it should be wary of its HP. Outrage, on the other hand, locks Mega Charizard X in, meaning that if it KOes a foe, a powerful Fairy-type such as Mega Mawile, Magearna, or Tapu Lele can be brought in for free to KO it. While Mega Charizard X is an effective sweeper late-game, it can also wallbreak earlier in the match to soften its own checks like Toxapex and Tapu Fini. Mega Charizard X should proactively use Roost when its HP is getting low; it can take advantage of free turns where it forces opposing Pokemon out in order to switch to a counter to regain its HP. Toxic poison and paralysis heavily cripple Mega Charizard X, so it should avoid directly switching into foes such as Toxapex, Heatran, and Clefable. Mega Charizard X is also heavily reliant on its Attack stat to break through and sweep teams, so it struggles against Intimidate from Landorus-T and struggles to find setup opportunities when it pivots in; make sure it is weakened before setting up so it cannot pivot around Mega Charizard X and weaken its offensive presence.",
            "moves": [
                [
                    "Dragon Dance"
                ],
                [
                    "Flare Blitz"
                ],
                [
                    "Earthquake",
                    "Dragon Claw"
                ],
                [
                    "Roost"
                ]
            ],
            "item": [
                " Charizardite X"
            ],
            "ability": [
                "Blaze"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                0,
                0,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "3 Attacks",
            "stats": [
                192,
                267,
                192,
                228,
                207,
                328
            ],
            "type": [
                "Fire",
                "Flying"
            ],
            "usage": "Mega Charizard X can act as a powerful wallbreaker early- or mid-game able to weaken several key metagame staples such as Toxapex, Ferrothorn, Magearna, and Tangrowth. Safely bringing Mega Charizard X in on a free turn either from pivot support or after a teammate has fainted is optimal; however, it can be brought in on weak resisted attacks such as Tapu Bulu's Horn Leech to give it free turns to Mega Evolve. Mega Evolving early-game is preferred to mitigate Mega Charizard X's 4x Stealth Rock weakness; however, it does become susceptible to every other form of entry hazard while preserving a Stealth Rock weakness. If entry hazards aren't present and after Charizard has Mega Evolved, it can switch into Pokemon it checks more proactively. Mega Charizard X's STAB moves are easy to punish, so it should be cautious when using them, as Flare Blitz's recoil can be used to weaken Mega Charizard X into range of priority. When it KOes a Pokemon weak to Fire such as Tangrowth or Ferrothorn, it should be wary of its HP. Outrage traps Mega Charizard X, so if it KOes a foe, a Fairy-type such as Tapu Lele or Mega Mawile can come in for free and KO Mega Charizard X. Thus, it should only use the move if Fairy-types are all eliminated or it is required for it to KO a threat to itself and its teammates. Mega Charizard X should actively predict foes to switch in; if a Fire-resistant or -immune foe such as Toxapex or Heatran is predicted to switch in, using Outrage or Earthquake can severely weaken or KO one is Mega Charizard X's checks.",
            "moves": [
                [
                    "Flare Blitz"
                ],
                [
                    "Outrage"
                ],
                [
                    "Earthquake"
                ],
                [
                    "Roost"
                ]
            ],
            "item": [
                " Charizardite X"
            ],
            "ability": [
                "Blaze"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                0,
                0,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Drought Wallbreaker Y",
            "stats": [
                192,
                183,
                193,
                317,
                206,
                328
            ],
            "type": [
                "Fire",
                "Flying"
            ],
            "usage": "Use Charizard to wallbreak early-game. By softening opposing walls, Charizard will give its teammates more opportunities to sweep late-game. Very few Pokemon are able to safely switch into Mega Charizard Y. Make efforts to safely bring Charizard in against Pokemon it can force out or otherwise KO to put pressure on the opposing team. If possible, remove Stealth Rock or prevent it from being set up before bringing in Charizard to avoid having it lose half of its health.",
            "moves": [
                [
                    "Flamethrower",
                    "Fire Blast"
                ],
                [
                    "Focus Blast"
                ],
                [
                    "Solar Beam",
                    "Defog"
                ],
                [
                    "Roost"
                ]
            ],
            "item": [
                " Charizardite Y"
            ],
            "ability": [
                "Blaze"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                4,
                252,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Rock-types and Stealth Rock",
        "Bulky Water-types",
        "Residual Damage",
        "Ground-types",
        "Stealth Rock",
        "Toxapex",
        "Chansey",
        "Dragon-types",
        "Revenge Killers"
    ],
    "credits": [
        "Written by GMars and martha",
        "Earlier versions by Jukain and King Sceptile",
        "Quality checked by Colonel M, Finchinator, Subject 18, Leo, Jordy,  and Simia",
        "Grammar checked by P Squared, The Dutch Plumberjack,  and frostration"
    ]
}