{
    "name": "Chespin",
    "forms": {
        "Base": {
            "base stats": [
                56,
                61,
                65,
                48,
                45,
                38
            ],
            "types": [
                "Grass"
            ],
            "abilities": [
                "Bulletproof",
                "Overgrow"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Chespin is a pretty weak Pokemon overall, but it has a few niches that allow it to remain usable in the current metagame. Chespin's ability, Bulletproof, allows it to counter several prominent Pokemon in LC like Foongus and Gastly that do not use Will-O-Wisp and Hex. Chespin can also set up Spikes while simultaneously having consistent recovery in Synthesis. In addition, it is able to check Ground-types like Drilbur and non-RestTalk Mudbray. Chespin's mono-Grass typing, however, makes it weak to both Flying- and Fire-types like Doduo, Rufflet, and Ponyta without being able to damage them very much. It also faces competition from other Spikes setters like Omanyte and Ferroseed, since they can set other entry hazards in addition to Spikes. Chespin is also very mediocre stat-wise, and it faces competition both offensively and defensively from Pokemon like Pumpkaboo-XL, Ferroseed, and Foongus. Finally, Chespin's Speed is fairly low, which affects its ability to put offensive pressure on the opponent.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Offensive Utility",
            "stats": [
                165,
                165,
                225,
                118,
                185,
                112
            ],
            "type": [
                "Grass"
            ],
            "usage": "Switch Chespin in on the Pokemon it typically counters like Gastly and Foongus. Be wary, though, as Chespin may be unable to switch in on Gastly if it is the Will-O-Wisp + Hex variant. You can also switch in Chespin on bulky Water-types like Slowpoke and Mareanie, as it resists their Water-type STAB moves and can hit them super effectively. When Chespin is up against a Pokemon that it walls like Croagunk, you can have it set up Spikes or just hit the opposing Pokemon with a super effective move. When Chespin's HP is low, switch it out or use Synthesis to heal HP (if it is up against a Pokemon that cannot deal much damage to it). Keep Chespin away from Flying- and Fire-types like Doduo, Vullaby, Rufflet, Ponyta, and Houndour because they resist Grass-type moves and can OHKO Chespin with their STAB moves.",
            "moves": [
                [
                    "Seed Bomb"
                ],
                [
                    "Zen Headbutt"
                ],
                [
                    "Synthesis"
                ],
                [
                    "Spikes",
                    "Drain Punch",
                    "Rock Slide"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Bulletproof"
            ],
            "nature": [
                "Impish"
            ],
            "ev spread": [
                68,
                28,
                156,
                0,
                236,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fire-types",
        "Flying-types",
        "Steel-types",
        "Setup Sweepers"
    ],
    "credits": [
        "Written by rssp1",
        "Quality checked by Xayah, Nineage, Corporal Levi,  and Hilomilo",
        "Grammar checked by Fireflame479 and Eyan"
    ]
}