{"name": "Chinchou", "forms": {"Base": {"base stats": [75, 38, 38, 56, 56, 67], "types": ["Water", "Electric"], "abilities": ["Illuminate", "Volt Absorb", "Water Absorb"], "tier": ["LC"], "form": "Base"}}, "overview": "Chinchou is one of the best pivots in Little Cup with a superb typing that makes it only weak to Grass and Ground; even then, with STAB Volt Switch it doesn't mind attacking the former, and with Scald doesn't mind the latter very much either. Its ability Volt Absorb also makes it a reliable check to Electric-types such as Magnemite and opposing Chinchou. It is also one of the few Pokemon able to reliably check the many offensive Flying-types of Little Cup, primarily the likes of Vullaby and Doduo. However, its defensive sets can be too passive and its offensive sets can be too frail. It also has no reliable recovery besides Rest and Berry Juice.\n", "strategies' format": "LC", "strategies": [{"name": "Bulky Pivot", "stats": [205, 100, 181, 186, 148, 185], "type": ["Water", "Electric"], "usage": "This Chinchou set should be used as a fairly liberal pivot. It can be safely switched in on most Flying- and Electric-types such as Doduo and Magnemite. If your opponent lacks an Electric-immune Pokemon, feel free to use Volt Switch on almost every turn Chinchou is out, as it can severely weaken the opposing team for a sweeper to clean up. Be careful when switching into opposing U-turn users such as Vullaby and Rufflet if your opponent has a Diglett, as they can switch out and immediately trap and KO Chinchou. However, if your opponent has their own Chinchou or a Ground-type, luring it in and knocking it out with a Hidden Power Ground or a Scald can quickly turn the tides of battle. If you have a free turn in which you predict the opponent to switch in one of Chinchou's checks or counters, it may be a good idea to cleanse your team of status with Heal Bell. If you predict an Electric-type move, switching in Chinchou can restore some of its health and make it even more of a nuisance to your opponent.", "moves": [["Scald"], ["Volt Switch"], ["Ice Beam", "Hidden Power Ground"], ["Thunder Wave", "Hidden Power Ground"]], "item": [" Berry Juice"], "ability": ["Volt Absorb"], "nature": ["Bold"], "ev spread": [76, 0, 212, 152, 0, 60], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Scarf Pivot", "stats": [186, 100, 125, 206, 148, 248], "type": ["Water", "Electric"], "usage": "The main function of this set is to revenge kill faster threats. Switching into Electric-type attacks is Chinchou's only form of recovery, and it should therefore be utilized against threats such as opposing Chinchou, Magnemite, and Ponyta; the former two sometimes use Hidden Power Ground, though, so be careful. Although this set is a good Flying-type check, if Chinchou is low on HP, avoid switching it into powerful Flying-types, as it can be better utilized as a revenge killer. If your opponent lacks an Electric-immune Pokemon, spamming Volt Switch can quick wear down even bulky Pokemon to a point where a sweeper can take over.", "moves": [["Hydro Pump"], ["Volt Switch"], ["Ice Beam", "Hidden Power Ground", "Scald"], ["Scald", "Hidden Power Ground", "Thunderbolt"]], "item": [" Choice Scarf"], "ability": ["Volt Absorb"], "nature": ["Timid"], "ev spread": [0, 0, 52, 232, 0, 224], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Grass-types", "Electric-immune Pokemon", "Bulky Pokemon that can take a burn", "Croagunk"], "credits": ["Written by Drew", "Quality checked by Fiend, Xayah,  and OP", "Grammar checked by CryoGyro and The Dutch Plumberjack"]}