{
    "name": "Clamperl",
    "forms": {
        "Base": {
            "base stats": [
                35,
                64,
                85,
                74,
                55,
                32
            ],
            "types": [
                "Water"
            ],
            "abilities": [
                "Rattled",
                "Shell Armor"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Thanks to Clamperl's exclusive item Deep Sea Tooth, it can reach an insane 34 Special Attack. Using Shell Smash allows Clamperl to outspeed the entire unboosted LC metagame while also skyrocketing its Special Attack stat. However, Clamperl is quite frail, which makes it quite hard to set up a Shell Smash. Additionally, after it has used Shell Smash, its lowered defensive stats leave it incredibly vulnerable to priority attacks. It is also outclassed by Omanyte, which has a better typing, is less reliant on having a specific item, and is bulkier, allowing for easier set up. However, Clamperl does hit far harder and, unlike Omanyte, is not weak to Mach Punch or Vacuum Wave, which is more important than Omanyte's resistance to Flying-type attacks now that Gale Wings has been nerfed.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Shell Smash",
            "stats": [
                125,
                147,
                206,
                246,
                146,
                160
            ],
            "type": [
                "Water"
            ],
            "usage": "Clamperl can set up at any point in the game. During the early-game it can set up and soften the enemy team to allow for a teammate to clean up, while Clamperl can also set up late-game to sweep weakened teams. You should be very careful while setting up, as Clamperl is incredibly frail and will usually only get one chance to set up. Make sure to get rid of the opponent's priority move users such as Timburr and Pawniard and to weaken bulky special walls such as Munchlax. If Clamperl is unable to sweep for whatever reason, it can still force switches and potentially set up a Substitute, which allows it to fire off powerful attacks freely.",
            "moves": [
                [
                    "Shell Smash"
                ],
                [
                    "Surf"
                ],
                [
                    "Ice Beam"
                ],
                [
                    "Hidden Power Grass",
                    "Substitute"
                ]
            ],
            "item": [
                " Deep Sea Tooth"
            ],
            "ability": [
                "Rattled"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                76,
                0,
                0,
                248,
                0,
                184
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Priority",
        "Revenge Killers",
        "Bulky Pokemon"
    ],
    "credits": [
        "Written by sam-testings",
        "Quality checked by Fiend, Rowan,  and OP",
        "Grammar checked by P Squared and The Dutch Plumberjack"
    ]
}