{
    "name": "Claydol",
    "forms": {
        "Base": {
            "base stats": [
                60,
                70,
                105,
                70,
                120,
                75
            ],
            "types": [
                "Ground",
                "Psychic"
            ],
            "abilities": [
                "Levitate"
            ],
            "tier": [
                "PU"
            ],
            "form": "Base"
        }
    },
    "overview": "Claydol has somewhat of a niche in its access to both Rapid Spin and Stealth Rock. While it's not the only viable Pokemon to get both of these moves, it has other advantages such as its typing; Ground / Psychic is solid defensively and allows Claydol to serve as a switch-in for Pokemon such as Lycanroc and Manectric, notably serving as a Volt Switch stopper. It also gives Claydol a notable niche in being both resistant to Stealth Rock and immune to all other entry hazards thanks to Levitate. Finally, its typing also gives Claydol a good offensive matchup against various hazard setters and removers such as Aggron and Hitmonchan. However, while it does have great defensive stats, its HP is pretty bad, giving it a hard time taking too many hits, especially with its lack of recovery. Its offensive presence is very mediocre, preventing it from picking up many OHKOs such as Earth Power on Skuntank and leaving it as setup fodder for Pokemon such as Lilligant and Calm Mind Clefairy. While its typing is good in various ways, it gives Claydol a bad matchup against spinblockers such as Froslass and Oricorio-G, as well as against common offensive Pokemon such as Lilligant and Ludicolo. Alolan Sandslash is rightfully the more popular pick for a Pokemon with both Rapid Spin and Stealth Rock. This is because of its better defensive typing that allows it to wall more offensive threats such as Aurorus and Lilligant. Furthermore, even if they don't have access to Rapid Spin, Pokemon such as Mudsdale and Regirock outclass Claydol as a Stealth Rock user with their better bulk. The same can be said with Rapid Spin users such as Hitmonchan and Kabutops due to their better offensive presence.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Rapid Spin",
            "stats": [
                219,
                158,
                303,
                176,
                276,
                220
            ],
            "type": [
                "Ground",
                "Psychic"
            ],
            "usage": "Claydol should switch in to take resisted hits from Pokemon such as Hitmonchan and Lycanroc, but it has to watch out for being worn down. Furthermore, some Pokemon that Claydol can check have other moves that do a lot to it or cripple it, such as Aggron's Heavy Slam, Manectric's Switcheroo, and Mudsdale's Toxic. However, if it does manage to come in, Claydol often forces the foe out and can use this as an opportunity to set up Stealth Rock or remove entry hazards. If there are hazards on your side of the field, Claydol can lure in spinblockers such as Oricorio-G and cripple them with Toxic instead. If Claydol isn't running Toxic, it can still lure the spinblocker but instead double switch out to a Pursuit trapper or just a better matchup.",
            "moves": [
                [
                    "Rapid Spin"
                ],
                [
                    "Toxic",
                    "Stealth Rock"
                ],
                [
                    "Psychic"
                ],
                [
                    "Earth Power"
                ]
            ],
            "item": [
                " Colbur Berry"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                252,
                0,
                120,
                0,
                0,
                136
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Ghost-types",
        "Super Effective Attackers",
        "Setup Sweepers"
    ],
    "credits": [
        "Written by UberSkitty",
        "Quality checked by TJ, tondas,  and TONE",
        "Grammar checked by The Dutch Plumberjack and Fireflame479"
    ]
}