{
    "name": "Clefable",
    "forms": {
        "Base": {
            "base stats": [
                95,
                70,
                73,
                95,
                90,
                60
            ],
            "types": [
                "Fairy"
            ],
            "abilities": [
                "Cute Charm",
                "Magic Guard",
                "Unaware"
            ],
            "tier": [
                "OU"
            ],
            "form": "Base"
        }
    },
    "overview": "Clefable's decent bulk along with its great defensive typing allows it to serve as a strong check to attackers such as Mega Medicham, Mega Heracross, Hawlucha, and Mega Lopunny a role that it can perform well due to its reliable recovery in Soft-Boiled. Its ability to act as a strong defensive threat is bolstered by its two amazing abilities in Magic Guard and Unaware that allow Clefable to avoid all residual damage or act as a stop to setup sweepers, respectively. Magic Guard Clefable brings great utility for its teammates as a Stealth Rock setter that has a great matchup against Mega Sableye, easing the matchup against stall teams, or as a strong Calm Mind sweeper. On the other hand, Unaware Clefable is able to stop many setup sweepers that defensive teams would normally have issues dealing with such as Swords Dance Hawlucha and Swords Dance Garchomp. However, despite its decent bulk, Clefable can find itself overwhelmed by attackers that it normally can check provided that it has taken prior damage as well as by strong attackers such as Ash-Greninja that are able to pressure it too much for it to perform its roles efficiently. In addition, due to its low Speed, Clefable is very susceptible to Taunt users such as Heatran and Tapu Lele, which prevent it from providing utility for its team. One of Clefable's main downsides is the fact that due to its lacklustre offensive presence, it invites very threatening wallbreakers like Heatran, Mega Mawile, and Volcarona.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Magic Guard",
            "stats": [
                289,
                158,
                269,
                226,
                217,
                156
            ],
            "type": [
                "Fairy"
            ],
            "usage": "Clefable should be brought directly into the match into Pokemon that it checks such as Mega Heracross and Mega Lopunny; from there, Clefable can use Soft-Boiled to regain health, throw out a Moonblast to wear down the threat in front of Clefable, or set up Stealth Rock on the predicted switch. When Clefable is in the match, the player should look at the opponent's team to see what they have to check Clefable; if the opponent has a Steel-type like Celesteela or Ferrothorn, it is best not to go for Moonblast and rather to predict their switch by using Knock Off to remove their item or using Flamethrower to wear them down. If Clefable is running Stealth Rock, it is best to try setting up the entry hazard at the earliest opportunity for teammates to take advantage of. When facing stall teams with Mega Sableye, if they decide to lead with Sableye, do not use Stealth Rock immediately, as they will attempt to use Protect and Mega Evolve on the first turn to bounce the hazard back. Instead, throw out a Moonblast, and then after Mega Sableye has switched out, attempt to set up Stealth Rock only if you are sure that Mega Sableye will not try to switch back into Clefable. Despite its good bulk, Clefable will find itself gradually worn down throughout the match by switching into threats that it checks, so finding opportunities to heal back up with Soft-Boiled is important; Clefable can recover up on predicted switches to an opponent's Steel-type or to a passive threat that cannot inflict much damage to Clefable.",
            "moves": [
                [
                    "Moonblast"
                ],
                [
                    "Soft-Boiled"
                ],
                [
                    "Stealth Rock"
                ],
                [
                    "Wish"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Magic Guard"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                252,
                0,
                252,
                0,
                4,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Calm Mind",
            "stats": [
                289,
                158,
                269,
                226,
                217,
                156
            ],
            "type": [
                "Fairy"
            ],
            "usage": "Use Clefable to switch into and defeat various threats, such as Hawlucha and Mega Lopunny. Clefable can use Calm Mind to punish switches and facilitate a sweep. Don't immediately use Stealth Rock against Mega Sableye if it is led off with, as it will most likely Mega Evolve and use Protect to guarantee Magic Bounce. Instead, try to punish Mega Sableye by using Calm Mind, as this will force it out and thus makes it easier to get up Stealth Rock. Try to use Thunder Wave or Knock Off as much as possible to cripple switch-ins such as Heatran and Celesteela to make it easier for Clefable to set up and sweep late-game. Make sure Steel-types such as Heatran, Celesteela, and Mega Scizor have been taken care of before attempting to set up with Calm Mind. Don't reveal Flamethrower if it is being run until Steel-types such as Celesteela and Mega Scizor feel comfortable switching into Clefable. Constantly use Soft-Boiled with Clefable, as it will struggle to switch into Pokemon it is supposed to check, such as Mega Medicham, Hawlucha, and Mega Lopunny, if it isn't at full health.",
            "moves": [
                [
                    "Calm Mind"
                ],
                [
                    "Moonblast"
                ],
                [
                    "Soft-Boiled"
                ],
                [
                    "Stealth Rock",
                    "Thunder Wave"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Magic Guard"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                252,
                0,
                252,
                0,
                4,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Unaware",
            "stats": [
                289,
                158,
                269,
                226,
                217,
                156
            ],
            "type": [
                "Fairy"
            ],
            "usage": "Clefable is primarily used on stall or balanced teams as a direct switch-in to setup sweepers such as Swords Dance Garchomp and Swords Dance Mega Heracross; these threats have difficulty breaking past Clefable due to their inability to use boosts to beat it. Although Pokemon such as Gliscor that Clefable normally checks may run moves like Toxic to deal with it, Heal Bell lets Clefable prevent poison from wearing it down too much and stall Gliscor out. Moonblast is a good move to throw out to wear down opposing Pokemon in combination with poison from Toxapex's Toxic Spikes or Mega Sableye's Will-O-Wisp. Wish should be used whenever Clefable is running low on health, as keeping Clefable as healthy as possible is vital to its performance on its team; once it has used Wish, Protect should be used the next turn to guarantee that Clefable can heal using its own Wish. Given that this set is relatively passive, using Wish so that Clefable can pass it to any of its teammates so that they can come in for free is a good idea; for example, if an opponent brings Tapu Koko into Unaware Clefable to try breaking past it, Clefable can use Wish on the predicted switch and switch into Chansey to heal off any damage it may have taken in the process.",
            "moves": [
                [
                    "Moonblast"
                ],
                [
                    "Wish"
                ],
                [
                    "Protect"
                ],
                [
                    "Heal Bell"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Unaware"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                252,
                0,
                252,
                0,
                4,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Steel-types",
        "Fire-types",
        "Poison-types",
        "Taunt Users",
        "Offensive Pressure"
    ],
    "credits": [
        "Written by Eclipse and Jordy",
        "Quality checked by Gary, Subject 18,  and p2",
        "Grammar checked by The Dutch Plumberjack and P Squared"
    ]
}