{
    "name": "Cloyster",
    "forms": {
        "Base": {
            "base stats": [
                50,
                95,
                180,
                85,
                45,
                70
            ],
            "types": [
                "Water",
                "Ice"
            ],
            "abilities": [
                "Overcoat",
                "Shell Armor",
                "Skill Link"
            ],
            "tier": [
                "RU"
            ],
            "form": "Base"
        }
    },
    "overview": "Cloyster's offensive typing in conjunction with its access to Shell Smash makes it stand out over other Water-types in the current RU metagame. After using Shell Smash, Cloyster jumps to an outstanding Speed tier, becoming a potent cleaner that can be really hard to stop and difficult to revenge kill outside a select pool of Choice Scarf users like Salazzle and finding itself able to punish many team compositions that include multiple Ice-weak Pokemon like Nidoqueen, Xatu, and Chesnaught. Furthermore, Cloyster's amazing ability Skill Link allows it to make good use of moves like Icicle Spear and Rock Blast, enabling it to break through Focus Sashes and Sturdy. Finally, Cloyster's gargantuan Defense stat that provides it with plenty of setup opportunities against a good number of physical attackers like Flygon, Snorlax, Araquanid, and Zygarde-10%. However, being weak to all form of entry hazards means that Cloyster has to be preserved for late-game, since it gets worn down rather easily by those, removing potential setup opportunities. Cloyster also lacks the coverage to hit Steel-types like Registeel, Escavalier, and Bronzong and other defensive Pokemon like Cresselia, so it becomes a less appealing choice over its Water-type competition like Feraligatr and Bruxish. Finally, an abysmal Special Defense stat means that even resisted special hits will do excessive amounts of damage to Cloyster, which means it can't afford to setup against any kind of special attacker.\n",
    "strategies' format": "RU",
    "strategies": [
        {
            "name": "Shell Smash Sweeper",
            "stats": [
                136,
                289,
                396,
                207,
                113,
                262
            ],
            "type": [
                "Water",
                "Ice"
            ],
            "usage": "As Icicle Spear makes for a rather spammable move, Cloyster should use it constantly early-game to weaken its checks. Ideally, you should save Cloyster for late-game, when Pokemon like Milotic, Cresselia, and Registeel are weakened enough for Cloyster to effectively sweep through them. Cloyster finds a good number of setup opportunities against physical attackers like Flygon, Doublade lacking Sacred Sword or Toxic, and Araquanid, so make sure to take advantage of that by using them as setup fodder when provided a free switch. Since it relies on its natural physical bulk to tank some priority moves that could otherwise end its sweep like Sucker Punch from Honchkrow and Extreme Speed from Zygarde-10%, Cloyster should be kept as healthy as possible. Lastly, Comfey, although relatively uncommon, is a Pokemon Cloyster should be really careful around, since, thanks to Triage, it can stop a set-up Cloyster at any given moment.",
            "moves": [
                [
                    "Shell Smash"
                ],
                [
                    "Icicle Spear"
                ],
                [
                    "Explosion"
                ],
                [
                    "Hydro Pump"
                ]
            ],
            "item": [
                " Normalium Z",
                " Life Orb"
            ],
            "ability": [
                "Skill Link"
            ],
            "nature": [
                "Naive",
                "Naughty"
            ],
            "ev spread": [
                0,
                252,
                0,
                4,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Steel-types",
        "Special Attackers",
        "Bulky Water-types",
        "Grass-types",
        "Status"
    ],
    "credits": [
        "Written by Mr Aldo",
        "Quality checked by Phantom, Avocado,  and Teachable",
        "Grammar checked by Martha and The Dutch Plumberjack"
    ]
}