{
    "name": "Cobalion",
    "forms": {
        "Base": {
            "base stats": [
                91,
                90,
                129,
                90,
                72,
                108
            ],
            "types": [
                "Steel",
                "Fighting"
            ],
            "abilities": [
                "Justified"
            ],
            "tier": [
                "UU"
            ],
            "form": "Base"
        }
    },
    "overview": "Cobalion is one of the premier threats in the tier, with a versatile set of options including the ability to boost with both Swords Dance and Calm Mind, access to Stealth Rock, excellent Speed, and a great defensive typing that lets it check top-tier threats like Scizor, Hydreigon, and Bisharp. Its immunity to Toxic lets it come in on threats like Blissey and means it doesn't have to worry about losing to poison damage. Swords Dance is its flagship set, being very customizable and fulfilling a lot of roles besides that of a sweeper. Cobalion can run a variety of items to better fit the need of the team it is used on, with Z-Moves to wallbreak more easily, Rocky Helmet to punish physical attackers, and Shuca Berry to lure and remove Ground-types like Krookodile all being viable options. It is one of the best Pokemon at punishing Dark-types and Pursuit trappers thanks to its ability Justified, and its presence alone will make some of Cobalion's Dark-weak teammates able to be played more freely. There are some drawbacks to using Cobalion; notably, its Steel / Fighting dual typing leaves it without resistances to Psychic and Flying, which means that threats like Latias and Togekiss can be harder for Cobalion's team to deal with if it is the only Steel-type. It also faces competition from other offensive Stealth Rock users like Krookodile, Nihilego, and Terrakion, all of which have more unboosted power and different defensive typings to take advantage of. It also is severely lacking in initial power before boosting, having a mediocre base 90 in both Attack and Special Attack. This leaves the Swords Dance set walled by Pokemon like Slowbro even after a boost, while the Calm Mind set can struggle to get KOs on even offensive Pokemon. The Calm Mind set's main competition in Nasty Plot Lucario can wallbreak much more easily, as well.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "Swords Dance",
            "stats": [
                218,
                279,
                294,
                194,
                181,
                346
            ],
            "type": [
                "Steel",
                "Fighting"
            ],
            "usage": "Cobalion is not great at breaking through teams early-game, since its Attack leaves much to be desired. If run, Cobalion should be focused on setting Stealth Rock early and waiting for teammates or entry hazards to weaken foes before it attempts to sweep. Cobalion's HP should be kept high so it can survive revenge killing attempts when it is attempting to clean. Rock Polish aids it here by being able to outspeed and avoid attacks from Choice Scarf users when boosted, only fearing priority from Fighting-types like Infernape and Lucario. Be careful when using Cobalion's Z-Moves, be it Fightinium Z or Steelium Z. They should be used in order to get through walls Cobalion normally can't break. After it uses Swords Dance, Hippowdon, Alomomola, and Swampert all have to be wary of taking an All-Out Pummeling, while Gligar and Amoonguss should fear Corkscrew Crash. Aggressive play is rewarded with Rocky Helmet, so try to switch Cobalion into U-turn users like Scizor, Mega Beedrill, and even Choice Scarf Hydreigon; the chip damage will quickly add up for Cobalion's team and allow a cleaner to sweep more easily. Shuca Berry allows Cobalion to be more aggressive when facing Ground-types like Mamoswine and Gligar. In neutral situations, it can safely boost thanks to the reduced damage, while if the Ground-type is already on low HP, it can come in with impunity to revenge kill. Cobalion, despite being a Steel-type, has issues dealing with Fairy- and Psychic-types due to its neutrality to their attacks and its mediocre Special Defense. It is generally not advised to switch in and try and directly force them out, as Cobalion loses chunks of its HP quickly. Once it has acquired a Swords Dance boost, however, Cobalion will cleanly KO most Fairy-types like Florges and Togekiss.",
            "moves": [
                [
                    "Swords Dance"
                ],
                [
                    "Iron Head"
                ],
                [
                    "Close Combat"
                ],
                [
                    "Stealth Rock",
                    "Rock Polish"
                ]
            ],
            "item": [
                " Fightinium Z",
                " Rocky Helmet",
                " Shuca Berry"
            ],
            "ability": [
                "Justified"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                0,
                0,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Calm Mind",
            "stats": [
                218,
                194,
                294,
                279,
                181,
                346
            ],
            "type": [
                "Steel",
                "Fighting"
            ],
            "usage": "Cobalion should not be used much at all early-game, instead letting its teammates punch holes in the enemy team first. The Calm Mind set is better at finishing games than opening them. Be careful about revealing its moveset early, as the surprise factor is often a big part in Calm Mind sets picking up KOs on unsuspecting physical walls like Slowbro. Cobalion is especially valuable versus stall teams, which often will play around it as if its physical. Use Gigavolt Havoc wisely when running Volt Switch, as it is otherwise forced out when using Electric-type coverage, removing any boosts it has accumulated. It is often wise to use Volt Switch before boosting to try and soften targets into the Z-Move's range. This way, Cobalion won't have to use Volt Switch again and can keep its boosts to sweep. Cobalion can come in on special walls like Blissey and Nihilego to bluff the physical set and then proceed to set up Calm Minds at little cost. Choice item users like Hydreigon and Krookodile locked into Dark-type moves are also used as chances to get free setup. Alomomola is weak enough for Cobalion to set up on as well. While Cobalion does have the natural bulk to come in directly when it must, it appreciates having close to full HP when attempting to sweep, as it must usually tank a hit or two when setting up. Try and bring it in off pivoting moves or double switches when possible.",
            "moves": [
                [
                    "Calm Mind"
                ],
                [
                    "Flash Cannon"
                ],
                [
                    "Focus Blast"
                ],
                [
                    "Hidden Power Grass",
                    "Volt Switch"
                ]
            ],
            "item": [
                " Fightinium Z",
                " Electrium Z"
            ],
            "ability": [
                "Justified"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Ground-types:",
        "Water-types:",
        "Residual Damage:",
        "Fighting-resistant Pokemon:",
        "Faster Offensive Threats:"
    ],
    "credits": [
        "Written by Sage",
        "Earlier versions by Eyan and Jordy",
        "Quality checked by vivalospride, Hilomilo,  and Nuked",
        "Grammar checked by martha and A Cake Wearing A Hat"
    ]
}