{
    "name": "Corphish",
    "forms": {
        "Base": {
            "base stats": [
                43,
                80,
                65,
                50,
                35,
                35
            ],
            "types": [
                "Water"
            ],
            "abilities": [
                "Adaptability",
                "Hyper Cutter",
                "Shell Armor"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Thanks to Adaptability and a decent offensive typing, Corphish is a fantastic choice for many offensive teams. A combination of Knock Off and Crabhammer means that even Pokemon that resist Crabhammer are usually unable to safely switch into Corphish more than once, rendering it an extremely potent wallbreaker. It is also very useful against offense, as its Adaptability Aqua Jet is one of the strongest priority moves in the metagame. Boosting moves such as Swords Dance and Dragon Dance allow it to attempt a sweep with a small amount of support. Corphish struggles somewhat with its mediocre bulk and sub-par Speed, but it is usually fast enough to outspeed most walls. However, despite its good movepool, it does not have enough moveslots to fit all the moves that it wants, and will sometimes struggle against common Pokemon such as Foongus and Croagunk.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Wallbreaker",
            "stats": [
                122,
                269,
                185,
                122,
                106,
                165
            ],
            "type": [
                "Water"
            ],
            "usage": "Removing enemy items such as Berry Juice and Eviolite can be very helpful for Corphish and its teammates, so try to hit opposing switch-ins with Knock Off. Try to keep Corphish alive against bulkier teams, as it can deal with those types of teams well thanks to its ability to wallbreak. Use Swords Dance to clean up when the enemy team is at low health near the end of a game, or use it near the beginning to put large holes in the enemy team to allow the rest of your team to clean up. Corphish can take advantage of the switches that it forces to set up Swords Dance.",
            "moves": [
                [
                    "Crabhammer"
                ],
                [
                    "Aqua Jet"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Swords Dance"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Adaptability"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                0,
                196,
                76,
                0,
                0,
                236
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Dragon Dance",
            "stats": [
                122,
                245,
                185,
                122,
                106,
                181
            ],
            "type": [
                "Water"
            ],
            "usage": "Be careful when using Corphish early-game, as it can be easily worn down, making it harder to set up later in the game. Use Corphish late-game to sweep after checks such as Foongus, Cottonee, and Croagunk are weakened. Corphish can be used to weaken its own checks with Knock Off early in the game. Use Aqua Jet to pick off weakened or frail opposing Pokemon.",
            "moves": [
                [
                    "Crabhammer"
                ],
                [
                    "Aqua Jet"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Dragon Dance"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Adaptability"
            ],
            "nature": [
                "Jolly",
                "Adamant"
            ],
            "ev spread": [
                0,
                196,
                76,
                0,
                0,
                236
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Water-resistant Walls",
        "Fast Offensive Threats"
    ],
    "credits": [
        "Written by sam-testings",
        "Quality checked by Xayah, Hilomilo, Nineage,  and Rowan",
        "Grammar checked by talkingtree and Fireflame479"
    ]
}