{"name": "Crabrawler", "forms": {"Base": {"base stats": [47, 82, 57, 42, 47, 63], "types": ["Fighting"], "abilities": ["Anger Point", "Hyper Cutter", "Iron Fist"], "tier": ["LC"], "form": "Base"}}, "overview": "Crabrawler is able to beat Pokemon that give Fighting-types trouble, such as Mudbray and Mareanie, thanks to its impressive coverage. Its decent Attack and Speed stats make it a good wallbreaker or late-game cleaner, and its passable bulk allows it to take resisted hits well. Its ability Hyper Cutter provides some use in not weakening the power of Crabrawler's moves. However, Crabrawler's bulk is not the best, and Iron Fist, usually an ideal ability for physical Fighting-types, is completely useless on it, as it does not have access to a good punch-based move. Furthermore, Crabrawler faces competition from other bulky attackers such as Mienfoo, Croagunk, and Timburr, as well as Mankey, which has a useful ability and access to Gunk Shot. It also does not have access to Knock Off, resulting it with a poor matchup against Psychic- and Ghost-types and meaning that Crabrawler requires a lot of support to help against them. Finally, it lacks semi-reliable recovery in Drain Punch, which a lot of Fighting-types have.\n", "strategies' format": "LC", "strategies": [{"name": "Physical Attacker", "stats": [99, 245, 165, 108, 130, 247], "type": ["Fighting"], "usage": "Crabrawler should spam its high-Base Power moves, no matter how much HP it has. While it has decent bulk, it cannot take too many neutral attacks, so be aware of that before switching it in recklessly. A resistance to Stealth Rock might be appealing, but Crabrawler is vulnerable to being severely worn down by Spikes and Toxic Spikes. It is also incredibly susceptible to being trapped by Gothita, so you must use it very carefully and don't sacrifice it unnecessarily.", "moves": [["Close Combat"], ["Crabhammer"], ["Earthquake"], ["Stone Edge"]], "item": [" Life Orb", " Choice Scarf"], "ability": ["Hyper Cutter"], "nature": ["Jolly"], "ev spread": [0, 180, 60, 0, 0, 252], "iv spread": [0, 31, 31, 31, 31, 31]}], "counters": ["Bulky Ghost-types", "Fighting-resistant Pokemon", "Faster Pokemon"], "credits": ["Written by Sobi", "Quality checked by Fiend, Coconut,  and Tricking", "Grammar checked by Kris and Haund"]}