{
    "name": "Cresselia",
    "forms": {
        "Base": {
            "base stats": [
                120,
                70,
                120,
                75,
                130,
                85
            ],
            "types": [
                "Psychic"
            ],
            "abilities": [
                "Levitate"
            ],
            "tier": [
                "RU"
            ],
            "form": "Base"
        }
    },
    "overview": "Cresselia possesses absurd physical and special bulk, which allows it to take on even the most threatening Pokemon in the tier such as Garchomp and most variants of offensive Landorus-T. This, combined with a great support move in Lunar Dance, makes it a reliable Trick Room setter. Lunar Dance is a particularly great asset on a Trick Room setter because it allows Cresselia to bring a fully healed teammate safely into the battle after setting Trick Room. Despite its excellent defensive capabilities, Cresseila's low Special Attack turns it into a rather passive Pokemon that can be taken advantage of by some setup sweepers like Swords Dance Mega Mawile and Quiver Dance Volcarona, meaning it will usually be forced to use Lunar Dance right after setting up Trick Room to regain momentum and prevent a sweep. It's also heavily reliant on its one-time use Mental Herb; without it, Pokemon with Taunt such as Tapu Koko and Heatran can easily shut it down.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Trick Room",
            "stats": [
                338,
                176,
                372,
                186,
                298,
                157
            ],
            "type": [
                "Psychic"
            ],
            "usage": "Thanks to Cresselia's immense mixed bulk, it finds plenty of opportunities to pivot into offensive threats like Landorus-T, Mega Medicham, and Mega Diancie and set up Trick Room mid-game. Once Trick Room has been set up, it should avoid staying in on the field for too long because this takes valuable time away from its teammates. Using Lunar Dance right after Trick Room is a great way of regaining momentum without wasting too many turns in pivoting around to get a Trick Room sweeper into the game. However, there are some instances where sacrificing a weakened teammate to bring a healthy one into the battle works better because it allows Cresselia to set up Trick Room again and use its Lunar Dance later. This is also helpful on instances where Cresselia needs to be preserved until the end-game to switch into an opposing threat.",
            "moves": [
                [
                    "Trick Room"
                ],
                [
                    "Ice Beam"
                ],
                [
                    "Moonlight"
                ],
                [
                    "Lunar Dance"
                ]
            ],
            "item": [
                " Mental Herb"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Relaxed"
            ],
            "ev spread": [
                248,
                0,
                252,
                0,
                8,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                0
            ]
        }
    ],
    "counters": [
        "Strong Dark-types",
        "Ghost-types",
        "Taunt",
        "Status Inducers"
    ],
    "credits": [
        "Written by Leo",
        "Quality checked by Gary, p2,  and Colonel M",
        "Grammar checked by GatoDelFuego and Haund"
    ]
}