{"name": "Crustle", "forms": {"Base": {"base stats": [70, 105, 125, 65, 75, 45], "types": ["Bug", "Rock"], "abilities": ["Shell Armor", "Sturdy", "Weak Armor"], "tier": ["Untiered"], "form": "Base"}}, "overview": "Crustle is a decent suicide lead on hyper offense teams thanks to its ability to set up both Stealth Rock and Spikes, a feature lacking in most other lead Pokemon. Additionally, Crustle packs nifty moves in Rock Blast and Knock Off, which are very effective against opposing leads like Shuckle and Ferroseed. Crustle has two useful abilities that solidify its role as an entry hazard setter, with Sturdy letting it survive at least one attack and Weak Armor letting it take advantage of physical attackers by receiving a Speed boost when hit, allowing Crustle to outspeed most of them and set up another hazard the following turn. However, Crustle's selection of coverage moves is rather lacking, often making it setup fodder to bulkier Pokemon such as Carracosta and Alolan Sandslash. Crustle is also very slow and generally passive, which makes it vulnerable to Taunt users such as Alolan Persian and Misdreavus. Special attackers in particular are a pain for it, as Crustle has mediocre Special Defense, and special attacks do not activate Weak Armor. Crustle faces competition as a hazard setter from Pokemon such as Aurorus and Aggron, which can apply offensive pressure alongside setting up Stealth Rock. Lastly, Crustle is quite one-dimensional and predictable, as it's outclassed in other roles like a Shell Smash sweeper and a fully defensive wall by Pokemon like Carracosta and Regirock, respectively.\n", "strategies' format": "PU", "strategies": [{"name": "Entry Hazard Lead", "stats": [176, 309, 287, 149, 186, 207], "type": ["Bug", "Rock"], "usage": "Crustle should be used as a suicide lead, as its mission is to get up as many entry hazards as possible. However, if one runs the Focus Sash variant of Crustle and the opposing team reveals or has an obvious Taunt user, it's often safe to not lead Crustle until said Taunt user is off the field or eliminated; Stealth Rock leads such as Lycanroc and Aggron will often carry Taunt. Also, be cautious of Crustle's weakness to Stealth Rock, which can limit the number of times it can switch in if Stealth Rock is on the field. Stealth Rock is usually the most important hazard to set up first, since it hits Pokemon of all types, but it's still important to evaluate whether Stealth Rock or Spikes is more valuable to set up first in the event that Crustle can only set up one form of hazards. For instance, a team with a few Fire- and Flying-types will not appreciate taking Stealth Rock damage. However, versus grounded offensive teams and bulky Fighting- and Ground-types, Spikes is generally more useful. The Focus Sash + Weak Armor set must be cautious of faster Taunt users such as Skuntank and Alolan Persian, as Crustle cannot get up hazards versus them. Likewise, the Mental Herb + Sturdy set has to watch out for attackers that can 2HKO it such as Leafeon and Kabutops, which limit the number of hazards it can successfully set up. In some instances, getting up every single hazard may not be necessary. It might be better to break Focus Sash or Sturdy from leads like Lycanroc and Shuckle so they can be revenge killed the following turn.", "moves": [["Stealth Rock"], ["Spikes"], ["Knock Off"], ["Rock Blast", "Stone Edge"]], "item": [" Focus Sash", " Mental Herb"], "ability": ["Weak Armor", "Sturdy"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Special Attackers", "Fast Taunt Users", "Hazard Removers"], "credits": ["Written by tondas", "Quality checked by allstarapology, yogi,  and Megazard", "Grammar checked by Fireflame479 and The Dutch Plumberjack"]}