{"name": "Cryogonal", "forms": {"Base": {"base stats": [80, 50, 50, 95, 135, 105], "types": ["Ice"], "abilities": ["Levitate"], "tier": ["NU"], "form": "Base"}}, "overview": "Cryogonal is one of the tier's premier Rapid Spin users and better specially defensive walls. Its Levitate ability allows it to come in safely on all entry hazards except Stealth Rock, while access to Recover gives it longevity. Its sky-high Special Defense allows it to reliably check a multitude of special attackers, including Palossand, Vikavolt, Vivillon, and Whimsicott. Unfortunately, its Ice typing gives it a weakness to Stealth Rock, making it lose 25% of its health every time it switches into the entry hazard and forcing it to use Recover more often. Cryogonal's low Defense stat also makes it vulnerable to Pursuit trapping and any non-resisted physical attacks; this further hinders its capacity to remove entry hazards, as common entry hazard setters like Garbodor, Steelix, and Rhydon can hit it hard with their physical attacks.\n", "strategies' format": "NU", "strategies": [{"name": "Specially Defensive Spinner", "stats": [258, 122, 136, 226, 365, 285], "type": ["Ice"], "usage": "Switch Cryogonal into most special attackers such as Palossand, Blastoise, Rotom, and Mega Abomasnow and badly poison them with Toxic or make use of their inability to break Cryogonal to remove entry hazards. However, Cryogonal must be wary of switching into Focus Blast from Mega Abomasnow, as it severely dents Cryogonal. Be careful if the opponent has a Pursuit trapper like Sneasel, Houndoom, or Aerodactyl, as these Pokemon can remove Cryogonal from the game. The first two are especially dangerous, as they have little to fear from Freeze-Dry and don't mind being badly poisoned by Toxic. While Cryogonal has a great matchup against Palossand, Omastar, and defensive Druddigon, as they fear Freeze-Dry and Toxic, other entry hazard setters such as Garbodor, Rhydon, Torterra, and Steelix can force Cryogonal out with any of their physical STAB attacks. Toxic lets you punish less durable Pokemon such as Incineroar and Hariyama early in the game. Besides being able to remove entry hazards, Cryogonal also serves as a standalone wall to Pokemon such as Heliolisk, Comfey, and Vikavolt.", "moves": [["Rapid Spin"], ["Freeze-Dry"], ["Toxic"], ["Recover"]], "item": [" Leftovers"], "ability": ["Levitate"], "nature": ["Calm"], "ev spread": [248, 0, 0, 0, 104, 156], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Stealth Rock", "Faster Physical Attackers", "Fire-types", "Fighting-types", "Steel-types", "Bulky Setup Sweepers"], "credits": ["Written by Rhydonphilip", "Previous versions by poh", "Quality checked by Kay, Rabia,  and Eternally", "Grammar checked by The-Dutch-Plumberjack and Fleurdyleurse"]}