{
    "name": "Cubone",
    "forms": {
        "Base": {
            "base stats": [
                50,
                50,
                95,
                40,
                50,
                35
            ],
            "types": [
                "Ground"
            ],
            "abilities": [
                "Battle Armor",
                "Lightning Rod",
                "Rock Head"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Cubone is one of the hardest hitters in Little Cup thanks to its Thick Club-doubled Attack. It also has a unique and powerful STAB attack in Bonemerang, which hits twice and thus can break Focus Sash and Sturdy. Combine that with its great physical bulk and good coverage options in Knock Off and Rock Slide, and you've got one powerful wallbreaker. Unfortunately, Cubone is really easy to take advantage of due to its poor Speed and special bulk, therefore requiring a lot of support from teammates to effectively sweep. It also faces competition from Mudbray, which isn't as strong as Cubone but is faster and bulkier. Lastly, Cubone is extremely vulnerable to Knock Off due to its reliance on Thick Club to deal any sufficient damage.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Physical Attacker",
            "stats": [
                136,
                185,
                245,
                104,
                136,
                181
            ],
            "type": [
                "Ground"
            ],
            "usage": "Cubone is a very effective wallbreaker, since it can remove Eviolite from common defensive Pokemon and finish them off with Bonemerang or Rock Slide. Do not leave Cubone in against any Knock Off user unless you're sure it can outspeed and KO it; for example, Cubone cannot outspeed Choice Scarf Pawniard even with Sticky Web up, so it should definitely be switched out. Against Sturdy + Berry Juice users such as Onix, use Knock Off first to remove their recovery. Magnemite in particular can easily use Recycle to restore a consumed Berry Juice, but not one that has been removed by Knock Off. You can also sweep with Cubone, but a way to circumvent its low Speed is needed; therefore, sending it out with Sticky Web on the field is a good idea. Finally, due to Cubone's poor special bulk, bringing it in with a slow pivoting move is ideal to avoid prior damage.",
            "moves": [
                [
                    "Bonemerang"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Rock Slide"
                ],
                [
                    "Fire Punch"
                ]
            ],
            "item": [
                " Thick Club"
            ],
            "ability": [
                "Battle Armor"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                196,
                76,
                0,
                0,
                236
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Knock Off",
        "Faster Pokemon",
        "Choice Scarf Users",
        "Priority",
        "Water-types"
    ],
    "credits": [
        "Written by Mega-Pokebattlerz",
        "Quality checked by sparktrain, Xayah,  and Hilomilo",
        "Grammar checked by CryoGyro and Fireflame479"
    ]
}