{
    "name": "Decidueye",
    "forms": {
        "Base": {
            "base stats": [
                78,
                107,
                75,
                100,
                100,
                70
            ],
            "types": [
                "Grass",
                "Ghost"
            ],
            "abilities": [
                "Long Reach",
                "Overgrow"
            ],
            "tier": [
                "NU"
            ],
            "form": "Base"
        }
    },
    "overview": "Decidueye finds a unique place in the UU tier with its powerful Z-Move and useful secondary Ghost typing giving it some strengths over its main competition in Celebi. It is one of the best dedicated stallbreakers in the metagame, being able to take advantage of many common defensive Pokemon and become immediately threatening after a Swords Dance. Furthermore, its incredibly strong Z-Move lets it push through even Ghost-resistant Pokemon like Bisharp and Alolan Muk after some chip damage or at +2. However, Decidueye's weakness to Pursuit and Sucker Punch from threats like Krookodile and Bisharp forces it to rely on Substitute to avoid dangerous situations with trappers, especially with the prevalence of Dark-types in UU. Their prevalence also hinders it from breaking through non-defensive teams cleanly, though it can still deal some damage in such matchups with its powerful Z-Move. Decidueye's low base 70 Speed also is a huge disadvantage, making it prone to being revenge killed and preventing it from outspeeding many offensive Pokemon like Moltres, Kommo-o, Hydreigon, and Rotom-H, needing either a Substitute up or teammates to break these Pokemon. Lastly, Decidueye still faces strong competition from Celebi, which can deal with faster offensive threats significantly more easily because of its base 100 Speed, is more sustainable thanks to Giga Drain, and has a higher Speed tier, more natural bulk, and wider coverage.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "Swords Dance",
            "stats": [
                200,
                306,
                186,
                212,
                236,
                262
            ],
            "type": [
                "Grass",
                "Ghost"
            ],
            "usage": "Be careful when using Decidueye early-game if your opponent has a trapper such as Krookodile or Mega Aerodactyl. It's often good to use Substitute in order to scout these Pokemon and potentially hit them hard with Leaf Blade or Spirit Shackle. Decidueye should be brought in through pivoting moves and after fainted Pokemon most of the time, as even against the Pokemon it sets up on, it can risk being afflicted with Scald burns or Toxic poison, which greatly hinder or even ruin its chances to break through teams. When using Decidueye against stall, try to wear down the few Pokemon those teams carry that can potentially stop a Decidueye sweep like Moltres and Hydreigon. It is worth it to preserve Decidueye's health so it can find more opportunities to set up later in the game rather than blowing its chance early and being revenge killed. There are many Pokemon that can't touch Decidueye at all behind a Substitute, such as Blissey, Alomomola, Slowbro lacking Psyshock, Quagsire, Suicune, and non-Whirlwind Hippowdon. Use Substitute on these Pokemon to initiate a sweep. Against offensive teams, it is often wise to use Decidueye's Z-Move relatively early to take a huge hit out of a Pokemon that resists Decidueye's STAB moves and open paths for other Pokemon more geared to sweeping against faster teams to win.; Choice Scarf Hydreigon is a great target for this strategy. Decidueye often won't get chances to use Swords Dance against these teams. Instead, rely on using Substitute to force trades and attacking with your STAB moves.",
            "moves": [
                [
                    "Swords Dance"
                ],
                [
                    "Substitute"
                ],
                [
                    "Leaf Blade"
                ],
                [
                    "Spirit Shackle"
                ]
            ],
            "item": [
                " Decidium Z"
            ],
            "ability": [
                "Overgrow"
            ],
            "nature": [
                "Jolly",
                "Adamant"
            ],
            "ev spread": [
                32,
                224,
                0,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Dark-types",
        "Flying-types",
        "Faster Offensive Threats",
        "Status",
        "Pursuit Users"
    ],
    "credits": [
        "Written by Sage",
        "Quality checked by martha, Nuked,  and Eyan",
        "Grammar checked by fleurdyleurse and The Dutch Plumberjack"
    ]
}