{"name": "Dewpider", "forms": {"Base": {"base stats": [38, 40, 52, 40, 72, 27], "types": ["Water", "Bug"], "abilities": ["Water Absorb", "Water Bubble"], "tier": ["LC"], "form": "Base"}}, "overview": "Dewpider is a very bulky Sticky Web setter able to easily switch in on many Fighting-, Ground-, Water-, and Fire-types such as Timburr, Mudbray, Corphish, and Ponyta to set up the entry hazard. An amazing ability in Water Bubble lets Dewpider threaten a large portion of the metagame with its Water-type attacks while preventing burns and halving Fire damage. Dewpider also has a nice movepool that includes Magic Coat to bounce back status moves like entry hazards and potentially function as a lead, Scald to burn and cripple physical attackers, and Giga Drain to hit Water-types and restore some HP. However, while Dewpider's typing grants it good resistances, it also leaves it vulnerable to common Flying-types like Vullaby and Doduo, which not only beat Dewpider but also are unaffected by Sticky Web's Speed reduction, Electric-types such as Chinchou and Elekid, Rock-types, and especially Stealth Rock, which chips away a quarter of its HP as it switches in. Dewpider's Stealth Rock weakness is compounded by its lack of consistent recovery and low Speed stat before Sticky Web is up, making it worn down pretty easily. Its low Speed also makes it face competition with Surskit as a Sticky Web setter, as Surskit's greater Speed lets it set up more consistently. Lastly, the prevalence of Snivy and Pawniard in the metagame make it hard to use Dewpider effectively, as they both have abilities that punish Sticky Web, with Snivy even being able to clear entry hazards with Defog.\n", "strategies' format": "LC", "strategies": [{"name": "Special Sticky Web", "stats": [125, 104, 185, 159, 185, 125], "type": ["Water", "Bug"], "usage": "Dewpider can make for an effective lead, as using Sticky Web early-game lets Dewpider's team make the most of the move. Dewpider can also use Magic Coat to reflect any entry hazards from opposing leads like Ferroseed and Dwebble, though it should only be used if you're sure the opponent will use a status move, as many of these Pokemon can also threaten or cripple Dewpider. Dewpider can also use its bulk to switch in on Pokemon such as Mudbray, Corphish, and Mienfoo mid-game and force a switch to set up Sticky Web. However, Dewpider could also come in on a free switch from a slow U-turn or after a KO on a Pokemon it outspeeds such as Mudbray or Spritzee to set up Sticky Web a lot more freely. If the opponent carries a Snivy or Pawniard, Dewpider's teammates should first try to get rid of it before trying to set Sticky Web, as it punishes Speed reduction with its ability. Dewpider should also not try to set up Sticky Web if entry hazard removers like Vullaby and Staryu are still present, so that they can't undermine Dewpider's work to switch in the first place. Once Sticky Web is set, Dewpider should shift its focus to poking holes and fishing for burns with its Water Bubble-boosted Scald.", "moves": [["Sticky Web"], ["Scald"], ["Magic Coat"], ["Giga Drain", "Ice Beam"]], "item": [" Eviolite"], "ability": ["Water Bubble"], "nature": ["Modest"], "ev spread": [52, 0, 180, 116, 20, 140], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Physical Sticky Web", "stats": [125, 159, 185, 104, 185, 125], "type": ["Water", "Bug"], "usage": "Dewpider can work as a lead to set up Sticky Web early-game to let its teammates take advantage of the Speed reduction as early as possible, and can also reflect entry hazards from other common leads like Ferroseed and Dwebble via Magic Coat. Magic Coat should be used only when predicting a status move, as these Pokemon can also threaten Dewpider with super effective moves or remove its Eviolite in Ferroseed's case. Dewpider can also be used mid-game to switch in on Pokemon whose attacks it resists and forces out, such as Mienfoo, Mudbray, and Ponyta, or it can make use of a slow U-turn to switch in on a slower Pokemon like Spritzee or Mudbray and set up Sticky Web more easily. Dewpider should hold off on switching in to set up Sticky Web until the opponent's entry hazard removers like Defog Vullaby and Staryu or Pokemon that take advantage of Sticky Web like Snivy and Pawniard are removed, as its low Speed Stat and Stealth Rock weakness make it hard to set up Sticky Web multiple times.", "moves": [["Sticky Web"], ["Liquidation"], ["Leech Life"], ["Magic Coat"]], "item": [" Eviolite"], "ability": ["Water Bubble"], "nature": ["Adamant"], "ev spread": [52, 116, 180, 0, 20, 140], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Flying-types", "Electric-types", "Water-resistant Pokemon", "Snivy", "Rock-types", "Pawniard"], "credits": ["Written by crusty", "Quality checked by Corporal Levi, jake,  and Nineage", "Grammar checked by The Dutch Plumberjack and CryoGyro"]}