{"name": "Diglett", "forms": {"Base": {"base stats": [10, 55, 25, 35, 45, 95], "types": ["Ground"], "abilities": ["Arena Trap", "Sand Force", "Sand Veil"], "tier": ["LC"], "form": "Base"}}, "overview": "Despite poor defensive stats and mediocre offensive stats, Diglett is one of the defining Pokemon of the Little Cup metagame thanks to its ability Arena Trap, which allows it to revenge kill grounded Pokemon without giving them the option to switch out. Diglett is helped in its revenge killing by a high Speed stat, which allows it to tie for the fastest unboosted Pokemon in the metagame, and a useful offensive typing that gives it super effective STAB coverage on a wide variety of Pokemon. Its moveset is also somewhat customizable, with its movepool including options such as Sucker Punch and Sludge Bomb, allowing it to, for the most part, trap and take on whatever Pokemon its team needs removed. A wide variety of support moves are also at its disposal, allowing Diglett to support its team after trapping the Pokemon it aims to eliminate.\nHowever, Diglett's poor defensive stats leave it unable to safely switch into the Pokemon it aims to trap and susceptible to opposing priority. It is forced to choose between a Focus Sash set, which lacks power, or a Life Orb set, which has no chance of switching into battle. Even with a Life Orb, Diglett is still quite weak, as it only reaches 15 Attack. Diglett is also easily revenge killed or set up on after trapping and KOing an opposing Pokemon thanks to its mediocre stats.\n", "strategies' format": "LC", "strategies": [{"name": "Offensive Trapper", "stats": [65, 205, 86, 95, 126, 313], "type": ["Ground"], "usage": "Diglett should be used to trap and revenge kill specific Pokemon throughout a match. It should almost never be switched into attacks, due to its frailty, but instead brought in by a slow pivot or after the opponent KOes a Pokemon. Scout out opposing Pokemon that may be equipped with a Choice Scarf early on, as Pokemon such as Chinchou and Magnemite that Diglett can often trap can also surprise and outspeed it with a Choice Scarf. If a foe is equipped with a Choice Scarf, Diglett should wait until it is within range of a Sucker Punch KO before trapping it. Be aware that, even with a Life Orb, Diglett is not particularly powerful and with a Groundium Z is even less so when not using Tectonic Rage. Thus, be careful of opposing Pokemon that could come in after Diglett KOes a Pokemon and use it as setup bait, including Timburr, Snivy, and Pumpkaboo-S. If Groundium Z is run, it should be used to power up Earthquake once, when Diglett needs to provide a KO for its team that Diglett's other coverage moves cannot provide. After getting the KOs it needs, Diglett can use its high speed to get off a Memento or Stealth Rock before being KOed.", "moves": [["Earthquake"], ["Rock Slide"], ["Sucker Punch"], ["Substitute", "Memento"]], "item": [" Groundium Z", " Life Orb"], "ability": ["Arena Trap"], "nature": ["Jolly"], "ev spread": [36, 236, 0, 0, 0, 236], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Scarf", "stats": [65, 205, 86, 95, 126, 313], "type": ["Ground"], "usage": "Diglett should almost never be switched into an attack, as its terrible bulk causes it to take a lot of damage even from weak attacks. If the team does not have the option of pivots to bring Diglett in safely, make sure to use it solely as a revenge killer once a Pokemon has fainted. Try to avoid situations where Diglett can be revenge killed by opposing Diglett or Pursuit trappers such as Alolan Grimer and Pawniard, which can take advantage of Diglett being locked into Rock Slide, Beat Up, or Pursuit. As it is quite hard to scout Choice Scarf Diglett due to its already great Speed stat, try to take advantage of this when playing against Pokemon that have the ability to set up. Diglett is able to outspeed Pokemon such as Shellder, Omanyte, Vullaby, and Ponyta after their Speed boosts and can deal with them afterwards. However, Diglett is very weak and is unable to 2HKO Pokemon such as Vullaby and Shellder. Try to deal with Pokemon such as Abra and Gastly early on with Diglett, as Beat Up relies on multiple Pokemon being alive and healthy in the party. However, Memento is more beneficial to use later on in the game in order to weaken the opposing Pokemon's stats so that a setup sweeper can clean late-game. Using Memento too early can result in a wasted setup opportunity, so make sure that the sweeper you are using is able to break through the remainder of the team before using Memento. Final Gambit should be used to open a hole in the opposing team for Diglett's teammates to exploit. For example, removing a Pokemon like Foongus can open the way for a Snivy sweep. Be wary of Pokemon that can easily boost on Diglett such as opposing Snivy, as they are able to use Diglett as setup fodder regardless of which move it is locked into.", "moves": [["Earthquake"], ["Rock Slide"], ["Final Gambit", "Memento"], ["Beat Up", "Pursuit"]], "item": [" Choice Scarf"], "ability": ["Arena Trap"], "nature": ["Jolly"], "ev spread": [36, 236, 0, 0, 0, 236], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Focus Sash", "stats": [65, 205, 86, 95, 126, 313], "type": ["Ground"], "usage": "Diglett should be brought in against a Pokemon it can trap to remove it from the match. If entry hazards are up or Diglett's Focus Sash is no longer intact, it shouldn't be switched in at all, but instead saved as a revenge killer only. If Diglett's item will remain intact, it can come in safely against a Pokemon it can hit super effectively with Earthquake, take a hit with Focus Sash, and KO. Scouting for opposing Choice Scarf users is helpful, as Pokemon that Focus Sash Diglett could normally beat, such as Pawniard and Chinchou, cannot be switched into if they are equipped with a Choice Scarf. Be cautious of the fact that Diglett is not particularly strong and can become setup bait for Pokemon it doesn't hit super effectively with Earthquake. Bulkier setup sweepers, including Nasty Plot and Z-Mirror Move Vullaby variants, Scraggy, Shellder, and Snivy can be especially troubling. If Diglett's Focus Sash is intact, it can act as a last-ditch stop to setup sweepers such as Omanyte, either by KOing them or by using Memento to lower their attacking stats.", "moves": [["Earthquake"], ["Sucker Punch", "Memento"], ["Rock Slide"], ["Memento", "Reversal", "Stealth Rock"]], "item": [" Focus Sash"], "ability": ["Arena Trap"], "nature": ["Jolly"], "ev spread": [36, 236, 0, 0, 0, 236], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Flying-types", "Revenge Killers", "Grass-types", "Bulky Pokemon"], "credits": ["Written by Nineage, DBW,  and Merritt", "Quality checked by Corporal Levi, Xayah, Hilomilo, jake,  and Nineage", "Grammar checked by talkingtree, The Dutch Plumberjack,  and frostration"]}