{
    "name": "Doduo",
    "forms": {
        "Base": {
            "base stats": [
                35,
                85,
                45,
                35,
                35,
                75
            ],
            "types": [
                "Normal",
                "Flying"
            ],
            "abilities": [
                "Early Bird",
                "Run Away",
                "Tangled Feet"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Doduo's excellent Attack stat, powerful STAB moves, and good coverage options make it one of the best physical attackers in the LC metagame. It typically takes on the role of a powerful wallbreaker, using its very good Speed stat and coverage options to wear down opposing teams or to end games against slower teams. It is helped in its wallbreaking by its coverage options, which make it impossible to safely switch into. Doduo can also flip its wallbreaking set on its head and run a Choice Scarf set, which outspeeds most of the Pokemon that typically revenge kill it and can reliably clean up weakened teams late-game. However, Doduo suffers from poor defensive stats that leave it vulnerable to revenge killing and priority attacks. Furthermore, its most powerful and spammable move, Brave Bird, has significant recoil damage, which, coupled with its Stealth Rock weakness, means it tends to get worn down very fast.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Physical Attacker",
            "stats": [
                106,
                265,
                126,
                95,
                106,
                269
            ],
            "type": [
                "Normal",
                "Flying"
            ],
            "usage": "Doduo should be brought in either by a slow pivot or after a Pokemon faints, as it doesn't have the bulk to take even most resisted hits reliably. After it comes in, Doduo can spam its powerful attacks. Knock Off is a good choice early-game to wear down Doduo's checks and counters. After Pokemon that resist Flying have been worn down or picked off with Jump Kick, Doduo can spam Brave Bird to clean up opposing teams. Scouting for opposing Choice Scarf users is helpful so Doduo isn't unexpectedly outsped while attempting to attack.",
            "moves": [
                [
                    "Brave Bird"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Jump Kick"
                ],
                [
                    "Quick Attack",
                    "Return"
                ]
            ],
            "item": [
                " Berry Juice"
            ],
            "ability": [
                "Early Bird"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                236,
                0,
                0,
                0,
                236
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Choice Scarf",
            "stats": [
                106,
                265,
                126,
                95,
                106,
                269
            ],
            "type": [
                "Normal",
                "Flying"
            ],
            "usage": "Use this set as a revenge killer or a late-game cleaner. Avoid switching Doduo into attacks, as it has poor bulk and already is worn down quickly due to its reliance on Brave Bird to clean opposing teams. Once it is in, Doduo can spam its powerful Brave Bird, or, if Rock-type checks have yet to be weakened, lure them in and KO or weaken them with Knock Off or Jump Kick. If Doduo is attempting to clean late-game, be wary of Brave Bird recoil damage, and lock Doduo into Return if possible.",
            "moves": [
                [
                    "Brave Bird"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Jump Kick"
                ],
                [
                    "Return",
                    "Quick Attack"
                ]
            ],
            "item": [
                " Choice Scarf"
            ],
            "ability": [
                "Early Bird"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                236,
                0,
                0,
                0,
                236
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Revenge Killers",
        "Rock-types",
        "Electric-types"
    ],
    "credits": [
        "Written by Nineage",
        "Quality checked by Rowan, himeringo,  and Corporal Levi",
        "Grammar checked by The Dutch Plumberjack and CryoGyro"
    ]
}