{
    "name": "Drampa",
    "forms": {
        "Base": {
            "base stats": [
                78,
                60,
                85,
                135,
                91,
                36
            ],
            "types": [
                "Normal",
                "Dragon"
            ],
            "abilities": [
                "Berserk",
                "Cloud Nine",
                "Sap Sipper"
            ],
            "tier": [
                "PU"
            ],
            "form": "Base"
        }
    },
    "overview": "Drampa's monstrous base 135 Special Attack, access to high-Base Power STAB moves, solid offensive typing, and excellent Special movepool cement its role as one of the most devastating wallbreakers in the PU metagame, with almost no safe switch-ins. Thanks to its typing and access to Sap Sipper, Drampa functions as a solid pivot into Grass-type moves from Pokemon such as Bellossom and Tangela, and it can use its somewhat decent bulk to switch into passive Pokemon like Regirock, defensive Omastar, and Qwilfish without taking much damage. Despite Drampa's exceptional offensive prowess, it is plagued with being one of the slowest Pokemon in the tier, and its typing gives it notable weaknesses to Ice-, Fairy-, and the common Fighting-type Pokemon. This, more often than not, leaves Drampa vulnerable to Pokemon such as Hitmonchan, Jynx, and Silvally-Fairy picking it off once they've been sent in.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Choice Specs",
            "stats": [
                226,
                140,
                206,
                405,
                218,
                138
            ],
            "type": [
                "Normal",
                "Dragon"
            ],
            "usage": "Drampa should look for opportunities to come in early- and mid-game to punch holes against the opposing team, as it paves the way for teammates to clean up later in the battle. Against defensive teams, Drampa is very capable of pressuring the likes of Grass-type Pokemon like Tangela and other passive Pokemon such as Lanturn, defensive Carracosta, and Sableye, as they usually can’t do much in return. Against more offensively oriented teams, it's best to try to use Drampa as a pivot against Pokemon that can’t touch it much like non-Drain Punch Eelektross and Jellicent and use that opportunity to nab a KO against the opponent's team. Unless a Pokemon is immune to Drampa's STAB moves, you're generally safe to fire them off against these types of teams, as even resisted hits will deal a significant amount of damage. While Drampa can be sent out on weaker neutral attacks and resisted hits, avoid sending it out against strong neutral attacks or super effective coverage, as that makes it much easier to wear down. After using Draco Meteor, Drampa still has enough power to take out Pokemon like Carracosta that try to take advantage of the Special Attack drops, but it should be switched out against bulkier Pokemon that can set up, like Type: Null and Gurdurr.",
            "moves": [
                [
                    "Draco Meteor"
                ],
                [
                    "Hyper Voice"
                ],
                [
                    "Fire Blast",
                    "Flamethrower"
                ],
                [
                    "Focus Blast"
                ]
            ],
            "item": [
                " Choice Specs"
            ],
            "ability": [
                "Sap Sipper"
            ],
            "nature": [
                "Modest"
            ],
            "ev spread": [
                136,
                0,
                0,
                252,
                0,
                120
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fighting-types",
        "Fairy-types",
        "Offensive Pressure"
    ],
    "credits": [
        "Written by jklioe",
        "Quality checked by Many, yogi,  and Megazard",
        "Grammar checked by Haund and P Squared"
    ]
}