{
    "name": "Ekans",
    "forms": {
        "Base": {
            "base stats": [
                35,
                60,
                44,
                40,
                54,
                55
            ],
            "types": [
                "Poison"
            ],
            "abilities": [
                "Intimidate",
                "Shed Skin",
                "Unnerve"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Ekans carves itself a niche in LC as the only viable Coil sweeper, and it has quite an offensive presence after Coil boosts. Its expansive movepool includes many coverage moves like Earthquake and Sucker Punch to hit specific threats as well as utility options like Glare, and its typing grants it resistances to common Fighting-type moves as well as Fairy- and Poison-type moves, allowing it to check Pokemon like Timburr, Mienfoo, Spritzee, and Foongus. Furthermore, Ekans has great abilities in Intimidate, which lowers the foe's Attack, and Shed Skin, which can cure Ekans of status, easing its setup opportunities. These traits allow it to function well on offensive teams. Unfortunately, Ekans is fairly weak without Coil boosts, meaning it is easily played around. Ekans's main STAB move, Gunk Shot, has very low PP, so it has to worry about that when sweeping. Its typing leaves it vulnerable to common Ground-types like Diglett, which can trap and OHKO Ekans, as well as Mudbray and Onix. Ekans also is somewhat slow, so its sweeps can be stopped by fast, powerful attackers like Gastly and Abra. Lastly, Ekans faces competition from other Poison-types like Alolan Grimer and Croagunk, with the former having Poison Touch, Knock Off, and a better typing and the latter having a better typing, more setup opportunities, and greater power.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Coil Sweeper",
            "stats": [
                145,
                156,
                145,
                104,
                225,
                146
            ],
            "type": [
                "Poison"
            ],
            "usage": "It is best for Ekans to be used as a mid- or late-game sweeper when its checks have been weakened or removed, such as fast, powerful attackers like Carvanha and bulky Steel- and Ground-types like Ferroseed and Mudbray. Ekans can be switched into neutral and resisted physical attacks thanks to Intimidate, but it should not switch into powerful attacks like Life Orb Pawniard's Knock Off and Magnemite's Thunderbolt. Be careful against Diglett, as it can trap Ekans and OHKO it with Earthquake, and it has a faster Sucker Punch. Also be wary against Pawniard, as if Ekans is running Intimidate, its switch into Pawniard will give it a +1 Attack boost due to Defiant. Ekans can be switched into common Fighting-types like Mienfoo and Timburr thanks to Intimidate as well as into Fairy-types like Spritzee and Cottonee due to its Poison typing. It can then proceed to set up a Coil or use Glare on a predicted switch. Gunk Shot should be used conservatively due to its low PP until all Steel-types are removed, in which case it can use it liberally when sweeping. Earthquake should be used to hit Steel-types like Pawniard when sweeping. Sucker Punch should be used to KO Gastly and Abra as well as hit faster Pokemon before Ekans goes down. Glare can be used before setting up, as the paralysis will make it easier for Ekans to sweep.",
            "moves": [
                [
                    "Coil"
                ],
                [
                    "Gunk Shot"
                ],
                [
                    "Earthquake"
                ],
                [
                    "Sucker Punch"
                ]
            ],
            "item": [
                " Berry Juice"
            ],
            "ability": [
                "Intimidate",
                "Shed Skin"
            ],
            "nature": [
                "Careful"
            ],
            "ev spread": [
                156,
                0,
                84,
                0,
                244,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Ground-types",
        "Abra and Gastly",
        "Rock-types",
        "Steel-types",
        "Physical Walls",
        "Fast and Powerful Attackers"
    ],
    "credits": [
        "Written by Fireflame479",
        "Quality checked by Hilomilo, Xayah,  and Berks",
        "Grammar checked by P Squared and The Dutch Plumberjack"
    ]
}