{"name": "Elekid", "forms": {"Base": {"base stats": [45, 63, 37, 65, 55, 95], "types": ["Electric"], "abilities": ["Static", "Vital Spirit"], "tier": ["LC"], "form": "Base"}}, "overview": "Elekid is one of the fastest Pokemon in LC, with an amazing 20 Speed as its most remarkable feature. It also has good Attack and Special Attack base stats, which can make Elekid an strong offensive presence, with good STAB moves like Thunderbolt and Volt Switch and coverage options like Psychic, Cross Chop, and Fire Punch in its arsenal. Sadly, Elekid doesn't have much going for it defensively, which means it faces competition from similar Electric-type attackers Magnemite and Chinchou. As a frail attacker, Elekid's role is straightforward, but it relies on outspeeding and KOing its foes, which it sometimes struggles with due to its decent but not stellar attacking stats, especially when facing Ground-types.\n", "strategies' format": "LC", "strategies": [{"name": "Special Attacker", "stats": [126, 145, 110, 226, 146, 313], "type": ["Electric"], "usage": "This set relies on not taking any hit, as Elekid's low bulk makes every attack dangerous, so Elekid shouldn't switch into an attacking foe. Due to its incredible Speed, Elekid can act as a revenge killer. To increase the efficacy of this set, Chinchou and Ground-types should be removed by Elekid's teammates. Chinchou, thanks to Volt Absorb, can switch into Elekid's STAB moves and recover part of its health, and many Ground-types can stomach Hidden Power Grass, as it has low power. Strong priority attackers should also be removed, as Elekid's low bulk leaves it susceptible to priority moves. Elekid should take advantage of predicted switches by using Volt Switch to gain momentum or by using Hidden Power Grass if you predict a Chinchou or Ground-type to switch in.", "moves": [["Volt Switch"], ["Thunderbolt"], ["Psychic"], ["Hidden Power Grass", "Cross Chop"]], "item": [" Life Orb"], "ability": ["Vital Spirit"], "nature": ["Timid", "Hasty"], "ev spread": [0, 0, 0, 240, 0, 236], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Chinchou", "Ground-types", "Bulky Special Pokemon", "Strong Priority"], "credits": ["Written by Altariel von Sweep", "Quality checked by Nineage, Fiend,  and Rowan", "Grammar checked by talkingtree and The Dutch Plumberjack"]}