{
    "name": "Empoleon",
    "forms": {
        "Base": {
            "base stats": [
                84,
                86,
                88,
                111,
                101,
                60
            ],
            "types": [
                "Water",
                "Steel"
            ],
            "abilities": [
                "Defiant",
                "Torrent"
            ],
            "tier": [
                "UU"
            ],
            "form": "Base"
        }
    },
    "overview": "Empoleon has access to a variety of utility options such as Defog, Stealth Rock, and Roar, enabling it to support its team in various ways. Its incredible defensive typing and natural bulk allow it to check a multitude of common threats in the tier, including Latias, Primarina, and Mega Pidgeot. Additionally, Empoleon's ability to force out these threats provides it with a ton of opportunities to either set up Stealth Rock or clear entry hazards from the field. While Empoleon faces competition as a hazard remover from Tentacruel, which has access to Toxic Spikes, its fantastic secondary Steel typing and greater mixed bulk give it an edge. However, its typing also leaves it weak to common offensive types such as Electric, Fighting, and Ground, making it easily exploited by Pokemon like Mega Manectric, Cobalion, and Krookodile. Furthermore, Empoleon lacks reliable recovery, which makes it prone to being worn down, although moves such as Protect can be run to mitigate this. Empoleon struggles to fit all of its great status options on one set, which can leave it hurting in some matchups.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "Utility",
            "stats": [
                267,
                187,
                231,
                258,
                311,
                156
            ],
            "type": [
                "Water",
                "Steel"
            ],
            "usage": "Empoleon should be used as a switch-in to threats like Latias, Primarina, Mega Pidgeot, and non-Earthquake Mega Aerodactyl. However, it must be wary of Electrium Z Latias. It should take advantage of its ability to force out these threats by clearing entry hazards from the field or setting them up. Toxic and Knock Off should be used to cripple Pokemon like Primarina or predicted Water-immune switch-ins like Jellicent and Volcanion. Avoid switching Empoleon in on a potential Scald burn or Knock Off because it will be more easily worn down without its Leftovers recovery. Protect can be used to scout for Choice Scarf users like Hydreigon and Krookodile, letting you decide whether to keep your Empoleon in to use Toxic or Scald, or switch to something that takes the incoming hit better. Roar should be used to prevent Pokemon like Latias and Suicune from setting up, but keep in mind that they can use Empoleon as setup fodder if they're the last Pokemon on the opposing team. Scald can be used very carelessly throughout the match, as it has a high chance to burn, which wears down foes and cripples physical attackers that try to switch in.",
            "moves": [
                [
                    "Scald"
                ],
                [
                    "Defog",
                    "Stealth Rock"
                ],
                [
                    "Toxic"
                ],
                [
                    "Protect",
                    "Knock Off",
                    "Roar"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Torrent"
            ],
            "nature": [
                "Calm"
            ],
            "ev spread": [
                252,
                0,
                76,
                0,
                180,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Electric-types",
        "Fighting-types",
        "Special Walls",
        "Residual Damage",
        "Bulky Setup Sweepers",
        "Strong Physical Attackers"
    ],
    "credits": [
        "Written by 1Surgeon",
        "Quality checked by Eyan, A Cake Wearing A Hat,  and Amaroq",
        "Grammar checked by The Dutch Plumberjack and CryoGyro"
    ]
}