{
    "name": "Entei",
    "forms": {
        "Base": {
            "base stats": [
                115,
                115,
                85,
                90,
                75,
                100
            ],
            "types": [
                "Fire"
            ],
            "abilities": [
                "Inner Focus",
                "Pressure"
            ],
            "tier": [
                "RUBL"
            ],
            "form": "Base"
        }
    },
    "overview": "Entei is a powerful wallbreaker that can plow through common defensive measures while still being capable of cleaning up against offensive teams when they are weakened enough. In a tier where Infernape, which is unpredictable and has a secondary Fighting typing and U-turn to limit counterplay, and Darmanitan, with access to Sheer Force to break through walls Entei could not otherwise such as Suicune and Mega Latias, roam free, Entei may appear underwhelming. However, it sets itself apart through its access to Sacred Fire, a powerful STAB move with no recoil and a 50% chance to burn a foe, and Extreme Speed, a more powerful and higher priority move than anything the competition can muster. However, due to its pure Fire typing, Entei is vulnerable to all forms of entry hazards, losing a quarter of its health to Stealth Rock alone. Additionally, due to Extreme Speed being event exclusive and forcing Entei to run an Adamant nature, its Speed leaves something to be desired as well, failing to outspeed offensive threats such as Krookodile, Venomoth, and Hydreigon. On top of that, it has a very shallow movepool, leaving it with only one viable set to run.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "Choice Band",
            "stats": [
                266,
                361,
                206,
                194,
                187,
                299
            ],
            "type": [
                "Fire"
            ],
            "usage": "Early-game, Entei should use Sacred Fire to spread burns and wear down walls, while Extreme Speed can be used for late-game cleaning by punching through the previously weakened foes. The latter can also pick off weakened foes that would otherwise outspeed Entei or resist its STAB attack. Entei often forces switches from a good portion of the tier, so one can use this to gain momentum by switching or simply denting an incoming wall. However, prediction of the opponent's plays is vital across the board, as locking Entei into the incorrect move can allow certain Pokemon to switch in where they could not otherwise, such as Mantine, which fears Stone Edge, and Scizor, which fears all Fire-type moves. U-turn or Volt Switch can be used to bring Entei in safely. With its good natural bulk, Entei can come in on resisted hits such as Scizor's Bullet Punch and Sylveon's Hyper Voice. Additionally, it can check Fairy-types such as Togekiss and Klefki in a pinch, but it must beware of Thunder Wave, as it cuts Entei's already-poor Speed even further. Also, be wary of switching unnecessarily, as entry hazards can wear Entei down quickly.",
            "moves": [
                [
                    "Sacred Fire"
                ],
                [
                    "Extreme Speed"
                ],
                [
                    "Stone Edge"
                ],
                [
                    "Flare Blitz"
                ]
            ],
            "item": [
                " Choice Band"
            ],
            "ability": [
                "Pressure"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                0,
                252,
                0,
                0,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Entry Hazards",
        "Water-types",
        "Revenge Killers",
        "Dragon-types",
        "Ground-types",
        "Rock-types",
        "Snorlax"
    ],
    "credits": [
        "Written by Nightingales",
        "Quality checked by A Cake Wearing A Hat, Bouff,  and Hilomilo",
        "Grammar checked by The Dutch Plumberjack and Eyan"
    ]
}