{
    "name": "Escavalier",
    "forms": {
        "Base": {
            "base stats": [
                70,
                135,
                105,
                60,
                105,
                20
            ],
            "types": [
                "Bug",
                "Steel"
            ],
            "abilities": [
                "Overcoat",
                "Shell Armor",
                "Swarm"
            ],
            "tier": [
                "RU"
            ],
            "form": "Base"
        }
    },
    "overview": "Escavalier is one of the best glue Pokemon in the tier, as its defensive typing and solid bulk allow it to check many common threats. Its powerful STAB moves backed by a monstrous Attack stat make it hard to switch into, and an excellent defensive typing gives it a wide range of resistances and only one weakness. Access to Pursuit allows it to damage foes that attempt to flee from it, including threats such as Swellow and Shaymin. However, sluggish base 20 Speed leaves it outpaced by almost the entire tier and often means it has to take two hits before retaliating when switching in. A massive 4x weakness to Fire causes it to be lured easily by Pokemon that it would otherwise wall and are using Fire-type coverage. No reliable recovery and susceptibility to all entry hazards also lead it to being worn down quickly.\n",
    "strategies' format": "RU",
    "strategies": [
        {
            "name": "Bulky Attacker",
            "stats": [
                239,
                350,
                246,
                140,
                297,
                76
            ],
            "type": [
                "Bug",
                "Steel"
            ],
            "usage": "Pivot Escavalier into attackers that have STAB moves it resists or easily takes, such as Rotom-C, Gardevoir, and Glalie. Beware of Fire-type coverage, as some special attackers run it to take a chunk off Escavalier's HP or KO it outright. Megahorn is an excellent STAB attack, so use it a lot, but don't risk the possibility of it missing unless necessary. Iron Head is better to confirm KOs better due to not missing and hits some targets such as Fairy-types that Megahorn misses for super effective damage, but it is generally less spammable than Megahorn. Pursuit traps Pokemon such as Gardevoir, Bronzong, and Espeon. Use it when taking out a threat is more important than getting damage on a switch-in. Pursuit can also be used to trap frail threats that aren't necessarily weak to it but will switch because they can't hurt Escavalier anyway such as Swellow. Use Protect to keep Escavalier healthy so it can check what it needs to. Protect is also good for scouting for Hidden Power Fire and Z-Moves and seeing what moves Choice-locked foes will use. Finally, keep Escavalier away from Knock Off, as losing its Leftovers greatly reduces its longevity.",
            "moves": [
                [
                    "Megahorn"
                ],
                [
                    "Iron Head"
                ],
                [
                    "Protect"
                ],
                [
                    "Pursuit",
                    "Knock Off"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Overcoat"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                252,
                52,
                0,
                0,
                204,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Choice Band",
            "stats": [
                219,
                405,
                246,
                140,
                246,
                97
            ],
            "type": [
                "Bug",
                "Steel"
            ],
            "usage": "Switch Escavalier in on resisted special attacks and fire off its strong STAB attacks. Note that this Escavalier set appreciates pivoting support more than any other, as it has less bulk and no recovery whatsoever. Use Pursuit on frail targets such as Espeon and Roserade to KO them as they flee, allowing your team more breathing room. Use Knock Off whenever a solid switch-in to Escavalier's STAB moves is present on the opponent's team, as it heavily cripples them alongside dealing decent damage.",
            "moves": [
                [
                    "Megahorn"
                ],
                [
                    "Iron Head"
                ],
                [
                    "Pursuit"
                ],
                [
                    "Knock Off",
                    "Drill Run"
                ]
            ],
            "item": [
                " Choice Band"
            ],
            "ability": [
                "Overcoat"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                172,
                252,
                0,
                0,
                0,
                84
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "RestTalk Swords Dance",
            "stats": [
                239,
                306,
                246,
                140,
                317,
                97
            ],
            "type": [
                "Bug",
                "Steel"
            ],
            "usage": "Primarily use Escavalier to set up on and break through bulky teams. Escavalier can also be used as a bulky sweeper after all its checks have been sufficiently weakened or removed. Additionally, don't be afraid to take a bit more residual damage than usual, as this set uses a recovery move. Set up versus any Pokemon that Escavalier can comfortably take the attacks of, such as resisted attackers like Shaymin and Glalie and weak support Pokemon like Florges and Bronzong. However, it is worth noting that Foul Play users such as Umbreon and Porygon2 don't make for good setup bait, as Foul Play does huge damage after Escavalier has boosted.",
            "moves": [
                [
                    "Swords Dance"
                ],
                [
                    "Megahorn"
                ],
                [
                    "Rest"
                ],
                [
                    "Sleep Talk"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Overcoat"
            ],
            "nature": [
                "Careful"
            ],
            "ev spread": [
                252,
                0,
                0,
                0,
                172,
                84
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fire-types",
        "Bulky Resistant Pokemon",
        "Fire-type Coverage"
    ],
    "credits": [
        "Written by cyanize",
        "Quality checked by Mr Aldo, Avocado,  and Rakan",
        "Grammar checked by CryoGyro and The Dutch Plumberjack"
    ]
}