{
    "name": "Exeggcute",
    "forms": {
        "Base": {
            "base stats": [
                60,
                40,
                80,
                60,
                45,
                40
            ],
            "types": [
                "Grass",
                "Psychic"
            ],
            "abilities": [
                "Chlorophyll",
                "Harvest"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Exeggcute has some potential as a support Pokemon in the LC metagame thanks to its great physical bulk and decent support movepool, which contains options such as Sleep Powder and Stun Spore. Its ability Harvest gives Exeggcute access to passive recovery when paired with an Oran Berry as long as Exeggcute is not hit by Knock Off. However, Exeggcute's typing, while not awful, leaves it vulnerable to a plethora of LC's most common attacking moves, such as U-turn, Knock Off, and Flying-type attacks. Due to its typing, Exeggcute will usually fail to check the physical attackers it aims to check because they carry a super effective coverage move. Exeggcute is further held back by poor Speed and Special Defense, which couple to make it easily taken out by special attackers. Finally, Exeggcute often relies on putting Pokemon to sleep to set up Substitute, which leaves it extremely reliant on Sleep Powder's relatively low accuracy. Due to these flaws, it is usually difficult to justify using Exeggcute over Foongus, which has a better typing, comparable bulk, and a more accurate sleep-inducing move. Exeggcute's niche lies in its good Defense stat, a resistance to common Ground-type attacks, and passive recovery.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Harvest",
            "stats": [
                165,
                104,
                246,
                166,
                146,
                160
            ],
            "type": [
                "Grass",
                "Psychic"
            ],
            "usage": "Exeggcute performs best when it comes in against Pokemon that fail to 2HKO it so that it can use its support moves before using its Oran Berry. These include bulkier Water-types such as Staryu without Ice Beam and Chinchou, Abra without Shadow Ball, Ground- and Rock- type Pokemon like Mudbray, Onix, and Drilbur, and weaker Electric-types such as Elekid. From there, Exeggcute should use its almost limitless recovery to set up Substitute, put foes to sleep, and chip away at their health from behind a Substitute. Keep in mind that Pokemon that can OHKO Exeggcute are abundant -- if an opposing Pokemon with OHKO potential is switching in, Exeggcute should put it to sleep, set up a Substitute, or simply be switched out. Under no circumstances should you allow Exeggcute to be hit by Knock Off, as not only will it deal quite a bit of damage as a super effective attack, but it will also remove Exeggcute's ability to heal itself.",
            "moves": [
                [
                    "Substitute"
                ],
                [
                    "Sleep Powder",
                    "Leech Seed"
                ],
                [
                    "Giga Drain"
                ],
                [
                    "Psychic",
                    "Hidden Power Fire",
                    "Hidden Power Fighting"
                ]
            ],
            "item": [
                " Oran Berry"
            ],
            "ability": [
                "Harvest"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                36,
                0,
                200,
                40,
                80,
                120
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Dark-types",
        "Steel-types",
        "Faster Attackers"
    ],
    "credits": [
        "Written by blizzardy and Nineage",
        "Quality checked by Corporal Levi, Coconut,  and Merritt",
        "Grammar checked by martha and P Squared"
    ]
}