{"name": "Feraligatr", "forms": {"Base": {"base stats": [85, 105, 100, 79, 83, 78], "types": ["Water"], "abilities": ["Sheer Force", "Torrent"], "tier": ["RU"], "form": "Base"}}, "overview": "Access to Sheer Force in conjunction with setup options like Dragon Dance and Agility makes Feraligatr a strong wallbreaker and sweeper. Thanks to Feraligatr's decent bulk, it can survive some hits from common faster Pokemon such as Kommo-o, Cobalion, Mega Aerodactyl, and Krookodile to set up a Dragon Dance. It also has a number of useful resistances, which gives it setup opportunities against Pokemon that can't hit it super effectively like Mega Aggron, Mega Steelix, and Infernape. Feraligatr threatens a lot of balance archetypes well because of its ability to easily break through their defensive backbone. Unfortunately, Feraligatr faces competition from Pokemon such as Crawdaunt, Primarina, and Mega Blastoise; the former two are way more threatening due to their secondary typing, while the latter has access to Rapid Spin to support its team. Crawdaunt can also viably use a Z-Move, unlike Feraligatr. A lacking Speed stat means Feraligatr can still get outsped by common Choice Scarf users such as Hydreigon and Latias, and it also gets outsped by Mega Aerodactyl, Mega Beedrill, and Mega Manectric even at +1.\n", "strategies' format": "UU", "strategies": [{"name": "Dragon Dance", "stats": [207, 309, 236, 174, 202, 280], "type": ["Water"], "usage": "Feraligatr doesn't want to be chipped, so avoid unnecessarily bringing it in on attacks so it can stay as healthy as possible to set up and sweep late-game. If Feraligatr can be brought in early- to mid-game while preserving as much HP as possible, it's better to fire off an attack and then set up later in the game. Don't try to set up with Feraligatr as long as its checks such as Alomomola, defensive Primarina, and Suicune are still healthy, unless this is more beneficial for its team. Try to get Feraligatr in on a free switch in or via a pivot like Rotom-H and Scizor to set up or just fire off a powerful attack. Pokemon that can outspeed Feraligatr when boosted such as Mega Beedrill and Mega Manectric should be removed before trying to set up and sweep.", "moves": [["Dragon Dance"], ["Liquidation"], ["Ice Punch"], ["Crunch"]], "item": [" Life Orb"], "ability": ["Sheer Force"], "nature": ["Jolly", "Adamant"], "ev spread": [4, 252, 0, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Agility", "stats": [206, 309, 237, 174, 202, 280], "type": ["Water"], "usage": "If aiming to sweep late-game, weaken or remove Feraligatr's checks and counters like Amoonguss, defensive Primarina, and Alomomola before setting up an Agility. However, if brought in early- or mid-game on Pokemon it threatens, Feraligatr can throw out powerful Sheer Force-boosted attacks to whittle its checks down for later on. Feraligatr is often forced to stomach a hit in order to set up, meaning it is preferable to keep it as healthy as possible beforehand.", "moves": [["Agility"], ["Liquidation"], ["Crunch"], ["Ice Punch"]], "item": [" Life Orb"], "ability": ["Sheer Force"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Water-types", "Faster Pokemon", "Electric-types", "Quagsire", "Grass-types"], "credits": ["Written by Jordy and Pak", "Earlier versions by Killintime", "Quality checked by Bouff, Hilomilo, Eyan, Amaroq,  and Kreme", "Grammar checked by P Squared, martha,  and The Dutch Plumberjack"]}