{
    "name": "Ferroseed",
    "forms": {
        "Base": {
            "base stats": [
                44,
                50,
                91,
                24,
                86,
                10
            ],
            "types": [
                "Grass",
                "Steel"
            ],
            "abilities": [
                "Iron Barbs"
            ],
            "tier": [
                "NU",
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Ferroseed boasts itself as a very adept entry hazard setter thanks to its great bulk, Eviolite, and an amazing defensive typing that allows it to resist common Grass-, Fairy-, Electric-, and Water-type moves from Pokemon such as Whimsicott, Heliolisk, and Samurott. Thanks to its defensive typing, Ferroseed finds many opportunities to set up entry hazards such as Stealth Rock and Spikes. Aside from entry hazard setting moves, Ferroseed has access to a great utility movepool consisting of Leech Seed, Gyro Ball, and Protect, which perform different roles such as stalling out foes and dealing adequate damage. However, Ferroseed's defensive typing leaves it vulnerable to Fire- and Fighting-type Pokemon such as Incineroar and Hariyama as well as coverage moves from Slowking and Silvally-Steel. Ferroseed's lackluster offensive capabilities makes it setup bait to setup sweepers such as Braviary and Klinklang, especially if they have Substitute to protect themselves from Ferroseed's utility moves and Gyro Ball.\n",
    "strategies' format": "NU",
    "strategies": [
        {
            "name": "Defensive Hazard Setter",
            "stats": [
                187,
                136,
                309,
                84,
                209,
                22
            ],
            "type": [
                "Grass",
                "Steel"
            ],
            "usage": "Ferroseed should generally switch into Pokemon it walls such as Dhelmise, Whimsicott, and non-Focus Blast Heliolisk to force them out and utilize the opportunity to set up entry hazards, paralyze its switch-ins, or use Leech Seed. Leech Seed should be used when Ferroseed is in need of healing or to stall physical attackers with Iron Barbs and Protect. Protect should be used to scout opposing coverage moves from the likes of Weezing and Heliolisk that otherwise pose a problem to Ferroseed. When facing a Pokemon that utilizes a Choice item, use Protect to see what move has been used. This allows Ferroseed and its teammates to make more accurate decisions accordingly; furthermore, it can take advantage of High Jump Kick users such as Medicham. If Ferroseed runs Thunder Wave, use it to cripple fast switch-ins such as Houndoom and Passimian, as this hinders their offensive capabilities and allows Ferroseed's teammates to take care of them. Ferroseed can use its defensive typing to assist its teammates, especially setup sweepers, by switching into Toxic; however, it should be extremely cautious of potential coverage moves. Knock Off is a big problem for Ferroseed and should be avoided at all costs, as the bulk provided by Eviolite is important for it to maintain its overall bulk and ability to switch in comfortably against Pokemon like Heliolisk. Lastly, Ferroseed should generally stay away from Xatu, as it can bounce back most of Ferroseed's moves such as Stealth Rock, Spikes, and Leech Seed while also threatening it with Night Shade.",
            "moves": [
                [
                    "Spikes",
                    "Stealth Rock"
                ],
                [
                    "Leech Seed"
                ],
                [
                    "Gyro Ball"
                ],
                [
                    "Protect"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Iron Barbs"
            ],
            "nature": [
                "Relaxed"
            ],
            "ev spread": [
                252,
                0,
                252,
                0,
                4,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                0
            ]
        }
    ],
    "counters": [
        "Fire-types",
        "Xatu",
        "Fighting-types",
        "Substitute Sweepers",
        "Taunt"
    ],
    "credits": [
        "Written by Conni",
        "Quality checked by allstarapology, banks,  and Blast",
        "Grammar checked by martha and Fireflame479"
    ]
}