{"name": "Finneon", "forms": {"Base": {"base stats": [49, 49, 56, 49, 61, 66], "types": ["Water"], "abilities": ["Storm Drain", "Swift Swim", "Water Veil"], "tier": ["LC"], "form": "Base"}}, "overview": "Finneon's main niche is being a Defogger that is not weak to Stealth Rock, with the ability to beat common Stealth Rock users such as Onix and Dwebble with its Water-type moves. It has U-turn to set itself apart from other Water-type entry hazard removers, which allows Finneon to pivot its teammates in and gain momentum. Finneon's good defense stats make it quite bulky, giving it more opportunities to use Defog, and its access to Scald allows it to cripple physical attackers with burns, providing even more utility. Storm Drain gives Finneon more opportunities to switch in, particularly letting it switch into Water-type attacks without taking any damage while obtaining a Special Attack boost. However, because Finneon lacks any sort of reliable recovery, it is quite easy to wear down. It is generally very passive due to its poor Special Attack stat, making it rely on Scald burns to mitigate this. It lacks a lot of coverage moves and usually goes in a pattern in move choice, leaving it predictable. Lastly, it faces competition from Staryu and Kabuto as a hazard remover due to their access to reliable recovery and greater consistency.\n", "strategies' format": "LC", "strategies": [{"name": "Defog", "stats": [145, 120, 226, 146, 186, 186], "type": ["Water"], "usage": "Finneon can lead against or switch in on opposing entry hazard setters such as Onix and Dwebble, as it is able to beat them with Scald and remove their entry hazards with Defog. Finneon can be switched in on any Water-type attack thanks to its immunity, though its lack of recovery outside of Berry Juice means it shouldn't risk to switch into most attacks and be worn down from it. It should never switch in on Chinchou, which threatens Finneon with Volt Switch, and should scout Thunderbolt on Staryu before switching in on it. Defog is best used once entry hazard setters and spinners like Onix, Kabuto, and Staryu on the opposing team are gone, as your team can keep entry hazards up without taking any chip damage by the opponent's entry hazards. However, be careful of using Defog when the opponent has a Pawniard, as its Defiant ability boosts its Attack sharply; nailing the switch-in with Hidden Power Fighting can ease the use of Defog. Finneon should use U-turn after it has cleared entry hazards, which allows it to safely bring in a teammate and provide momentum.", "moves": [["Defog"], ["Scald"], ["U-turn"], ["Hidden Power Fighting"]], "item": [" Berry Juice", " Eviolite"], "ability": ["Storm Drain"], "nature": ["Bold"], "ev spread": [44, 0, 232, 48, 112, 72], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Grass-types", "Electric-types", "Setup Sweepers"], "credits": ["Written by crusty", "Quality checked by OP, Xayah,  and Hilomilo", "Grammar checked by The Dutch Plumberjack and P Squared"]}