{
    "name": "Floatzel",
    "forms": {
        "Base": {
            "base stats": [
                85,
                105,
                55,
                85,
                50,
                115
            ],
            "types": [
                "Water"
            ],
            "abilities": [
                "Swift Swim",
                "Water Veil"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        }
    },
    "overview": "Thanks to its great Speed stat, Floatzel is able to outspeed almost the whole unboosted metagame and, in conjunction with its offensive stats, is able to pressure many offensive Pokemon such as Golurk, Lycanroc, and Alolan Dugtrio. Floatzel has access to a combination of almost unresisted coverage moves, which makes it one of the best offensive Water-types in the tier. It also has access to Taunt, which lets it annoy bulkier team builds. Swift Swim also gives it good matchup versus Pokemon like Kabutops in rain. However, Floatzel is not bulky and will be KOed by priority moves very easily, and, despite its very good Speed stat, it can still get outsped and revenge killed by common Choice Scarf users such as Primeape and Togedemaru.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Specially Offensive",
            "stats": [
                206,
                221,
                146,
                269,
                137,
                361
            ],
            "type": [
                "Water"
            ],
            "usage": "Floatzel should be brought in by double switching or with slow VoltTurn support so that it doesn't have to take a hit, as it has very lackluster bulk. Floatzel functions as a great late-game cleaner due to its great Speed tier. Floatzel should be used to revenge kill common threats such as Aggron, Lycanroc, and Alolan Raichu. Whenever Floatzel is up against Pokemon such as Musharna and Sableye it can use Taunt to prevent Musharna from setting up and Sableye from recovering or spreading status.",
            "moves": [
                [
                    "Hydro Pump"
                ],
                [
                    "Ice Beam"
                ],
                [
                    "Hidden Power Grass",
                    "Taunt"
                ],
                [
                    "Focus Blast"
                ]
            ],
            "item": [
                " Life Orb"
            ],
            "ability": [
                "Swift Swim",
                "Water Veil"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Bulk Up",
            "stats": [
                206,
                309,
                147,
                185,
                136,
                361
            ],
            "type": [
                "Water"
            ],
            "usage": "Floatzel should be used as a late-game sweeper because it will struggle to get kills without the opposing team being weakened. You should always be wary about using Floatzel's Z-Move as soon as you reveal Bulk Up because your opponent can easily pivot around it. Only bring Floatzel in when it's safe to set up with Bulk Up or to revenge kill. Aqua Jet can be used to revenge kill weakened Choice Scarf users; it also gets around Sucker Punch users. Bulk Up allows Floatzel to take more priority moves such as Mach Punch and Sucker Punch. Bluffing your Floatzel set by switching twice in a row early-game can be helpful when actually starting to set up.",
            "moves": [
                [
                    "Bulk Up"
                ],
                [
                    "Waterfall"
                ],
                [
                    "Low Kick"
                ],
                [
                    "Aqua Jet",
                    "Ice Punch"
                ]
            ],
            "item": [
                " Fightinium Z"
            ],
            "ability": [
                "Water Veil"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Bulky Water-types",
        "Electric-types",
        "Bulky Pokemon",
        "Priority Moves"
    ],
    "credits": [
        "Written by Jordy",
        "Quality checked by Megazard, yogi,  and TONE",
        "Grammar checked by Haund and The Dutch Plumberjack"
    ]
}