{
    "name": "Florges",
    "forms": {
        "Base": {
            "base stats": [
                78,
                65,
                68,
                112,
                154,
                75
            ],
            "types": [
                "Fairy"
            ],
            "abilities": [
                "Flower Veil",
                "Symbiosis"
            ],
            "tier": [
                "RU"
            ],
            "form": "Base"
        }
    },
    "overview": "Florges has a niche in the UU metagame as a defensive Fairy-type thanks to its ability to compress roles well and offer different utility compared to its main competition in Sylveon. Instant recovery in Synthesis lets Florges directly come in on what it needs to check more easily, not fearing having to wait a second turn with Wish. Having this additional moveslot lets it use options such as Hidden Power Fire effectively, giving it more versatility overall. Florges can also use Defog, letting it combine the roles of cleric and entry hazard remover into one teamslot, and it does not have the Stealth Rock weakness that can hinder Togekiss in performing both of these duties. Unfortunately, Florges's mediocre physical bulk leaves it competing with Sylveon, which takes on physical threats like Mega Aerodactyl and Infernape much more efficiently. Florges is also weaker, not having an ability to boost its damage as Sylveon does in Pixilate. Florges's low HP stat makes it a mediocre Wish passer compared to other users like Alomomola, Blissey, and Sylveon. Finally, Florges suffers from competition with other Fairy-types besides Sylveon, such as Primarina, Togekiss, and Mega Altaria, all of which bring secondary typings and much more power to teams.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "Cleric",
            "stats": [
                255,
                149,
                258,
                260,
                345,
                186
            ],
            "type": [
                "Fairy"
            ],
            "usage": "Be careful of preserving the PP of Aromatherapy. When running into a Toxic user that Florges can’t beat with Moonblast or Hidden Power Fire, such as Empoleon, Alomomola, or Blissey, it's best to save its ability to clear status and switch to a proper check instead of trying to brute force through Toxic. Florges can't threaten any Steel- or Poison-type entry hazard setters such as Mega Aggron, Cobalion, Klefki, and Tentacruel. Instead of trying to remove hazards against these threats, Florges should find time to use Defog when it forces out something that doesn't want to take a Moonblast, such as Kommo-o or Krookodile. Hidden Power Fire should mostly be used when you expect Scizor to switch in, as it is often too risky to keep Florges on the field in case Scizor uses Bullet Punch. Use Wish a lot early-game if Florges is not in dire need of healing. By using Wish as a buffer for your teammates, you can pivot into your wallbreakers more easily, knowing they will have some health restored. Florges can be overworked if it has to remove hazards and status at the same time. Assess which one being removed would be more valuable, as it often only has a chance to choose one before it faints or is forced out.",
            "moves": [
                [
                    "Moonblast"
                ],
                [
                    "Synthesis"
                ],
                [
                    "Aromatherapy"
                ],
                [
                    "Hidden Power Fire",
                    "Defog",
                    "Wish"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Symbiosis"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                252,
                0,
                252,
                0,
                4,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Steel-types",
        "Poison-types",
        "Toxic Users",
        "Strong Physical Attackers"
    ],
    "credits": [
        "Written by Sage",
        "Quality checked by martha, Nuked,  and Hilomilo",
        "Grammar checked by martha and A Cake Wearing A Hat"
    ]
}