{"name": "Foongus", "forms": {"Base": {"base stats": [69, 55, 45, 55, 55, 15], "types": ["Grass", "Poison"], "abilities": ["Effect Spore", "Regenerator"], "tier": ["LC"], "form": "Base"}}, "overview": "Thanks to its great defensive typing, Foongus makes for an excellent answer to many of the metagame's top threats, such as Timburr, Snivy, and Chinchou, being able to nullify them for the entire match thanks to its great longevity with Regenerator and Giga Drain. Once in play, Foongus can turn out to be quite a nuisance with its supportive movepool, which most notably contains Spore, and decent offensive presence. However, its only decent defensive stats leave it somewhat vulnerable to lures.\n", "strategies' format": "LC", "strategies": [{"name": "Defensive", "stats": [205, 131, 182, 146, 186, 66], "type": ["Grass", "Poison"], "usage": "Try to use Spore on something important. If Foongus is within KO range of a +1 Knock Off from Dragon Dance Scraggy, it may be worth sacrificing Foongus by continuing to use Clear Smog so that Scraggy does not come out of the bout with a Speed boost, unless you have means to deal with a boosted Scraggy. If the opponent has a Vullaby not yet on the field and you're not sure if it has Overcoat, which blocks Spore, Sludge Bomb is the safest move to use, as Vullaby does not appreciate being poisoned; however, if your team is about to be swept by a +2 Nasty Plot or Z-Mirror Move Vullaby, you can sacrifice Foongus by repeatedly using Clear Smog instead. If the opponent allows Staryu to be put to sleep with Spore, there is a good chance that they plan to immediately switch Staryu out afterwards to activate Natural Cure, so using Spore again is an option. If Doduo or Houndour directly switches into Spore, chances are it has Early Bird as its ability, so Foongus should immediately switch out to your check afterward. If a bulky Pokemon such as Skrelp, Munchlax, or Mudbray switches into Spore, it might be a RestTalk variant.", "moves": [["Spore"], ["Sludge Bomb"], ["Giga Drain"], ["Synthesis", "Hidden Power Fire", "Hidden Power Fighting"]], "item": [" Eviolite"], "ability": ["Regenerator"], "nature": ["Bold"], "ev spread": [124, 0, 160, 0, 160, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Specially Defensive RestTalk Users", "Poison- and Steel-types", "Psychic-, Fire-, Ice-, and Flying-types", "Bulletproof"], "credits": ["Written by Corporal Levi", "Quality checked by Star, macle,  and Coconut", "Grammar checked by fleurdyleurse and P Squared"]}