{"name": "Frillish", "forms": {"Base": {"base stats": [55, 40, 50, 65, 85, 40], "types": ["Water", "Ghost"], "abilities": ["Cursed Body", "Damp", "Water Absorb"], "tier": ["LC"], "form": "Base"}}, "overview": "Frillish's access to Water Spout and Trick enables it to utilize a Choice Scarf to either deal significant damage before taking a hit or cripple a defensive switch-in. Furthermore, great coverage in Ice Beam and Energy Ball allows Frillish to surprise its checks and counters. Frillish is also able to spinblock and can counter the most common spinner in LC, Staryu. It can use Will-O-Wisp to cripple physical attackers and Recover to stay healthy throughout the match so it can keep spinblocking. However, Knock Off's prevalence in LC makes it harder for Frillish to check certain Pokemon, especially Fighting-types, which usually carry this move. Additionally, Dark-types such as Vullaby and Scraggy are able to set up on Frillish. It also faces competition from Pumpkaboo-XL as a spinblocker and Staryu as a fast offensive Water-type; however, Scald gives Frillish a niche over the former, and Water Spout gives it a niche over the latter.\n", "strategies' format": "LC", "strategies": [{"name": "Tank", "stats": [205, 104, 181, 185, 225, 116], "type": ["Water", "Ghost"], "usage": "Frillish is able to counter Normal-, Fire-, and Ground-types such as Bunnelby, Larvesta, and Drilbur. Be careful trying to check Fighting-types, as many carry Knock Off, which can hurt Frillish a lot. It is usually better to use Frillish as a check as opposed to a counter, as it usually does not appreciate taking hits, but it can force out most Pokemon. Try to use Scald as often as possible, as it is able to burn checks to Frillish. Frillish can counter non-Thunderbolt Staryu, which is the most common spinner in LC. Frillish can also try to predict a Water-type move to get free recovery.", "moves": [["Scald"], ["Shadow Ball", "Hex"], ["Recover"], ["Will-O-Wisp"]], "item": [" Eviolite"], "ability": ["Water Absorb"], "nature": ["Bold"], "ev spread": [236, 0, 116, 76, 76, 0], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Scarf + Water Spout", "stats": [165, 104, 136, 225, 206, 181], "type": ["Water", "Ghost"], "usage": "Frillish can help break holes into the opposing team to allow for its teammates to clean up. Frillish can also clean up opposing teams once its checks and counters have been weakened a bit thanks to its Choice Scarf. Make sure to play around the opponent's hazard setter if they have one because hazards make Water Spout weaker. Frillish can spinblock, but it can lose a good amount of HP if it switches into an attack, which will make Water Spout weaker. Try to not directly switch into any attacks, as that will weaken Water Spout's damage.", "moves": [["Water Spout"], ["Shadow Ball", "Hydro Pump"], ["Ice Beam", "Energy Ball"], ["Trick"]], "item": [" Choice Scarf"], "ability": ["Water Absorb"], "nature": ["Timid"], "ev spread": [76, 0, 0, 236, 0, 196], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Electric-types", "Munchlax", "Grass-types", "Faster Revenge Killers", "Dark-types"], "credits": ["Written by sam-testings", "Quality checked by Rowan, Fiend,  and Xayah", "Grammar checked by P Squared and The Dutch Plumberjack"]}