{"name": "Galvantula", "forms": {"Base": {"base stats": [70, 77, 60, 97, 60, 108], "types": ["Bug", "Electric"], "abilities": ["Compound Eyes", "Swarm", "Unnerve"], "tier": ["RU"], "form": "Base"}}, "overview": "Galvantula is the strongest Sticky Web user in the RU tier and is able to threaten some common entry hazard removers like Mantine and Mandibuzz. It also sports a high Speed tier and a strong STAB combination of Thunder and Bug Buzz, allowing it to be an offensive threat to teams that rely on Grass-types to tank Electric-type moves. Its good offensive presence allows it to fit on teams that aren't fully reliant on Sticky Web as well, giving it the edge over other Sticky Web setters. However, its mediocre base 97 Special Attack means that it is reliant on Life Orb for good damage output. Furthermore, Galvantula is frail and has a mediocre defensive typing, which means it struggles to switch in safely; this frailty also makes it difficult for Galvantula to keep Sticky Web up reliably. It is also beaten by some entry hazard removers that can outlast or KO it, particularly Florges, while Choice Scarf Defog Flygon can outspeed and remove Galvantula's Sticky Webs.\n", "strategies' format": "RU", "strategies": [{"name": "Sticky Web", "stats": [176, 171, 156, 293, 157, 346], "type": ["Bug", "Electric"], "usage": "In general, it is a good idea to lead with Galvantula unless the opponent has a Pokemon that can anti-lead against it, such as Nidoqueen or Florges. In this case, it is better to find an opportunity later in the game to set up Sticky Web. Galvantula should attempt to set up Sticky Web as soon as possible to give the rest of its team an advantage. However, because of its poor bulk, Galvantula needs to come in on predicted switches or very weak attacks.", "moves": [["Sticky Web"], ["Thunder"], ["Bug Buzz"], ["Volt Switch"]], "item": [" Life Orb"], "ability": ["Compound Eyes"], "nature": ["Timid"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Type Advantage", "Bulky Offensive Pokemon", "Magic Bounce Users", "Fast Taunt Users", "Specially Defensive Walls"], "credits": ["Written by lotiasite", "Quality checked by Phantom, Avocado,  and EonX", "Grammar checked by Fireflame479 and The Dutch Plumberjack"]}