{"name": "Gastly", "forms": {"Base": {"base stats": [30, 35, 30, 100, 35, 80], "types": ["Ghost", "Poison"], "abilities": ["Levitate"], "tier": ["LC"], "form": "Base"}}, "overview": "Gastly is a fantastic Pokemon in the LC metagame thanks to its very good Speed stat, which allows it to offensively check tier titans such as fast Mienfoo and Snivy, and its top-tier Special Attack stat, which allows it to put enormous pressure on teams and reliably break down opposing walls. Its movepool leaves it with a plethora of coverage options that make it extremely difficult to switch into, and even includes reliable support moves such as Will-O-Wisp and Destiny Bond. Gastly's Ghost typing also comes with significant advantages, giving it an immunity to Fighting-type priority moves and allowing it to act as a risky spinblocker for hyper offensive teams. However, Gastly's poor defensive stats and weakness to the common Dark-type leave it prone to being taken out by anything it doesn't KO.\n", "strategies' format": "LC", "strategies": [{"name": "Life Orb", "stats": [96, 95, 96, 286, 126, 270], "type": ["Ghost", "Poison"], "usage": "This Gastly set is fairly easy to use, working as a strong wallbreaker that uses its power and coverage to break down opposing teams. Gastly should avoid taking hits as much as it can, as it has low defenses. This means that generally Gastly should only be attacking when it can KO a Pokemon, which will be often due to its power. Scouting for opposing Choice Scarf users is important early in a match to ensure that Gastly isn't taken by surprise and revenge killed. Substitute should be used against opposing Sucker Punch users to force them into mind games until Gastly can get up a free Substitute and then attack. Be cautious when playing against Pursuit users, as they can come in and prevent Gastly from switching out.", "moves": [["Shadow Ball"], ["Sludge Bomb"], ["Hidden Power Fighting", "Dazzling Gleam", "Psychic"], ["Substitute", "Destiny Bond"]], "item": [" Life Orb"], "ability": ["Levitate"], "nature": ["Timid"], "ev spread": [0, 0, 0, 200, 80, 200], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Hex", "stats": [105, 95, 105, 265, 125, 269], "type": ["Ghost", "Poison"], "usage": "Gastly should nearly always avoid switching into attacks, as most defensive Pokemon can cripple it with status moves and offensive Pokemon easily take advantage of its poor defenses. Gastly should use Will-O-Wisp to spread burns as much as possible, especially to cripple Dark-type attackers that are switching in, which allows Gastly to switch out without being KOed by Pursuit if necessary. Gastly can then use Hex or its coverage moves to act as a powerful wallbreaker. Gastly usually does not want to take even burn-weakened attacks, so stay on the attack when you know Gastly will deal significant damage. Substitute should be used to ease prediction when Gastly will force a switch, against Pokemon reliant on status moves such as Foongus, and to activate Berry Juice if Gastly needs to be at full health to take a hit. If running Disable, Gastly can use Substitute against Pokemon that rely on Knock Off or Pursuit to deal with it, especially Fighting-type Pokemon that cannot hit Gastly without Knock Off, and then Disable to gain a free turn.", "moves": [["Hex"], ["Will-O-Wisp"], ["Substitute"], ["Sludge Bomb"]], "item": [" Berry Juice"], "ability": ["Levitate"], "nature": ["Timid"], "ev spread": [36, 0, 36, 116, 76, 196], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Lure", "stats": [96, 95, 105, 285, 125, 269], "type": ["Ghost", "Poison"], "usage": "To properly utilize Twinkle Tackle, it is a good idea to try and bait in threats Gastly can KO with it, namely Timburr, Mienfoo, and Vullaby. Before doing this, however, it is usually best to scout how your opponent will react to Gastly, as Twinkle Tackle can only be used once per battle. This usually consists of checking what usually switches into Gastly and what moves said Pokemon usually uses. It's best not to attack before using Twinkle Tackle, as this would reveal that Gastly lacks a Life Orb, leading your opponent to most likely believe it is either Choice Scarf or Fairium Z. This is especially important if the opponent has something Gastly can lure in. Don't be afraid to attack afterwards, however, as Gastly can still do a lot without the element of surprise. Due to Gastly's low bulk, it is generally good to not switch Gastly into unresisted attacks, and it's preferred to get Gastly in through a U-turn or Volt Switch or after one of its teammates has fallen. Substitute should be used on a predicted switch and against Sucker Punch users to safely protect Gastly. It can also be used to avoid status from certain Pokemon such as Spore Foongus. Be sure to always avoid being in against Pursuit trappers, such as Alolan Grimer. It is also best that Gastly is only used when it can ensure a KO on a foe, as it is too frail to take nearly any damage.", "moves": [["Dazzling Gleam", "Thunder"], ["Sludge Bomb"], ["Shadow Ball"], ["Substitute", "Hidden Power Fighting"]], "item": [" Fairium Z", " Electrium Z"], "ability": ["Levitate"], "nature": ["Timid"], "ev spread": [0, 0, 36, 196, 76, 196], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Scarf", "stats": [96, 95, 105, 285, 125, 269], "type": ["Ghost", "Poison"], "usage": "This Gastly set is designed to be used as a revenge killer that acts as a safety net for hyper offensive teams that are weak to certain setup Pokemon. As such, Gastly should be used as a revenge killer preserved to handle said Pokemon, and not switched into any attacks. If it is run, Trick should be used at any point in a match when Gastly's Choice Scarf is no longer needed in order to cripple a defensive Pokemon. Be aware that Choice Scarf Gastly doesn't have the immediate offensive potential of the Life Orb set, so it is far less effective at dealing with bulky Pokemon. However, when an opposing team has been worn down, Choice Scarf Gastly can function as an effective cleanup Pokemon in the late-game.", "moves": [["Shadow Ball"], ["Sludge Bomb"], ["Thunderbolt"], ["Dazzling Gleam", "Trick", "Hidden Power Fighting"]], "item": [" Choice Scarf"], "ability": ["Levitate"], "nature": ["Timid"], "ev spread": [0, 0, 36, 196, 76, 196], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Alolan Grimer and Stunky", "Priority Moves", "Revenge Killers", "Specially Bulky Pokemon", "Bulletproof Users"], "credits": ["Written by Nineage", "Quality checked by Fiend, OP,  and Coconut", "Grammar checked by The Dutch Plumberjack and CryoGyro"]}