{
    "name": "Gible",
    "forms": {
        "Base": {
            "base stats": [
                58,
                70,
                45,
                40,
                45,
                42
            ],
            "types": [
                "Dragon",
                "Ground"
            ],
            "abilities": [
                "Rough Skin",
                "Sand Veil"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Gible fits on offensive teams that appreciate its ability to use offensive pressure to set up Stealth Rock without losing momentum. This is due to its incredible offensive typing, which gives it perfect neutral coverage with just its STAB moves and one coverage move, Fire Blast. Dragon / Ground also is a unique defensive typing, as it lets Gible resist Fire, be immune to Electric, and be hit neutrally by Grass, allowing it to check a decent range of Pokemon like Ponyta, Larvesta, and Elekid. Its ability Rough Skin punishes physical attackers that use contact moves to attack it, though Little Cup's low HP stats mean that Rough Skin does little damage. However, Gible is quite slow, so it struggles to set up Stealth Rock against a lot of foes. In addition, Fairy-types such as Spritzee and Snubbull, which Gible struggles to break through, are very common, while its weakness to Ice means that it can easily be taken down with common coverage moves such as Ice Beam on Staryu or Chinchou. It lacks reliable recovery, so it is unable to set up Stealth Rock multiple times throughout the game, especially when combined with its average bulk. Gible also faces competition from other Ground-types such as Mudbray and Drilbur, both of which are stronger while Drilbur is also faster; other Dragon-types such as Axew and Tyrunt, which have access to Dragon Dance, though Gible has a niche in its excellent neutral coverage; and other Stealth Rock setters like Ferroseed and Onix, which can set Stealth Rock up more reliably thanks to their greater bulk or better ability.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Stealth Rock",
            "stats": [
                165,
                158,
                181,
                145,
                165,
                125
            ],
            "type": [
                "Dragon",
                "Ground"
            ],
            "usage": "Gible should focus on using its offensive presence to force a switch and set up Stealth Rock. If Gible is still holding its Berry Juice, it can be used to take a hit from strong attackers like Timburr and fire off a powerful Draco Meteor. Gible can also be used as a suicide lead if your team really needs it to set Stealth Rock up, as its decent bulk allows it to usually do so after taking a hit. Since Gible's bulk is only decent and it lacks recovery outside of Berry Juice, it should usually only switch in on Pokemon it is able to check easily like Ponyta and Elekid—otherwise, it can easily be worn down. If Gible is used to check Chinchou, it should be scouted to make sure it doesn't carry Ice Beam, as that can easily OHKO Gible. Gible can come in on Pokemon that are reliant on recoil moves, such as Doduo and Darumaka, in order to wear them down even faster thanks to Rough Skin. It does need to be careful, however, as it can be significantly crippled if it switches in on Doduo's Knock Off, and very powerful moves like Rufflet's Brave Bird will OHKO it.",
            "moves": [
                [
                    "Stealth Rock"
                ],
                [
                    "Draco Meteor"
                ],
                [
                    "Earth Power"
                ],
                [
                    "Fire Blast"
                ]
            ],
            "item": [
                " Berry Juice"
            ],
            "ability": [
                "Rough Skin"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                52,
                0,
                156,
                116,
                156,
                20
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fairy-types",
        "Bronzor",
        "Revenge Killers",
        "Ice-types"
    ],
    "credits": [
        "Written by Xayah",
        "Quality checked by Corporal Levi, Hilomilo,  and OP",
        "Grammar checked by The Dutch Plumberjack and Rakan"
    ]
}