{"name": "Gliscor", "forms": {"Base": {"base stats": [75, 95, 125, 45, 75, 95], "types": ["Ground", "Flying"], "abilities": ["Hyper Cutter", "Poison Heal", "Sand Veil"], "tier": ["OU"], "form": "Base"}}, "overview": "Gliscor is a versatile Pokemon that can fulfill several roles: it can be a Stealth Rock setter, a Swords Dance sweeper, a Defog user, and even a stallbreaker. Due to its flexibility, Gliscor finds itself on many archetypes in OU, ranging from bulky offense to stall. Gliscor’s amazing defensive typing, good natural bulk, and excellent recovery through Poison Heal and Roost allow it to check prominent Pokemon like Heatran and Toxapex. However, Gliscor faces competition from other Ground-types that have a superior offensive presence, such as Landorus-T and Garchomp. Moreover, its typing also leaves it prone to prominent Pokemon like Greninja, Tapu Bulu, and Mega Latias.\n", "strategies' format": "OU", "strategies": [{"name": "Stealth Rock", "stats": [247, 226, 299, 113, 205, 286], "type": ["Ground", "Flying"], "usage": "Set up Stealth Rock early in games against Pokemon that don't threaten Gliscor or are forced out, such as Clefable without Calm Mind and Heatran, so that the opponent's Pokemon are worn down quicker; however, be wary of Ice Beam and Inferno Overdrive from each of these Pokemon, respectively. Use U-turn liberally so that Gliscor can pivot into wallbreakers often and they can decimate the opposing team. Use Roost after switching into Pokemon like Heatran so that Gliscor can check them later on in the match. Avoid staying in and using Earthquake too much with Gliscor, as it gives free momentum to Pokemon such as Choice Scarf Landorus-T and Mega Latios, but use it if need be. Most of the time, you should use U-turn when you believe a Ground-immune Pokemon such as Landorus or Mega Latios is coming in to maintain offensive pressure.", "moves": [["Stealth Rock"], ["Earthquake"], ["Toxic"], ["Roost"]], "item": [" Toxic Orb"], "ability": ["Poison Heal"], "nature": ["Jolly"], "ev spread": [244, 0, 52, 0, 76, 136], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Swords Dance", "stats": [247, 226, 299, 113, 205, 286], "type": ["Ground", "Flying"], "usage": "Ensure that Gliscor's Toxic Orb safely activates before switching it into Pokemon that can cripple it such as Lava Plume Heatran, Knock Off Mawile, or Scald Toxapex. Use Gliscor liberally early-game as a defensive check to Toxapex, Clefable, and Leftovers Heatran, as it has the staying power to easily outlast them. Gliscor can easily be overwhelmed by threats such as offensive Heatran and Mawile, so try to utilize Poison Heal in conjunction with Roost to keep it as healthy as possible throughout the game.", "moves": [["Swords Dance"], ["Roost"], ["Earthquake"], ["Facade", "Ice Fang"]], "item": [" Toxic Orb"], "ability": ["Poison Heal"], "nature": ["Jolly"], "ev spread": [244, 0, 52, 0, 76, 136], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Defog", "stats": [247, 226, 299, 113, 205, 286], "type": ["Ground", "Flying"], "usage": "Avoid bringing in Gliscor into a possible Knock Off, Scald, or Will-O-Wisp at all costs before Toxic Orb has been activated, as it risks neutering the effects of Poison Heal. Once poisoned, Gliscor can easily wall defensive hazard setters such as Toxapex, defensive Landorus-T, and Specially Defensive Heatran. Don't hesitate to bring it in versus these Pokemon, as Gliscor can force them out and use this as a free opportunity to remove entry hazards or spread status.", "moves": [["Earthquake"], ["Defog"], ["Roost"], ["Knock Off", "Toxic"]], "item": [" Toxic Orb"], "ability": ["Poison Heal"], "nature": ["Jolly"], "ev spread": [244, 0, 52, 0, 76, 136], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Ice-types and Ice Coverage:", "Offensive Water-types:", "Pokemon immune to Earthquake:", "Grass-types:"], "credits": ["Written by Indigo Plateau and LL", "Quality checked by Leo, Finchinator,  and GMars", "Grammar checked by The Dutch Plumberjack and martha"]}