{
    "name": "Golurk",
    "forms": {
        "Base": {
            "base stats": [
                89,
                124,
                80,
                55,
                80,
                55
            ],
            "types": [
                "Ground",
                "Ghost"
            ],
            "abilities": [
                "Iron Fist",
                "Klutz",
                "No Guard"
            ],
            "tier": [
                "PU"
            ],
            "form": "Base"
        }
    },
    "overview": "Golurk carves a niche in the PU tier due to its solid offensive typing, stellar Attack stat, great coverage options bolstered by Iron Fist, and immunity to moves like Rapid Spin and Volt Switch. Golurk's typing also allows it to block Fighting- and Electric-type attacks from common threats such as Primeape and Alolan Raichu. These attributes allow Golurk to pressure common entry hazard setters and removers such as Mesprit, Aggron, Regirock, Skuntank, and Hitmonchan, making it an effective user of Stealth Rock. Despite its offensive prowess, Golurk struggles to break through bulky walls such as Quagsire and Tangela. Golurk's mediocre Speed stat also leaves it outsped by common threats such as Victreebel and Rotom-F. Additionally, being weak to common types such as Ice, Grass, and Water makes revenge killing and forcing out Golurk much easier.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Stealth Rock",
            "stats": [
                215,
                381,
                196,
                131,
                196,
                209
            ],
            "type": [
                "Ground",
                "Ghost"
            ],
            "usage": "Generally, unless you predict the opponent to switch into Pokemon that are immune or resistant to Ground, Golurk should spam its STAB Earthquake or set up Stealth Rock. An effective way for Golurk to set up Stealth Rock is on passive Pokemon such as Clefairy and Regirock. Additionally, be sure to take advantage of Golurk's unique niche in spinblocking and being immune to Volt Switch by bringing it in on predicted STAB attacks from Pokemon such as Hitmonchan and Manectric. Golurk can additionally use its resistances to Rock- and Poison-type moves to switch into Pokemon like unboosted Lycanroc and Choice-locked Skuntank; however, Golurk's only passable bulk and limited recovery options means that it should switch into such Pokemon sparingly.",
            "moves": [
                [
                    "Stealth Rock"
                ],
                [
                    "Earthquake"
                ],
                [
                    "Shadow Punch"
                ],
                [
                    "Ice Punch"
                ]
            ],
            "item": [
                " Colbur Berry"
            ],
            "ability": [
                "Iron Fist"
            ],
            "nature": [
                "Adamant",
                "Jolly"
            ],
            "ev spread": [
                4,
                252,
                0,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Ground-immune Pokemon",
        "Water-types",
        "Grass-types",
        "Ice-types",
        "Strong Attackers"
    ],
    "credits": [
        "Written by TJ",
        "Quality checked by Megazard, yogi,  and TONE",
        "Grammar checked by martha and GatoDelFuego"
    ]
}