{"name": "Goodra", "forms": {"Base": {"base stats": [90, 100, 70, 110, 150, 80], "types": ["Dragon"], "abilities": ["Gooey", "Hydration", "Sap Sipper"], "tier": ["RU"], "form": "Base"}}, "overview": "Goodra's fantastic mixed offenses give it the capacity to run both Choice Band and Choice Specs sets, which makes it one of the most offensively versatile Pokemon available in the RU metagame and a fantastic wallbreaker in general. Its pure Dragon typing is quite useful, as alongside its Sap Sipper ability, it provides Goodra with key resistances to the tier's common Fire-, Water-, and Electric-type attacks and an immunity to Grass-type attacks, which give it plenty of opportunities to switch in and net KOs. Further enhancing its offensive capabilities are fantastic Special Defense and decent HP, which allow Goodra great bulk for an offensive Pokemon and the ability to tank some hits while dishing out damage, notably against the likes of powerful special attackers in Swellow, Zoroark, and even Florges. Also, Goodra can outspeed threats like Honchkrow and non-Choice Scarf Tyrantrum. However, despite its impressive offensive capabilities, Goodra sits at a rather inconvenient Speed tier that, alongside poor physical bulk, leaves it outsped by Pokemon that heavily threaten it in Flygon, Kommo-o, and Mega Glalie. Goodra also relies on either Choice Band or Choice Specs to effectively wallbreak, which means that careful prediction is required so as not to give the opponent free turns. The prevalence of both Fairy-types like Florges, Gardevoir, and Diancie and Steel-types like Registeel, Doublade, and Escavalier also troubles Goodra due to these Pokemon's ability to switch into Goodra's Choice-locked STAB attacks with ease. Other Dragon-type wallbreakers like Dragalge, Flygon, and Zygarde-10% are also a pain for Goodra, as they give it competition for a teamslot and heavily threaten it when on opposing teams. Lastly, Goodra's lack of recovery, susceptibility to entry hazards, and need to run maximum Speed investment usually keep it from reliably switching into neutral special attacks, which can at times compromise its tanking capabilities.\n", "strategies' format": "RU", "strategies": [{"name": "Choice Band", "stats": [217, 328, 176, 230, 336, 259], "type": ["Dragon"], "usage": "This set's purpose on teams is as a wallbreaker, which means that Goodra excels in supporting teammates looking to sweep late-game by exploiting holes in the opposing team. Due to Sap Sipper, Goodra should always look to switch in on Grass-type attacks from the likes of Venusaur, Roserade, and Shaymin to gain an Attack boost. From there, it can power through foes even more reliably and further limit its number of switch-ins. Special Fire-, Water-, and Electric-type attacks can also be switched into fairly easily due to Goodra's amazing Special Defense, though it should be wary of switching into Scald from defensively oriented Water-types due to the risk of being crippled with a burn. Due to the nature of Choice Band, it is important that Goodra predicts correctly when attacking. When you predict a switch into a Fairy-type that would likely switch in on Outrage, it is important to use Iron Tail to hit that Pokemon for either an OHKO or 2HKO on the switch. The same applies for using Fire Punch on Steel-types like Registeel and Escavalier.", "moves": [["Outrage"], ["Iron Tail"], ["Fire Punch", "Earthquake"], ["Power Whip"]], "item": [" Choice Band"], "ability": ["Sap Sipper"], "nature": ["Adamant", "Jolly"], "ev spread": [4, 252, 0, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Specs", "stats": [217, 212, 176, 350, 336, 259], "type": ["Dragon"], "usage": "If you wish to prevent Goodra from being locked into undesirable attacks, it is important that you consistently predict correctly throughout the match. An example of when prediction is required to effectively wallbreak is when foes resistant or immune to Draco Meteor are still healthy. If Fairy-types like Florges, Gardevoir, and Comfey are still healthy, it is important to predict their switch in and use Sludge Wave, which OHKOes or 2HKOes all of these Pokemon on the switch and prevents Goodra from giving its opponent's team free turns. When predicting switches into Steel-types like Escavalier or Registeel, it is important to use Fire Blast to hit them hard, as these threats will proceed to set up on Goodra or cripple it if it is locked into a STAB attack or Sludge Wave. Goodra's gigantic Special Defense stat allows it to act as something of a pivot by switching in and out of resisted and even neutral special attacks, which can allow it to generate momentum for its team and easily net a KO or two. Sap Sipper further increases Goodra's switch-in opportunities, and Goodra should thus take advantage of it by switching in on the likes of Venusaur, Roserade, and Shaymin to absorb their STAB attacks and score a KO. Due to its poor physical bulk, Goodra should refrain from staying in on physical attackers that it can't KO, such as Snorlax and Escavalier, or that outspeed it, such as Flygon and Durant, as even if it isn't outright OHKOed by these threats, it will still take massive damage from their attacks and either lose one-on-one or be weakened into range of a revenge kill.", "moves": [["Draco Meteor"], ["Fire Blast"], ["Thunderbolt"], ["Sludge Wave"]], "item": [" Choice Specs"], "ability": ["Sap Sipper"], "nature": ["Modest", "Timid"], "ev spread": [4, 0, 0, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fairy-types", "Steel-types", "Physical Attackers", "Faster Dragon-types", "Residual Damage"], "credits": ["Written by hilomilo", "Quality checked by Phantom, eren,  and EonX", "Grammar checked by frenzyplant and CryoGyro"]}