{"name": "Gorebyss", "forms": {"Base": {"base stats": [55, 84, 105, 114, 75, 52], "types": ["Water"], "abilities": ["Hydration", "Swift Swim"], "tier": ["Untiered"], "form": "Base"}}, "overview": "With access to Shell Smash, Gorebyss is able to serve as a decent setup sweeper and wallbreaker. Its nice base 114 Special Attack, powerful STAB move in Hydro Pump, and various coverage options such as Ice Beam, Hidden Power Grass, and Hidden Power Fire all help Gorebyss in performing its roles. However, its low Speed largely hinders Gorebyss, making it much easier for Choice Scarf users such as Primeape and Togedemaru to revenge kill it, even after a Shell Smash. If Gorebyss has taken enough damage, it can also be revenge killed by priority users such as Skuntank, Kangaskhan, and Hitmonchan. This leads to large competition from Carracosta, which has priority in Aqua Jet to make up for its low Speed, better bulk, Solid Rock, a secondary STAB move in Stone Edge, and the ability to run a mixed set, making it even harder to stop after it sets up a Shell Smash. Despite this, Gorebyss can carve itself a niche thanks to its higher Special Attack and Speed that allow it to not get stopped by certain threats to Carracosta such as Taunt Weezing. Gorebyss also faces some competition from other offensive Water-types in general, such as Floatzel and Swanna, due to their higher base Speed stats as well as Swanna's additional utility in its access to Defog and resistance to Fighting-type attacks, often allowing them to support their team better throughout the game.\n", "strategies' format": "PU", "strategies": [{"name": "Shell Smash", "stats": [146, 183, 247, 359, 186, 203], "type": ["Water"], "usage": "As a sweeper, Gorebyss can come in late-game, after its potential threats have been taken care of or at least crippled so it can ideally set up and sweep, potentially closing out the match. These threats include Choice Scarf users such as Primeape and Pyroar and bulkier Pokemon such as Lanturn and Clefairy, especially if Gorebyss is not running Waterium Z. When being used as a wallbreaker, Gorebyss should be used mid- to late-game, using its high Special Attack and the Shell Smash boosts to break down bulkier foes such as Regirock and Gourgeist-XL so that a teammate can come in and have an easier time cleaning the match afterwards. Gorebyss should be brought onto the field through a slow pivot such as Eelektross's Volt Switch or Mesprit's U-turn or a Memento user such as Alolan Dugtrio in order to maintain as much health as possible. Gorebyss should set up against Pokemon that can do little to it, such as Weezing, as they are forced out and can be used as setup fodder. If a Pokemon is Choice locked into a resisted move, such as Choice Specs Mesprit locked into Ice Beam, Gorebyss can also use it to set up a Shell Smash. However, be wary that they can do a decent amount of damage, so Gorebyss should often only use it to set up one Shell Smash at most.", "moves": [["Shell Smash"], ["Hydro Pump"], ["Ice Beam"], ["Hidden Power Grass", "Hidden Power Fire", "Substitute"]], "item": [" Waterium Z", " White Herb"], "ability": ["Swift Swim"], "nature": ["Modest", "Timid"], "ev spread": [0, 0, 4, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Choice Scarf Users", "Bulky Water-types", "Specially Defensive Pokemon", "Priority Users", "Taunt and Encore Users"], "credits": ["Written by UberSkitty", "Quality checked by yogi, g,  and Many", "Grammar checked by A Cake Wearing A Hat and The Dutch Plumberjack"]}