{
    "name": "Granbull",
    "forms": {
        "Base": {
            "base stats": [
                90,
                120,
                75,
                60,
                60,
                45
            ],
            "types": [
                "Fairy"
            ],
            "abilities": [
                "Intimidate",
                "Quick Feet",
                "Rattled"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        }
    },
    "overview": "Granbull is one of the rare Fairy-types in PU, albeit a mediocre one. However, its combination of a wide movepool, high Attack stat for a support Pokemon, solid physical bulk, and a great ability in Intimidate gives it some reason to use. Its Fairy typing allows it to both wall and take down common threats such as Hitmonchan and Gurdurr as well as the elusive Sableye and Spiritomb. One of Granbull's main selling points over other Fairy-types is its access to Earthquake, which discourages Poison- and Steel-types such as Aggron and Qwilfish from switching in. Granbull's access to utility moves such as Heal Bell and Thunder Wave also allows it to diminish potential threats for its team. Unfortunately, Granbull suffers from a low Special Defense stat, meaning Granbull can be used exclusively as a physical wall, as well as a poor base 45 Speed stat, leaving it weak to Taunt and affecting its ability to hit its threats first with an Earthquake. Its low Speed also furthers its susceptibility to special attacks. Granbull also lacks reliable recovery and relies on Leftovers or Z-Heal Bell to heal. Because of this, Granbull's role as a defensive Fairy-type is contested by Clefairy and Silvally-Fairy, with the former having better special bulk as well as access to Soft-Boiled and Stealth Rock and the latter having access to Parting Shot and Defog.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Offensive Support",
            "stats": [
                269,
                372,
                186,
                140,
                156,
                137
            ],
            "type": [
                "Fairy"
            ],
            "usage": "Granbull works best early-game as a switch-in to walls or bulky offensive Pokemon like Gurdurr, where it can get off a Heal Bell and possibly a Play Rough before the opponent switches out. If running Z-Heal Bell, it should ideally be used when Granbull is low on health and expecting the opponent to switch out to ensure maximum longevity. While Granbull can OHKO Aggron and 2HKO Qwilfish after Stealth Rock, it is otherwise unlikely and not advised without residual damage.",
            "moves": [
                [
                    "Heal Bell"
                ],
                [
                    "Thunder Wave"
                ],
                [
                    "Play Rough"
                ],
                [
                    "Earthquake"
                ]
            ],
            "item": [
                " Leftovers",
                " Normalium Z"
            ],
            "ability": [
                "Intimidate"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                212,
                252,
                0,
                0,
                0,
                44
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Poison-types",
        "Physically Defensive Pokemon",
        "Strong Special Attackers",
        "Steel-types",
        "Residual Damage"
    ],
    "credits": [
        "Written by Sir Pin",
        "Quality checked by allstarapology, UberSkitty,  and Megazard",
        "Grammar checked by The Dutch Plumberjack and Fireflame479"
    ]
}