{
    "name": "Gurdurr",
    "forms": {
        "Base": {
            "base stats": [
                85,
                105,
                85,
                40,
                50,
                40
            ],
            "types": [
                "Fighting"
            ],
            "abilities": [
                "Guts",
                "Iron Fist",
                "Sheer Force"
            ],
            "tier": [
                "PU"
            ],
            "form": "Base"
        }
    },
    "overview": "Gurdurr has just the right tools to succeed as both a Bulk Up sweeper and a defensive check to a large portion of the PU metagame. Gurdurr has great bulk that is further boosted by Eviolite, allowing it to act as a very effective blanket check to physical attackers. It has a small but very useful movepool, including recovery in Drain Punch, priority in Mach Punch, and utility in Knock Off. Also, Gurdurr's ability Guts allows it to take advantage of a plethora of defensive Pokemon in the tier that can only meaningfully damage it with status. However, Gurdurr's special bulk is subpar, so it can be easily taken advantage of by common special attackers like Mesprit. Additionally, its only form of recovery, Drain Punch, is very unreliable, so it can be worn down throughout the match. Finally, because Gurdurr is reliant on Mach Punch to deal with faster Pokemon, they can easily exploit Gurdurr, especially if they are resistant or immune to Mach Punch like Oricorio-G and Mesprit.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Bulky Attacker",
            "stats": [
                269,
                282,
                259,
                104,
                136,
                116
            ],
            "type": [
                "Fighting"
            ],
            "usage": "Gurdurr is an effective Bulk Up sweeper late-game, but should not bother setting up too early as it has many common checks which need to be weakened. Switch into Pokemon that Gurdurr checks, such as Skuntank or Lycanroc, in order to threaten them with Drain Punch or set up with Bulk Up. If you predict a switch into a Pokemon that walls Gurdurr like Qwilfish, use Knock Off because removing Black Sludge or Leftovers can help teammates wear them down more easily. Use Mach Punch to pick off weakened threats like Jynx and Dodrio, even after they've used their respective boosting move. Alternatively, after using Bulk Up, Mach Punch can be used to clean late-game once Gurdurr's checks, like Psychic- and Poison-types, have been weakened. Finally, although Gurdurr resists Dark-type moves, try not to switch into Knock Off, as Gurdurr's item is vital for it to act as a check to physical attackers.",
            "moves": [
                [
                    "Drain Punch"
                ],
                [
                    "Mach Punch"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Bulk Up"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Guts"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                252,
                44,
                212,
                0,
                0,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Psychic-types",
        "Flying-types",
        "Defensive Walls",
        "Strong Special Attackers",
        "Fairy-types"
    ],
    "credits": [
        "Written by pancake",
        "Quality checked by Anty, Megazard,  and yogi",
        "Grammar checked by Mr. Uncompetitive and Winry"
    ]
}