{
    "name": "Hariyama",
    "forms": {
        "Base": {
            "base stats": [
                144,
                120,
                60,
                40,
                60,
                50
            ],
            "types": [
                "Fighting"
            ],
            "abilities": [
                "Guts",
                "Sheer Force",
                "Thick Fat"
            ],
            "tier": [
                "NU"
            ],
            "form": "Base"
        }
    },
    "overview": "Thanks to Thick Fat and Hariyama's respectable bulk, it can serve as an effective check to both Incineroar and Mega Glalie, two of the most threatening wallbreakers in NU, as well as to other Fire- and Ice-type Pokemon like Houndoom, Magmortar, Sneasel, and non-Wood Hammer Mega Abomasnow. Additionally, thanks to Hariyama's great Attack stat, it manages to have an offensive presence while maintaining its solid bulk, allowing it to differentiate itself from other Fire- and Ice-resistant Pokemon like Miltank, Cryogonal, and Alolan Sandslash. Unfortunately, Hariyama faces heavy competition from Passimian, which is also a mono-Fighting-type, checks similar Pokemon to Hariyama offensively, can provide its team with momentum thanks to U-turn, and fits on more teams given its reliability as a Choice Scarf user. Furthermore, Hariyama faces competition as a wallbreaker from Medicham, which is stronger, is faster, and has a secondary typing in Psychic, letting it more easily deal with bulky Poison-types like Garbodor and Golbat. Hariyama fails to check many special attackers like Slowking, Whimsicott, and Vivillon even with the help of Assault Vest, making it unreliable as a catch-all special attack absorber. Hariyama's vulnerability to status like burn and poison further hampers it and forces it to rely on Rest to remain healthy, which means forgoing Assault Vest and thus failing to check strong special attackers like Sceptile, Guzzlord, and Heliolisk. Lastly, Hariyama's poor Speed tier results in it usually being forced to move after the foe, meaning it will likely take a hit or be inflicted with status before it can act.\n",
    "strategies' format": "NU",
    "strategies": [
        {
            "name": "Assault Vest",
            "stats": [
                324,
                372,
                157,
                104,
                219,
                136
            ],
            "type": [
                "Fighting"
            ],
            "usage": "This Hariyama set should primarily be used as a switch-in to threatening special attackers such as Comfey, Heliolisk, and Houndoom. Due to its lack of recovery, it is imperative to avoid letting Hariyama take too much chip damage, as it will leave Hariyama an unreliable check to specially offensive Fire- and Ice-types. Additionally, while Hariyama can switch into weak Scalds from the likes of Vaporeon and defensive Slowking, it is not advised to do so, as a burn removes any offensive presence this set hopes to have. Although Thick Fat and Hariyama's typing allow it to switch into Incineroar and Sneasel fairly effectively, it is risky to do so, as Hariyama risks losing its Assault Vest to Knock Off and thus cannot check special attackers easily. Once on the field, Close Combat is Hariyama's best move to do solid damage to whatever switches in. However, if the opponent has a Fighting-resistant or -immune Pokemon, then Knock Off is better to remove their item. Furthermore, using Close Combat too often is detrimental to Hariyama's bulk, as it lowers Hariyama's Defense and Special Defense upon each usage. Knock Off is a very easy move to repeatedly use due to the low amount of drawbacks it has. It is best used early- and mid-game to cripple switch-ins like Weezing, Vileplume, and Golbat by removing their item, making their presence less prominent late-game.",
            "moves": [
                [
                    "Close Combat"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Heavy Slam"
                ],
                [
                    "Stone Edge",
                    "Ice Punch"
                ]
            ],
            "item": [
                " Assault Vest"
            ],
            "ability": [
                "Thick Fat"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                252,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Defensive",
            "stats": [
                327,
                276,
                240,
                104,
                217,
                136
            ],
            "type": [
                "Fighting"
            ],
            "usage": "Hariyama should be switched directly into Fire- and Ice-type Pokemon such as Incineroar, Magmortar, Sneasel, and Mega Abomasnow to check them. Additionally, thanks to this set's usage of Rest, Hariyama can be switched into Scald from the likes of Vaporeon, Seismitoad, and Blastoise with less fear of a burn. Because this set is meant to function as a check to Incineroar, it is important to scout for Tectonic Rage, as it KOes Hariyama with minimal chip damage after a Swords Dance boost. Hariyama should use Close Combat against Pokemon it is super effective against like Steelix, Rhydon, and Cryogonal. However, avoid using it too repetitively, as the Defense and Special Defense drops can lead to Hariyama being overwhelmed by neutral attackers like Decidueye much more easily. If the opponent has a Ghost-, Poison-, or Psychic-type such as Rotom, Vileplume, or Slowking, Knock Off is the optimal play, as these Pokemon are very likely to switch into Hariyama to check it. If using Toxic, it is generally safe to use it often early-game to badly poison bulky Water- and Ghost-types like Vaporeon, Slowking, and Palossand. Toxic can also be used to badly poison other switch-ins like Mega Audino and Druddigon. Once Hariyama is low on health or inflicted with status, it should prioritize using Rest to become healthy. When asleep, using Sleep Talk is the best play unless a double switch is predicted.",
            "moves": [
                [
                    "Close Combat",
                    "Revenge"
                ],
                [
                    "Knock Off",
                    "Toxic"
                ],
                [
                    "Rest"
                ],
                [
                    "Sleep Talk"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Thick Fat"
            ],
            "nature": [
                "Impish"
            ],
            "ev spread": [
                12,
                0,
                252,
                0,
                244,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Poison-types",
        "Fairy-types",
        "Psychic-types",
        "Flying-types",
        "Ghost-types"
    ],
    "credits": [
        "Written by Rabia",
        "Quality checked by quziel, Eternally,  and Punchshroom",
        "Grammar checked by The Dutch Plumberjack and A Cake Wearing A Hat"
    ]
}