{"name": "Heliolisk", "forms": {"Base": {"base stats": [62, 55, 52, 109, 94, 109], "types": ["Electric", "Normal"], "abilities": ["Dry Skin", "Sand Veil", "Solar Power"], "tier": ["NU"], "form": "Base"}}, "overview": "Heliolisk is one of NU's most potent wallbreakers as a result of its stellar offensive typing, high Special Attack, and great Speed tier that allows it to outpace some of the most common Pokemon in the tier in Delphox, Decidueye, and Sigilyph. Heliolisk is also one of the tier's best offensive pivots because of its access to a strong Volt Switch, which is hard to stop due to Heliolisk's impressive coverage in moves such as Hyper Voice, Surf, and Focus Blast. Because of the aforementioned factors, Heliolisk can easily avoid most forms of direct damage and pivot out of unfavorable matchups. Due to Dry Skin, Heliolisk is able to switch into Water-type moves and regain HP, making it the tier's premier bulky Water-type exploiter. However, Heliolisk's bulk is rather poor, especially physically, which makes it harder to switch in on weaker, resisted attacks and on defensive Water-types such as Slowking due to its access to Psyshock. While Heliolisk's Speed tier is solid, it is still outsped and forced out by Pokemon such as Sneasel and Whimsicott. Heliolisk is reliant on its item for its damage output, with Choice Specs variants being locked into one move, which can lead to them being taken advantage of by Pokemon like Dhelmise and Steelix depending on which move it locks into.\n", "strategies' format": "NU", "strategies": [{"name": "All-out Attacker", "stats": [160, 131, 141, 317, 224, 348], "type": ["Electric", "Normal"], "usage": "Heliolisk is mainly a wallbreaker, although it can also clean late-game due to its high Speed and Special Attack. Due to Heliolisk's average bulk, it should never take hits when it doesn't need to, as this wears it down even faster and will prevent it from effectively breaking. The ideal ways to get Heliolisk in are after a teammate is KOed or through the use of Parting Shot, U-turn, or Volt Switch. However, Heliolisk can switch into a predicted Water-type moves from Pokemon like Vaporeon and Slowking because of Dry Skin and generate momentum with Volt Switch. Predicting Electric-immune foes to switch in and using the appropriate coverage against them is ideal, as this will allow Heliolisk to more reliably use Volt Switch mid- or late-game.", "moves": [["Volt Switch"], ["Hyper Voice"], ["Thunderbolt"], ["Surf"]], "item": [" Choice Specs"], "ability": ["Dry Skin"], "nature": ["Timid"], "ev spread": [0, 0, 4, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Specially Defensive Pokemon", "Faster Pokemon", "Priority", "Residual Damage"], "credits": ["Written by allstarapology", "Quality checked by Blast, Shadestep,  and quziel", "Grammar checked by Mr. Uncompetitive and The Dutch Plumberjack"]}