{"name": "Hippowdon", "forms": {"Base": {"base stats": [108, 112, 118, 68, 72, 47], "types": ["Ground"], "abilities": ["Sand Force", "Sand Stream"], "tier": ["UU"], "form": "Base"}}, "overview": "Hippowdon's phenomenal bulk coupled with a solid typing and access to some good support moves in Stealth Rock, Whirlwind, and Slack Off allow it to act as a really good blanket check to some common threats such as Mega Pinsir, Mega Mawile, Mega Charizard X, and Tyranitar. Sand Stream helps when it comes to dealing with rain teams and Mega Charizard Y. Unfortunately, Hippowdon's Ground typing makes it weak to Grass-, Water-, and Ice-type attacks, which are used by very common Pokemon such as Tapu Bulu, Greninja, and Weavile. Hippowdon is also very passive; it's easily shut down by Taunt and can become setup fodder if it doesn't pack Whirlwind.\n", "strategies' format": "OU", "strategies": [{"name": "Physically Defensive", "stats": [315, 260, 330, 154, 216, 130], "type": ["Ground"], "usage": "Hippowdon can function as a catch-all check for physical attackers that don't have super effective moves for it, such as Tyranitar, some Mega Mawile, and Mega Charizard X. It can also check a couple of special attackers such as some variants of Tapu Koko and Heatran. Due to its low Speed stat, Hippowdon will often move last, so be sure to keep it healthy with Slack Off to consistently check opposing Pokemon. Hippowdon can set up Stealth Rock many times throughout the match, so it doesn't need to worry about opposing entry hazard removers unless Stealth Rock being set up is necessary to win. Avoid letting Hippowdon be burned or poisoned, as it will interfere with its ability to check threats.", "moves": [["Stealth Rock"], ["Earthquake"], ["Slack Off"], ["Whirlwind"]], "item": [" Leftovers"], "ability": ["Sand Stream"], "nature": ["Impish"], "ev spread": [252, 0, 112, 0, 144, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Special Wallbreakers", "Grass-types", "Water-types", "Ice-type Attacks", "Residual Damage"], "credits": ["Written by MiyoKa", "Quality checked by DennisEG, p2,  and Gary", "Grammar checked by Winry and The Dutch Plumberjack"]}