{
    "name": "Honchkrow",
    "forms": {
        "Base": {
            "base stats": [
                100,
                125,
                52,
                105,
                52,
                71
            ],
            "types": [
                "Dark",
                "Flying"
            ],
            "abilities": [
                "Insomnia",
                "Moxie",
                "Super Luck"
            ],
            "tier": [
                "RU"
            ],
            "form": "Base"
        }
    },
    "overview": "Honchkrow's outstanding offensive typing and extremely high Attack stat allow it to feast on most of the RU metagame as one of the tier's most potent wallbreakers. Its access to a very strong STAB Sucker Punch alongside Pursuit and a fantastic coverage option in Superpower further bolsters its offensive presence. Furthermore, Honchkrow has access to an amazing ability in Moxie, which allows it to become even more threatening upon netting KOs. Honchkrow also sits at a Speed tier that, while not great, is still useful for outpacing the majority of defensive Pokemon in the metagame. However, Honchkrow is weak to Stealth Rock and has horrid defensive stats. Honchkrow also struggles in that it tends to wear itself down quickly due to the harsh recoil damage it will take from both Life Orb and Brave Bird. A lack of access to Knock Off or Crunch forces Honchkrow to use Sucker Punch and Pursuit as its Dark-type STAB attacks, which while useful, can be rather situational and reliant on proper prediction. Lastly, as mentioned before, Honchkrow sits at only a decent Speed tier, which leaves it easily revenge killed and reliant on Sucker Punch to hit fast foes.\n",
    "strategies' format": "RU",
    "strategies": [
        {
            "name": "Life Orb",
            "stats": [
                236,
                383,
                141,
                221,
                140,
                241
            ],
            "type": [
                "Dark",
                "Flying"
            ],
            "usage": "Honchkrow's best use is as a late-game cleaner, as it is most potent once its foes have been weakened enough to be picked off by either Sucker Punch or Brave Bird. Honchkrow can also be used as an early-game wallbreaker when supporting a sweeper, though this is a bit riskier given that Honchkrow won't be able to KO most foes from full health with Sucker Punch or Brave Bird. Faster Pokemon that resist Sucker Punch, such as Toxicroak, Kommo-O, and Comfey, should be removed from play before Honchkrow attempts cleaning up, as it will otherwise fail to threaten the aforementioned Pokemon before being outsped and KOed. It is also important that faster Pokemon in general are weakened a bit before Honchkrow attempts cleaning up, as most threats will just barely survive a Sucker Punch and KO Honchkrow in return. Bulky Pokemon should also be weakened, as most can tank a Brave Bird or Superpower from full health but won't take too kindly to either move after having been worn down a bit. Honchkrow is extremely frail, and as such should never be switched into any attack that is not Psychic- or Ground-type. As a result, bringing it in via pivot support or after a teammate has fainted is optimal.",
            "moves": [
                [
                    "Brave Bird"
                ],
                [
                    "Sucker Punch"
                ],
                [
                    "Pursuit"
                ],
                [
                    "Superpower"
                ]
            ],
            "item": [
                " Life Orb"
            ],
            "ability": [
                "Moxie"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Diancie",
        "Physically Bulky Pokemon",
        "Faster Dark-resistant Pokemon",
        "Residual Damage",
        "Priority"
    ],
    "credits": [
        "Written by Hilomilo",
        "Quality checked by Rakan, Avocado,  and Mr Aldo",
        "Grammar checked by Mr. Uncompetitive and CryoGyro"
    ]
}