{
    "name": "Huntail",
    "forms": {
        "Base": {
            "base stats": [
                55,
                104,
                105,
                94,
                75,
                52
            ],
            "types": [
                "Water"
            ],
            "abilities": [
                "Swift Swim",
                "Water Veil"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        }
    },
    "overview": "Huntail faces competition from other Shell Smash users in PU; Omastar and Gorebyss have access to stronger Special Attack stats and STAB moves, while Carracosta has better bulk with access to a reliable priority attack in Aqua Jet. However, Huntail's primary niche that sets it apart from the aforementioned Shell Smash users is access to Sucker Punch, which allows it to pick off faster Pokemon such as Choice Scarf Manectric. Additionally, Huntail outshines its fellow Water-types in terms of having a higher base Speed stat than Carracosta, an immunity to being burned, meaning Pokemon such as Weezing from crippling with Will-O-Wisp, and finally the ability to run mixed sets with Ice Beam, which can lure in bulky Grass-types such as Tangela and take them out. On the downside, finding setup opportunities with Huntail is difficult because it has mediocre bulk and doesn't have access to Solid Rock. Additionally, being susceptible to all form of entry hazards means that Huntail has to be preserved for late-game, since it gets worn down easily, making setup opportunities even more difficult. Also, unfortunately, even after a +2 Speed boost from Shell Smash, Huntail is easily revenge killed by faster foes such as Choice Scarf Primeape and Rotom-F, which take a +2 Sucker Punch. Furthermore, despite having Ice Beam, Huntail struggles at breaking through other Grass-type Pokemon like Ferroseed and Abomasnow. Huntail also has trouble getting past bulky Water-types, like Gastrodon, which can wall it and thus prevent a sweep. Lastly, with Kangaskhan, Skuntank, and Hitmonchan being so prevalent, vulnerability to priority is also an issue for Huntail.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Shell Smash",
            "stats": [
                146,
                337,
                246,
                225,
                167,
                203
            ],
            "type": [
                "Water"
            ],
            "usage": "Ideally, Huntail should be saved for late-game when Pokemon such as Gastrodon and Ferroseed are weakened enough for it to effectively sweep through the rest of the team. Huntail finds decent setup opportunities against defensive and passive Pokemon such as Weezing, so make sure to take advantage of that by using them as setup fodder. Additionally, try to remove any entry hazards such as Toxic Spikes before attempting to set up, as they cripple Huntail. Furthermore, Huntail should avoid setting up if Choice Scarf users such as Swanna and Manectric are at full HP because they are faster than Huntail after +2 and Huntail can't score OHKOs with Sucker Punch without prior damage; however, Huntail can be used to punch holes early-game against more offensively oriented teams if standard checks are not present.",
            "moves": [
                [
                    "Shell Smash"
                ],
                [
                    "Waterfall"
                ],
                [
                    "Sucker Punch"
                ],
                [
                    "Ice Beam"
                ]
            ],
            "item": [
                " White Herb"
            ],
            "ability": [
                "Water Veil"
            ],
            "nature": [
                "Naughty"
            ],
            "ev spread": [
                0,
                252,
                0,
                4,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Water-type Pokemon",
        "Grass-type Pokemon",
        "Choice Scarf users",
        "Priority"
    ],
    "credits": [
        "Written by TJ",
        "Quality checked by Megazard, TONE,  and yogi",
        "Grammar checked by Fireflame479 and The Dutch Plumberjack"
    ]
}