{
    "name": "Hydreigon",
    "forms": {
        "Base": {
            "base stats": [
                92,
                105,
                90,
                125,
                90,
                98
            ],
            "types": [
                "Dark",
                "Dragon"
            ],
            "abilities": [
                "Levitate"
            ],
            "tier": [
                "UU"
            ],
            "form": "Base"
        }
    },
    "overview": "Hydreigon is a decently powerful wallbreaker in the tier due to a solid Special Attack stat, a good STAB move in Dark Pulse, and great coverage options like Flash Cannon and Earth Power. Despite being a primarily offensive Pokemon, decent bulk, reliable recovery in Roost, and a unique typing allow it to check a number of Pokemon such as Heatran, Ash-Greninja before transformation, Reuniclus, and Blacephalon. Hydreigon's Speed tier, while good enough to outspeed Pokemon like Tapu Lele and Kyurem-B, unfortunately narrowly misses out on base 100s. Hydreigon is also aided by its useful ability Levitate, granting it an immunity to Spikes and Toxic Spikes, meaning it doesn't have to use Roost as much as other Pokemon and making it a more reliable switch-in to Pokemon that pair well with these entry hazards such as Reuniclus. However, Hydreigon lacks the immediate power and Speed of other offensive wallbreakers and pivots in the tier like Ash-Greninja and Mega Latios. Additionally, it can be hard to justify the use of Hydreigon on a lot of teams because of how specific its niche in the tier is.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Darkinium Z",
            "stats": [
                220,
                221,
                216,
                347,
                224,
                319
            ],
            "type": [
                "Dark",
                "Dragon"
            ],
            "usage": "Hydreigon can be used to check a number of Pokemon such as Heatran, Battle Bond Greninja, and Reuniclus due to its bulk and two immunities. However, you should be wary of switching it into Heatran and Greninja without knowing their sets, as Heatran can potentially OHKO Hydreigon with Corkscrew Crash or annoy it with Toxic, and Greninja can carry Ice Beam on Battle Bond sets or can be Protean, which Hydreigon fails to check at all. Also, if Hydreigon is needed to check something, you should make sure to keep it healthy with Roost so it can continue to do so throughout the match. Since Hydreigon is known to be a utilizer of both Choice Specs and Choice Scarf, it is reasonable for the opponent to suspect that Hydreigon could be using one of these items, so it can be valuable to bluff these sets to surprise Pokemon that could otherwise beat this set if it were locked into a move. If facing a Clefable or specially defensive Tapu Bulu, it is essential to attempt to predict them to switch in and hit them with a Flash Cannon, as otherwise Hydreigon is forced out by Moonblast or Superpower.",
            "moves": [
                [
                    "Dark Pulse"
                ],
                [
                    "Earth Power"
                ],
                [
                    "Flash Cannon"
                ],
                [
                    "Roost"
                ]
            ],
            "item": [
                " Darkinium Z"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Timid",
                "Modest"
            ],
            "ev spread": [
                0,
                0,
                0,
                244,
                32,
                232
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Chansey",
        "Fairy-types",
        "Bulky Steel-types",
        "Fighting-types",
        "Bulky Water-types",
        "Faster Pokemon"
    ],
    "credits": [
        "Written by Mellow",
        "Quality checked by Talah, lyd,  and Jordy",
        "Grammar checked by Fireflame479 and The Dutch Plumberjack"
    ]
}