{
    "name": "Kabutops",
    "forms": {
        "Base": {
            "base stats": [
                60,
                115,
                105,
                65,
                70,
                80
            ],
            "types": [
                "Rock",
                "Water"
            ],
            "abilities": [
                "Battle Armor",
                "Swift Swim",
                "Weak Armor"
            ],
            "tier": [
                "PU"
            ],
            "form": "Base"
        }
    },
    "overview": "Kabutops is a solid Choice Scarf user that has plenty of utility in checking top threats such as Oricorio-G and Froslass due to its unique combination of typing and Speed. Unlike most Choice Scarf users, it functions more as a utility revenge killer, with excellent support options such as Rapid Spin and Knock Off, and not as a check to most setup sweepers due to its mediocre base Speed. Kabutops is also notable for its role on rain teams, as its solid Speed, decent Attack, access to Swords Dance, and excellent STAB combination all make it highly suited to become one of the tier's top rain sweepers. Kabutops gets by on key resistances to Fire, Flying, Ice, and Normal, but its typing is a double-edged sword, leaving it with common weaknesses to Fighting, Ground, Electric, and Grass. This leaves it vulnerable to many coverage moves such as Kangaskhan's Earthquake and Dodrio's Jump Kick, and this can often limit its opportunities for setup or revenge killing. Additionally, outside of rain, Kabutops is prone to being revenge killed by common Choice Scarf users such as Primeape and Manectric and struggles with how common Mach Punch Hitmonchan and Gurdurr are. Ultimately, Kabutops faces a lot of competition from faster Choice Scarf users such as Dodrio, Primeape, and Swanna, which are far more capable at revenge killing, and only sets itself apart with its unique set of resistances and ability to remove entry hazards.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Choice Scarf",
            "stats": [
                156,
                329,
                247,
                149,
                176,
                284
            ],
            "type": [
                "Rock",
                "Water"
            ],
            "usage": "Choice Scarf Kabutops is best used as a pivot into offensive threats it has a type advantage against, such as Dodrio and Froslass. Kabutops will rarely be a completely safe switch-in to said threats; it cannot comfortably switch into Dodrio's Jump Kick and Froslass's Will-O-Wisp. However, with good prediction, Kabutops can limit the opponent's ability to spam moves it can switch into and keep top threats such as Stoutland on their toes. Once Kabutops has managed to come in safely, use Knock Off and Rapid Spin aggressively when possible. Taking advantage of a forced switch to remove entry hazards or cripple a switch-in such as Tangela can reap huge dividends late-game. Kabutops won't have much longevity, so make sure to keep a close tab on what it needs to accomplish in any given game and avoid risking it recklessly if, for example, it will need to stick around to remove Qwilfish's Spikes later in the match or revenge kill Calm Mind Oricorio-G. Keep in mind that all of its moves can be exploited by certain setup sweepers if Kabutops opts to lock itself into them. In particular, Rapid Spin and Knock Off allow many setup sweepers such as Lycanroc and Carracosta to set up with Swords Dance or Shell Smash practically risk-free. If your team finds itself pressured by a particular setup sweeper, make sure that Kabutops avoids locking itself into one of the moves that might give the sweeper the chance it needs to sweep your team.",
            "moves": [
                [
                    "Liquidation"
                ],
                [
                    "Stone Edge"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Rapid Spin"
                ]
            ],
            "item": [
                " Choice Scarf"
            ],
            "ability": [
                "Swift Swim"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Rain Sweeper",
            "stats": [
                156,
                361,
                247,
                149,
                176,
                259
            ],
            "type": [
                "Rock",
                "Water"
            ],
            "usage": "Swords Dance dramatically increases Kabutops's power and threat level, so try to set up with it when possible. Kabutops can set up versus many Choice item users and most defensive Pokemon, such as Stoutland Choice-locked into Return and bulky Oricorio-G, as well as on forced switches versus Pokemon like Scyther. If using Life Orb, be very careful about allowing Kabutops to take too much chip damage, or it won't be able to sweep. Kabutops should try to avoid being used until rain has been set up, as without rain Kabutops finds itself much weaker and slower. However, it may sometimes be needed to revenge kill certain threats outside of rain. Choice Scarf Aurorus in particular is a large threat that many rain teams may rely on Aqua Jet Kabutops to revenge kill. Normally Z-Moves ought to be played carefully and preserved for one specific instance, but so few Pokemon are capable of switching into a +2 Continental Crush with rain up and prevent Kabutops from grabbing a KO on the next turn that it is often fine to simply use it as soon as the opportunity prevents itself, especially since entering into a drawn-out series of predictions with your opponent about when you'll finally use the Z-Move may waste precious rain turns. The few exceptions to this include full-health Gurdurr and Unaware Quagsire.",
            "moves": [
                [
                    "Swords Dance"
                ],
                [
                    "Stone Edge"
                ],
                [
                    "Liquidation"
                ],
                [
                    "Superpower",
                    "Aqua Jet"
                ]
            ],
            "item": [
                " Rockium Z",
                " Life Orb"
            ],
            "ability": [
                "Swift Swim"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fighting-types",
        "Faster Pokemon",
        "Physically Bulky Pokemon",
        "Opposing Weather"
    ],
    "credits": [
        "Written by Megazard",
        "Quality checked by allstarapology, yogi,  and jklioe",
        "Grammar checked by The Dutch Plumberjack and A Cake Wearing A Hat"
    ]
}