{
    "name": "Kecleon",
    "forms": {
        "Base": {
            "base stats": [
                60,
                90,
                70,
                60,
                120,
                40
            ],
            "types": [
                "Normal"
            ],
            "abilities": [
                "Color Change",
                "Protean"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        }
    },
    "overview": "Due to its high special bulk and unique offensive attributes, Kecleon can make a good user of Assault Vest, able to check a majority of special attackers in the tier, including Mesprit, Pyroar, and Oricorio-G. Its Dark / Fighting coverage between Knock Off and Drain Punch can be tricky to switch into, especially with Protean giving Kecleon STAB for every move. Furthermore, Kecleon has useful priority in Shadow Sneak that can let it revenge kill threats like Jynx and Oricorio-G, and it also has access to Sucker Punch. Protean can make Kecleon difficult to play around because it can change its typing to resist or become immune to the opposing Pokemon's attacks, such as clicking Shadow Sneak in front of a Fighting-type. Unfortunately, poor physical bulk and awful Speed make Kecleon easily taken out by physical attackers like Kangaskhan and Absol. Additionally, Kecleon struggles greatly with status, and due to its only moderate Attack stat, it is easy to wall with bulkier Pokemon like Weezing and Gastrodon. While Kecleon may face competition with other Assault Vest tanks like Eelektross and Hitmonchan which offer better role compression, its unique priority and Protean coverage give it a niche.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Assault Vest",
            "stats": [
                199,
                306,
                176,
                140,
                276,
                137
            ],
            "type": [
                "Normal"
            ],
            "usage": "Kecleon should function as a special tank and switch-in to special attackers such as Mesprit and Oricorio-G throughout the game. Early-game, Kecleon should generally be used to annoy bulkier Pokemon with its Dark / Fighting coverage while tanking hits. Knock Off should be used the most to remove Pokemon's items on the switch, and Drain Punch can be used to recover small amounts of health and hit Fighting-weak Pokemon. Use Protean to your advantage, such as using Shadow Sneak in front of a Fighting-type or using Drain Punch to prevent Dark-types from being able to revenge kill Kecleon. You can even block Rapid Spin by using Shadow Sneak if necessary. Protean can easily become a disadvantage if you're not careful though, such as getting Pursuit trapped while transformed into a Ghost-type. If you're running Power-Up Punch, Kecleon should use it against weaker special attackers like Eelektross after its checks and counters have been eliminated or worn down, giving it a chance of sweeping teams. Be careful not to wear Kecleon down too much if it is needed to check special sweepers like Simisear later on in the game or revenge kill Pokemon with its priority.",
            "moves": [
                [
                    "Knock Off"
                ],
                [
                    "Drain Punch"
                ],
                [
                    "Shadow Sneak"
                ],
                [
                    "Sucker Punch",
                    "Power-Up Punch"
                ]
            ],
            "item": [
                " Assault Vest"
            ],
            "ability": [
                "Protean"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                172,
                252,
                0,
                0,
                0,
                84
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Physical Walls",
        "Physical Attackers",
        "Status"
    ],
    "credits": [
        "Written by Many",
        "Quality checked by Megazard, yogi,  and Twix",
        "Grammar checked by The Dutch Plumberjack and A Cake Wearing A Hat"
    ]
}