{
    "name": "Kingdra",
    "forms": {
        "Base": {
            "base stats": [
                75,
                95,
                95,
                95,
                95,
                85
            ],
            "types": [
                "Water",
                "Dragon"
            ],
            "abilities": [
                "Damp",
                "Sniper",
                "Swift Swim"
            ],
            "tier": [
                "NUBL"
            ],
            "form": "Base"
        }
    },
    "overview": "Kingdra's decent Speed stat in combination with Swift Swim allows it to outspeed the entire unboosted metagame, as well as most Choice Scarf users, when in the rain. This combined with a decent Special Attack stat makes it a top Swift Swim user in the metagame. Kingdra's access to a powerful secondary STAB move in Draco Meteor is a blessing, giving it the means to pressure or KO Pokemon that annoy rain teams such as Mega Venusaur and Mega Latias. Kingdra's Dragon / Water typing is also useful for checking Ash-Greninja as it is a rain attacker that isn't prone to Water Shuriken. Unfortunately, bulky Water- and Grass-types such as Toxapex, Ferrothorn, and Assault Vest Tangrowth are some of the most common defensive Pokemon in OU, meaning that Kingdra will have trouble sweeping most teams. Kingdra is also heavily dependent on rain in order to be effective, as it is relatively weak and slow for an offensive Pokemon outside of it.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Choice Specs",
            "stats": [
                187,
                203,
                226,
                317,
                226,
                269
            ],
            "type": [
                "Water",
                "Dragon"
            ],
            "usage": "One of the biggest things to keep in mind when using Kingdra is that one cannot afford to play passively. Taking full advantage of the 8 turns of rain provided by Pelipper is one of the first things that one should aim to do. Once the rain is set, aim to bring Kingdra onto the field as quickly as possible and start firing off attacks. Kingdra's decent defensive typing and serviceable bulk can help in instances such as switching into Pokemon such as Heatran or Greninja. It is also worth noting that if the opponent has a full on counter measure, such as Toxapex, Chansey, or Gastrodon, it is a smart idea to double switch out of Kingdra into another Pokemon that can pressure it.",
            "moves": [
                [
                    "Hydro Pump"
                ],
                [
                    "Surf"
                ],
                [
                    "Draco Meteor"
                ],
                [
                    "Ice Beam"
                ]
            ],
            "item": [
                " Choice Specs"
            ],
            "ability": [
                "Swift Swim"
            ],
            "nature": [
                "Modest"
            ],
            "ev spread": [
                4,
                0,
                0,
                252,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Bulky Grass-types",
        "Bulky Water-types",
        "Chansey",
        "Revenge Killers",
        "Alternative Weather Setters"
    ],
    "credits": [
        "Written by false",
        "Earlier versions by dk",
        "Quality checked by dk, Gary,  and Halcyon.",
        "Grammar checked by Winry and Eien"
    ]
}