{"name": "Klink", "forms": {"Base": {"base stats": [40, 55, 70, 45, 60, 30], "types": ["Steel"], "abilities": ["Clear Body", "Minus", "Plus"], "tier": ["LC"], "form": "Base"}}, "overview": "Klink's access to Shift Gear, which raises Speed by 2 stages and Attack by 1 stage, and Gear Grind, which gives Klink a way to break through Sturdy and Focus Sash and deal good damage, allows it to function as a good late-game sweeper. Its nice bulk backed up by a Steel typing allows it to resist Stealth Rock and nine other types as well as take a lot of attacks, making it easy to set up Shift Gear. However, Klink has a terrible movepool that leaves it walled by many common Pokemon such as Pawniard, Magnemite, and Mudbray. It has common weaknesses in Fighting, Fire, and Ground. In addition, it faces severe competition with other sweepers such as Scraggy, Corphish, and Vullaby and has trouble finding a niche in teams. It’s slow before a Shift Gear boost, leaving it easily hit by Taunt. Even after a Shift Gear, Klink’s subpar Attack doesn't make it particularly powerful, meaning that multiple boosts are required to significantly damage teams.\n", "strategies' format": "LC", "strategies": [{"name": "Shift Gear", "stats": [116, 225, 185, 113, 185, 125], "type": ["Steel"], "usage": "Klink should only start setting up Shift Gear when its counters are weakened or KOed. Knock Off support from teammates removes Eviolite from many Pokemon, which makes it a lot easier for Klink to start sweeping. Beware of setting up against Cottonee, as it can Encore Klink into Shift Gear, as well as Foongus, since it carries Spore. Klink can set up on defensive Pokemon or Pokemon that can't do much damage to it such as Spritzee and Snover.", "moves": [["Shift Gear"], ["Gear Grind"], ["Wild Charge"], ["Return"]], "item": [" Eviolite"], "ability": ["Clear Body"], "nature": ["Adamant"], "ev spread": [0, 236, 36, 0, 116, 116], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fire-types", "Fighting-types", "Ground-types", "Steel-types", "Physically Bulky Pokemon"], "credits": ["Written by crusty", "Quality checked by Hilomilo, OP,  and Xayah", "Grammar checked by CryoGyro and The Dutch Plumberjack"]}