{
    "name": "Klinklang",
    "forms": {
        "Base": {
            "base stats": [
                60,
                100,
                115,
                70,
                85,
                90
            ],
            "types": [
                "Steel"
            ],
            "abilities": [
                "Clear Body",
                "Minus",
                "Plus"
            ],
            "tier": [
                "NU"
            ],
            "form": "Base"
        }
    },
    "overview": "Klinklang is a very fearsome sweeper because of its access to Shift Gear. Its Steel typing gives it a few useful resistances, which, in conjunction with its good natural bulk, allows it to set up on many threatening Pokemon such as Garbodor, Sneasel, and Whimsicott. Unfortunately, Klinklang struggles to do anything to sturdy checks like Steelix, Silvally-Steel, and Pyukumuku, which can all hard wall Klinklang due to its lack of coverage options. While Klinklang does have a good number of resistances, it's also weak to a lot of common types such as Fire, Fighting, and Ground; however, it can work around the latter and potentially use Ground-types as setup bait with Magnet Rise.\n",
    "strategies' format": "NU",
    "strategies": [
        {
            "name": "Shift Gear",
            "stats": [
                173,
                328,
                266,
                158,
                206,
                263
            ],
            "type": [
                "Steel"
            ],
            "usage": "Try to preserve Klinklang for mid- to late-game to pull off a sweep when its checks like Incineroar, defensive Slowking, and Steelix are weakened. Early- to mid-game, it is generally a lot wiser to just attack the opponent's check so Klinklang can sweep later. Once Klinklang's checks are significantly weakened, Klinklang can start to set up with Shift Gear. Use a Z-Move if Klinklang has to avoid recoil damage from Pokemon that typically carry Rocky Helmet like Xatu or have an ability that damages the attacking Pokemon like Garbodor's and Skuntank's Aftermath and Druddigon's Rough Skin in order to stay healthy so it can potentially get another setup opportunity and stay out of range from being revenge killed by a priority move. By virtue of Klinklang's typing and natural bulk, it can pivot in on Pokemon like Whimsicott and Sneasel. Use Magnet Rise against Ground-types that will try to use their STAB moves against Klinklang. Substitute should be set up whenever predicting a status move such as Thunder Wave or Will-O-Wisp from Pokemon like Jellicent, Rotom, Druddigon, and Miltank.",
            "moves": [
                [
                    "Shift Gear"
                ],
                [
                    "Gear Grind"
                ],
                [
                    "Wild Charge",
                    "Return"
                ],
                [
                    "Magnet Rise",
                    "Substitute"
                ]
            ],
            "item": [
                " Steelium Z",
                " Electrium Z"
            ],
            "ability": [
                "Clear Body"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                68,
                252,
                0,
                0,
                0,
                188
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Bulky Water-types",
        "Fire-types",
        "Steelix",
        "Rotom",
        "Fighting-types"
    ],
    "credits": [
        "Written by Jordy",
        "Quality checked by Eternally, Disjunction,  and Hootie",
        "Grammar checked by martha and Fireflame479"
    ]
}