{"name": "Landorus", "forms": {"Base": {"base stats": [89, 125, 90, 115, 80, 101], "types": ["Ground", "Flying"], "abilities": ["Sand Force", "Sheer Force"], "tier": ["Uber"], "form": "Base"}}, "overview": "Though often overshadowed by its Therian counterpart, Incarnate Landorus is a considerable force in its own right, easily dealing with common Steel- and Fire-types courtesy of its iconically powerful Sheer Force-backed Earth Power, which is notably unaffected by both Grassy Terrain and Wide Guard, two huge problems to most Earthquake users. However, it still faces competition from special Landorus-T for a team slot; though Landorus hits much harder, it lacks the Therian forme's key selling point of Intimidate. Perhaps precisely because it lacks Intimidate, Landorus is also heavily threatened by opposing speed control and even faster foes, which can take advantage of its relative lack of bulk to quickly KO it. Landorus is also hurt by the ubiquity of Ice-type coverage attacks, a consequence of the high usage of Zygarde and Landorus-T.\n", "strategies' format": "Doubles", "strategies": [{"name": "Life Orb Attacker", "stats": [214, 257, 216, 329, 197, 331], "type": ["Ground", "Flying"], "usage": "Although Landorus's high-powered attacks are very threatening, its Speed tier and lack of general bulk put it at risk when against faster foes. Landorus is best used either early-game, to put severe dents in bulky foes to clear the way for the rest of the team, or late-game, to clean up a match once major threats to it have been removed and many bulkier foes have been put into range to be KOed by Earth Power. Despite its typing lending it immunities to both Ground- and Electric-type attacks, Landorus should not be switched in during a turn, as its mediocre bulk puts it at risk of taking heavy hits from opposing attacks; instead, Landorus is best brought in after a partner has been KOed or off the back of a slow U-turn or Volt Switch. Landorus's quadruple weakness to Ice means that it must be wary even around the Electric-types it should beat, as such foes, including Tapu Koko and Zapdos, are often either immune to Earth Power, can outspeed it and OHKO it with Hidden Power Ice, or both. Zapdos can further worsen Landorus's standing on the field speed-wise by setting up a Tailwind. Indeed, opposing speed control greatly threatens Landorus, as it prefers to move first in order to deal with threats before they can damage it; therefore, one's own speed control is key in order to allow it to continuously exert pressure on the opponent.", "moves": [["Earth Power"], ["Sludge Bomb", "Rock Slide"], ["Hidden Power Ice"], ["Protect"]], "item": [" Life Orb"], "ability": ["Sheer Force"], "nature": ["Timid"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Ice-types", "Water-types", "Tailwind and Trick Room", "Faster Pokemon"], "credits": ["Written by Level 51", "Quality checked by talkingtree and shaian", "Grammar checked by The Dutch Plumberjack and CryoGyro"]}