{"name": "Lanturn", "forms": {"Base": {"base stats": [125, 58, 58, 76, 76, 67], "types": ["Water", "Electric"], "abilities": ["Illuminate", "Volt Absorb", "Water Absorb"], "tier": ["PU"], "form": "Base"}}, "overview": "Lanturn's unique set of resistances allows it to check specially offensive Electric-, Flying-, Water-, and Fire-types like Rotom-F, Oricorio-G, Swanna, and Simisear. Its large HP stat coupled with serviceable Special Defense, which can be further augmented through the use of an Assault Vest, grants it a niche in PU as a blanket check to a large portion of the tier's special attackers. In addition to running defensive sets because of its access to support moves like Heal Bell, Lanturn can also use offensive ones thanks to its wide movepool and usable Special Attack stat, which means the Pokemon that are able to set up on or take advantage of defensive Lanturn, like Lilligant, cannot always switch into Lanturn directly. Lanturn's ability to control momentum in battles is exceptional; not only is it able to block the opponent's attempts at gaining momentum with Volt Switch thanks to its ability Volt Absorb, but its own Volt Switch in conjunction with its lower Speed stat is also an effective tool for grabbing momentum as well as bringing in frail teammates like Haunter and Jynx safely. Despite Lanturn's lower Speed stat being useful in this context, it is also harmful in certain matchups, as faster offensive Pokemon with a type advantage like Shiftry and Alolan Dugtrio are able to outspeed and OHKO Lanturn. While Lanturn sports only two weaknesses, Ground- and Grass-type coverage moves are commonplace in PU and are regularly run by Pokemon that Lanturn switches into like Omastar and Manectric. This combined with Lanturn's vulnerability to entry hazards, its lack of reliable recovery, and its lackluster Defense stat can cause Lanturn to be worn down quickly over the course of a battle. Despite these weaknesses, however, Lanturn is still an overall advantageous choice for many different team archetypes, owing to both its ability to run offensive and defensive sets and the unparalleled team support that it provides.\n", "strategies' format": "PU", "strategies": [{"name": "Assault Vest", "stats": [286, 136, 152, 254, 222, 220], "type": ["Water", "Electric"], "usage": "Given its ability to switch between its coverage moves, Assault Vest Lanturn's Volt Switch is difficult to punish by Pokemon with an immunity to Electric-type moves. If entry hazards have been set on Lanturn's side of the field, avoid using Volt Switch too often without removing them, as they can whittle away Lanturn's HP prematurely. Use Lanturn's increased bulk from Assault Vest to switch into special attackers like Alolan Raichu, Simisear, and Oricorio-E. While Scald can be used liberally, be careful when using it against Pokemon that can capitalize on burns inflicted by Lanturn. For example, Facade users like Stoutland and Pokemon with Guts like Gurdurr become more threatening when burned.", "moves": [["Scald"], ["Volt Switch"], ["Ice Beam"], ["Hidden Power Grass", "Discharge"]], "item": [" Assault Vest"], "ability": ["Volt Absorb"], "nature": ["Modest"], "ev spread": [0, 0, 0, 172, 136, 200], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Bulky Pivot", "stats": [296, 136, 207, 188, 275, 170], "type": ["Water", "Electric"], "usage": "Use Lanturn's Volt Absorb to pivot into attacks for its teammates such as Manectric's Volt Switch and Alolan Raichu's Thunderbolt and to keep Lanturn healthy throughout the match so that it can take on powerful special attackers like Jellicent and Swanna. Even with Defense investment, Lanturn's bulk should not be overestimated in light of its lack of reliable recovery; switch it out of strong physical attackers like Victreebel and Stoutland. Use Lanturn's slow Volt Switch to safely bring in frail Pokemon that cannot afford to take a hit such as Liepard, Jynx, and Kadabra. If the opponent's team includes a Pokemon with an Electric immunity like Gastrodon or Golem, it is often better to use Toxic or Scald on a predicted switch so that the opponent is unable to capitalize on Lanturn's Volt Switch. Use Heal Bell to cure Lanturn and its teammates of crippling status effects. Heal Bell's PP can be depleted easily, so be sure to conserve it during longer battles. Use Protect for an extra turn of Leftovers recovery, especially in situations where Lanturn is in danger of being 2HKOed. Additionally, Protect and Toxic can be used together to stall out Lanturn's foes. Finally, Protect is an effective tool for easing prediction against Choice-locked Pokemon and reducing the damage of incoming Z-Moves, but avoid its overuse, as this can provide the opponent with a free turn of setup.", "moves": [["Volt Switch"], ["Scald"], ["Toxic"], ["Heal Bell", "Protect"]], "item": [" Leftovers"], "ability": ["Volt Absorb"], "nature": ["Calm"], "ev spread": [40, 0, 220, 0, 248, 0], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Specs", "stats": [286, 136, 152, 276, 202, 220], "type": ["Water", "Electric"], "usage": "Lanturn's Choice Specs-boosted Volt Switch is a powerful tool for wearing down foes and keeping up momentum, but its overuse can be easily capitalized on by Ground-types like Gastrodon. The same is true of Hydro Pump, given that Pokemon with an immunity to Water-type moves like Jynx can pivot into it and use this opportunity to set up. Choice Specs Lanturn should be switched conservatively into attacks it resists, given that it lacks the bulk that its more defensive counterparts possess. Use Lanturn's powerful Hydro Pump to punish Ground-types that attempt to switch into its Volt Switch. Similarly, use Ice Beam to blast Grass-types that attempt to wall its Water- and Electric-type coverage moves. Finally, despite holding Choice Specs, Lanturn's power should not be overestimated in light of the fact that it is still unable to 2HKO specially defensive Pokemon like Clefairy, Audino, and Type: Null.", "moves": [["Hydro Pump"], ["Volt Switch"], ["Ice Beam"], ["Hidden Power Grass", "Hidden Power Fire"]], "item": [" Choice Specs"], "ability": ["Volt Absorb"], "nature": ["Modest"], "ev spread": [0, 0, 0, 252, 56, 200], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Grass-types", "Physical Wallbreakers", "Setup Sweepers", "Ground-types", "Residual Damage"], "credits": ["Written by 2xTheTap", "Quality checked by yogi, TONE,  and Megazard", "Grammar checked by frenzyplant and CryoGyro"]}