{
    "name": "Larvesta",
    "forms": {
        "Base": {
            "base stats": [
                55,
                85,
                55,
                50,
                55,
                60
            ],
            "types": [
                "Bug",
                "Fire"
            ],
            "abilities": [
                "Flame Body",
                "Swarm"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Larvesta has all the tools to be a bulky pivot. It has access to two excellent STAB moves in U-turn and Flare Blitz, allowing it to pivot and hit hard. It can utilize these moves with its good Attack stat and great ability in Flame Body, which allows it to switch in on and pressure physical attackers. It can also come in easily on threats like Mienfoo, Pawniard, Snivy, and Snubbull. Additionally, reliable recovery in Morning Sun strengthens its role and increases its longevity. However, Larvesta has a few devastating flaws; namely, it is 4x weak to Stealth Rock and Rock-type coverage, such as Diglett's Rock Slide and Mienfoo's Stone Edge. It is also weak to common types like Flying and Water. It faces competition as a physical Fire-type from Ponyta, which is faster and less weak to Stealth Rock. Larvesta needs entry hazard removal to function, as otherwise it becomes dead weight. Finally, it rests at an awkward Speed tier and is unable to outspeed many of its foes, namely Doduo and Staryu.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Bulky Pivot",
            "stats": [
                165,
                206,
                225,
                122,
                185,
                165
            ],
            "type": [
                "Bug",
                "Fire"
            ],
            "usage": "Try not to switch Larvesta in on Stealth Rock; even with Morning Sun, it struggles to stay alive for prolonged periods of time when Stealth Rock is up. Do your best to keep entry hazards out in general, as Larvesta hates stacked hazards. Larvesta switches in on physical attackers like Pawniard and Mienfoo, but be aware that this is generally a predictable move, so plan accordingly. For example, using Will-O-Wisp can catch threats like Onix and Dwebble on the switch in. Another option is to use U-turn on a predicted switch to keep the momentum on your side. Use Morning Sun to keep Larvesta healthy and get more burns spread around the opposing team, but be aware that Morning Sun has low PP. Timburr may be a physical Fighting-type, but keep Larvesta away from it, as many Timburr carry Guts, so a burn will have the opposite effect on it. Don't be afraid to hard switch instead of using U-turn, especially if you're up against a faster Flying-, Water-, or Rock-type like Staryu, Doduo, or Onix. Also, while Larvesta can easily switch in on most Fighting-types, be wary, since most of them carry Knock Off, and Larvesta really needs its Eviolite. Be careful when facing hail and sand teams, as Morning Sun will heal less.",
            "moves": [
                [
                    "Flare Blitz"
                ],
                [
                    "Morning Sun"
                ],
                [
                    "U-turn"
                ],
                [
                    "Will-O-Wisp",
                    "Wild Charge"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Flame Body"
            ],
            "nature": [
                "Impish"
            ],
            "ev spread": [
                76,
                0,
                236,
                0,
                156,
                36
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Stealth Rock",
        "Rock-type Pokemon and Coverage",
        "Water-types",
        "Flying-types",
        "Fire-types"
    ],
    "credits": [
        "Written by Gummy",
        "Quality checked by Nineage, Fiend,  and OP",
        "Grammar checked by P Squared and The Dutch Plumberjack"
    ]
}