{
    "name": "Latios",
    "forms": {
        "Base": {
            "base stats": [
                80,
                90,
                80,
                130,
                110,
                110
            ],
            "types": [
                "Dragon",
                "Psychic"
            ],
            "abilities": [
                "Levitate"
            ],
            "tier": [
                "UUBL"
            ],
            "form": "Base"
        },
        "Mega": {
            "base stats": [
                80,
                130,
                100,
                160,
                120,
                110
            ],
            "types": [
                "Dragon",
                "Psychic"
            ],
            "abilities": [
                "Levitate"
            ],
            "tier": [
                "UUBL"
            ],
            "form": "Mega"
        }
    },
    "overview": "Mega Latios's great Speed tier and offensive stats make it a premier check to several threats in the OU metagame such as Heatran, Landorus-T, and Gliscor. Moreover, its excellent offensive typing, high-powered STAB attacks, and vast range of coverage options make Mega Latios a formidable offensive threat in its own right, able to threaten defensive staples like Toxapex, Gliscor, Mega Venusaur, and Zapdos. Mega Latios also sports numerous type resistances, great bulk, and access to recovery, enabling it to act as a solid pivot into Water-, Grass-, Electric-, and Fire-type attacks. Mega Latios' higher Attack allows it to 2HKO common switch-ins to Latios with Earthquake, such as Heatran, Assault Vest Magearna, and Tyranitar after Stealth Rock and Spikes damage. Base forme Latios is also a decent pick, mostly by the same reasons of its Mega forme, but it suffers stiff competition to stand out. Despite their strengths, though, both Latios formes are threatened by common Fairy-types in the tier such as Tapu Lele, Mega Mawile, and Magearna and walled by Steel-types like Celesteela, Heatran, and Ferrothorn should Mega Latios or its base forme lack the appropriate coverage. Both formes are also troubled by faster offensive threats such as Greninja, Tapu Koko, and Mega Alakazam and are highly vulnerable to Pursuit trappers like Weavile, and on regular Latios's case, Tyranitar.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Mega Mixed Attacker",
            "stats": [
                196,
                297,
                236,
                419,
                248,
                350
            ],
            "type": [
                "Dragon",
                "Psychic"
            ],
            "usage": "Using Mega Latios is fairly straightforward. Mega Latios should stick to using the appropriate STAB move in most scenarios in order to deal as much damage as possible. However, if running it, beware of Draco Meteor's side effect, which prevents Mega Latios from spamming it. Latios should Mega evolve and use Earthquake on Magearna upon switching because it cannot be 2HKOed otherwise if the opportunity presents itself. Draco Meteor + Earthquake has a very large chance to KO Choice Band Tyranitar; however, Earthquake should still be used upon switching if possible because bulkier variants have a larger possibility to survive the combination. Mega Latios should preferably be brought in with VoltTurn support or double switches in spite of its respectable bulk in order to maximize its longevity and leave it out of range of being revenge killed by priority and faster Pokemon, but it can still be switched into Pokemon that it checks well, most commonly Heatran or Tapu Bulu.",
            "moves": [
                [
                    "Psychic"
                ],
                [
                    "Earthquake"
                ],
                [
                    "Ice Beam",
                    "Draco Meteor"
                ],
                [
                    "Recover"
                ]
            ],
            "item": [
                " Latiosite"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Naive"
            ],
            "ev spread": [
                0,
                4,
                0,
                252,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Offensive",
            "stats": [
                196,
                194,
                196,
                359,
                257,
                350
            ],
            "type": [
                "Dragon",
                "Psychic"
            ],
            "usage": "Latios is quite flexible in terms of its roles on a team, but it is best employed as an offensive supporter, using its coverage and resistances to lure in Pokemon, cover teammates, and remove entry hazards if needed. Use Latios's powerful STAB attacks to punch holes early on and make opposing Pokemon switch out. As Latios typically forces a switch into a Pokemon that resists its attacks, teammates can take advantage of this by double switching into an incoming Latios check—for example, switching to Magnezone to trap an incoming Celesteela or to a strong Ground- or Water-type on a Heatran. Avoid revealing Latios's coverage move too early, especially in situations where the foe has ample opportunity to scout; it may be better to feign lack of a certain coverage attack first to condition the opponent into keeping the lured Pokemon in later. Conversely, play Latios more aggressively against teams with few checks or little room to scout for its coverage. Against teams with Pursuit trappers, avoid unnecessarily switching Latios in. You should also be wary about using Defog if there is a Defiant user like Bisharp on the opposing team, as doing so could hand it a free Attack boost. If you decide to Defog, determine whether you have reliable counterplay should you trigger Defiant, like a Fighting-type in the back in Bisharp's case. If removing entry hazards is a high priority in a battle, decide if sacrificing Latios is worth it or if the team greatly relies upon it to check a certain threat.",
            "moves": [
                [
                    "Draco Meteor"
                ],
                [
                    "Psyshock",
                    "Psychic"
                ],
                [
                    "Recover"
                ],
                [
                    "Calm Mind",
                    "Defog"
                ]
            ],
            "item": [
                " Psychium Z",
                " Soul Dew"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fairy-types",
        "Steel-types",
        "Revenge Killers",
        "Dark-types",
        "Specially Defensive Pokemon"
    ],
    "credits": [
        "Written by LL and the OU Quality Control team",
        "Quality checked by Leo, GMars,  and Gary",
        "Grammar checked by martha and Kris"
    ]
}