{
    "name": "Leavanny",
    "forms": {
        "Base": {
            "base stats": [
                75,
                103,
                80,
                70,
                80,
                92
            ],
            "types": [
                "Bug",
                "Grass"
            ],
            "abilities": [
                "Chlorophyll",
                "Overcoat",
                "Swarm"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        }
    },
    "overview": "Due its decent Speed stat, offensive presence, and useful support moves, Leavanny stands out as the most reliable Sticky Web user in PU. Leavanny's decent Attack stat, good STAB moves, and Bug / Grass typing give it a good matchup against common Stealth Rock users in PU such as Golurk, Mesprit, Regirock, and Carracosta, and access to Knock Off lets Leavanny cripple Pokemon holding items like Eviolite and Leftovers. Leavanny also gets Magic Coat, which lets it bounce back entry hazards and status moves such as Taunt and Encore against foes like Sableye and Liepard. However, Leavanny's bad defensive typing, Stealth Rock weakness, and average bulk make it very easy to wear down, which means it can't keep up Sticky Web reliably during the match. Leavanny's typing also makes it weak to common Defoggers such as Skuntank and Swanna. Leavanny is overall a niche pick, as it lacks value outside of being a Sticky Web user.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Sticky Web",
            "stats": [
                186,
                305,
                197,
                158,
                196,
                311
            ],
            "type": [
                "Bug",
                "Grass"
            ],
            "usage": "Leavanny should be used as a lead to set up Sticky Web early on. However, if the opponent has an entry hazard remover such as Swanna or Skuntank that can't be pressured enough, you can keep Leavanny around to set Sticky Web later. Leavanny's main priority is to set Sticky Web, but in some cases it can be used offensively. If Leavanny has already set up Sticky Web and is facing a Stealth Rock or Spikes user that cannot be removed like Miltank or Ferroseed, spamming Magic Coat to at least get the hazards on your opponent's side of the field too before being KOed is a good idea.",
            "moves": [
                [
                    "Sticky Web"
                ],
                [
                    "Leaf Blade"
                ],
                [
                    "X-Scissor"
                ],
                [
                    "Knock Off",
                    "Magic Coat"
                ]
            ],
            "item": [
                " Focus Sash"
            ],
            "ability": [
                "Swarm"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Taunt",
        "Entry Hazard Removal",
        "Flying-types",
        "Fire-types"
    ],
    "credits": [
        "Written by Chrisloud1",
        "Quality checked by Megazard, yogi,  and Taskr",
        "Grammar checked by The Dutch Plumberjack and A Cake Wearing A Hat"
    ]
}