{
    "name": "Lickitung",
    "forms": {
        "Base": {
            "base stats": [
                90,
                55,
                75,
                60,
                75,
                30
            ],
            "types": [
                "Normal"
            ],
            "abilities": [
                "Cloud Nine",
                "Oblivious",
                "Own Tempo"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Lickitung can check many offensive threats in the metagame, such as Abra, Magnemite, Bellsprout, and Gastly, due to its great defensive stats. Furthermore, Lickitung's bulk combined with its access to Wish and Heal Bell make it a great support Pokemon on balanced and defensive teams. Lickitung can also use its support and status moves against Taunt users due to Oblivious. However, Lickitung's typing lacks resistances, meaning it has to rely on its raw bulk and Eviolite when switching into powerful attacks. Furthermore, Lickitung's low Speed combined with its passivity makes it struggle in such an offensive metagame and leaves it vulnerable to several offensive Pokemon in the tier. Lickitung also struggles against the common Fighting-types in the tier, such as Mienfoo and Timburr. Lastly, Lickitung faces competition from Spritzee as a Wish passer and cleric and from Munchlax as a Normal-type special wall.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Wish Support",
            "stats": [
                265,
                146,
                225,
                140,
                245,
                96
            ],
            "type": [
                "Normal"
            ],
            "usage": "Due to Eviolite combined with Lickitung's raw bulk, it can switch into most non-Fighting-type attacks relatively easily. However, Lickitung should stay away from Fighting-types, as they can KO it quickly, thus eliminating its Wish support for the rest of the match. Also, do not let Lickitung take a Knock Off, as without an Eviolite, Lickitung loses much of its bulk and cannot take on many special attackers reliably. Lickitung can become setup bait for threats such as Swords Dance Pawniard and Shell Smash Shellder, so it is best to switch out into an appropriate check if one of those Pokemon comes in. Use Wish liberally when either Lickitung or its teammates require healing. When Lickitung doesn't have to use Wish, Body Slam and Knock Off should be used to fish for paralysis and remove items.",
            "moves": [
                [
                    "Wish"
                ],
                [
                    "Protect"
                ],
                [
                    "Body Slam",
                    "Heal Bell"
                ],
                [
                    "Knock Off",
                    "Heal Bell"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Oblivious"
            ],
            "nature": [
                "Impish"
            ],
            "ev spread": [
                196,
                0,
                76,
                0,
                236,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fighting-types",
        "Knock Off",
        "Pawniard",
        "Setup Sweepers",
        "Fighting-type Coverage",
        "Defensive Rock- and Steel-types"
    ],
    "credits": [
        "Written by Fireflame479",
        "Quality checked by Xayah, Nineage,  and Rowan",
        "Grammar checked by CryoGyro and P Squared"
    ]
}