{"name": "Lopunny", "forms": {"Base": {"base stats": [65, 76, 84, 54, 96, 105], "types": ["Normal"], "abilities": ["Cute Charm", "Klutz", "Limber"], "tier": ["Untiered"], "form": "Base"}, "Mega": {"base stats": [65, 136, 94, 54, 96, 135], "types": ["Normal", "Fighting"], "abilities": ["Scrappy"], "tier": ["OU"], "form": "Mega"}}, "overview": "Mega Lopunny possesses an amazing Speed stat that lets it outpace most of the unboosted metagame, thus making it an excellent revenge killer. Furthermore, Lopunny's high-Base Power STAB moves give it perfect coverage thanks to its ability Scrappy, which, when backed up by its great Attack stat, let it pose a threat to slower offensive threats that lack the bulk to take its attacks, like Greninja and Tapu Koko. On top of that, Lopunny has access to a wide supportive movepool consisting of moves like Encore and Power-Up Punch that helps it take on bulkier Pokemon it struggles against, such as Clefable and Toxapex. Additionally, STAB Fake Out is another great asset that lets Lopunny pick off weakened Pokemon that outspeed it such as Mega Alakazam. However, Lopunny lacks the immediate power to break through some of the bulkier Pokemon in the metagame such as Mew and Toxapex, which forces it to rely on Power-Up Punch and Encore to pose a threat to defensive teams. Despite Lopunny's good matchup against offense, it can be easily overwhelmed by residual damage from entry hazards, weather conditions, and Rocky Helmet from the likes of Tornadus-T and Tank Chomp, which leaves it vulnerable to priority moves like Ash-Greninja's Water Shuriken and Weavile's Ice Shard.\n", "strategies' format": "OU", "strategies": [{"name": "All-out Attacker", "stats": [166, 371, 224, 129, 229, 405], "type": ["Normal", "Fighting"], "usage": "Mega Lopunny is a fairly straightforward Pokemon due to its perfect coverage and great offensive stats, which give it a good matchup against offensive teams that lack a bulky Pokemon to take it on. However, in matchups where the opponent does have a reliable answer like Mew, Clefable, or Toxapex, it should be played more precisely. If Lopunny is running Encore alongside Power-Up Punch, it can use a different game plan; instead of catching passive Pokemon on the switch with Power-Up Punch, it should use one of its attacks to weaken the foe and force the opponent to use a recovery move. Then, it can use Encore and lock said check into its recovery move, thus giving Lopunny free room to start boosting its Attack and either force a switch or keep setting up on the recovery-locked foe.", "moves": [["Return"], ["High Jump Kick"], ["Fake Out"], ["Ice Punch", "Quick Attack"]], "item": [" Lopunnite"], "ability": ["Limber"], "nature": ["Jolly"], "ev spread": [0, 252, 0, 0, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Physically Defensive Pokemon", "Faster Pokemon", "Residual Damage"], "credits": ["Written by Leo", "Quality checked by Gary, Subject 18,  and p2", "Grammar checked by lotiasite and P Squared"]}