{
    "name": "Magmortar",
    "forms": {
        "Base": {
            "base stats": [
                75,
                95,
                67,
                125,
                95,
                83
            ],
            "types": [
                "Fire"
            ],
            "abilities": [
                "Flame Body",
                "Vital Spirit"
            ],
            "tier": [
                "NU"
            ],
            "form": "Base"
        }
    },
    "overview": "Magmortar is a fantastic wallbreaker often capable of single-handedly dismantling defensive teams thanks to its great coverage options, its high Special Attack stat, and Taunt. Although Magmortar usually takes advantage of Z-Crystals to lure in and KO Pokemon like Audino and Vaporeon, it can choose to utilize Choice Specs to 2HKO virtually every one of its switch-ins. Magmortar also possesses decent special bulk, which lets it act as a soft check to threatening special attackers like Sceptile, Comfey, and Whimsicott. Unfortunately, Magmortar's poor physical bulk and weakness to entry hazards limit its ability to switch in repeatedly and leave it easily revenge killed by faster attackers like Aerodactyl, Choice Scarf Passimian, and Mega Glalie. Additionally, although Magmortar's Speed is fine for matchups against defensive teams, it gives Magmortar a lacking matchup against offensive ones, giving it fewer opportunities to safely wallbreak.\n",
    "strategies' format": "NU",
    "strategies": [
        {
            "name": "Z-Move",
            "stats": [
                186,
                203,
                170,
                383,
                227,
                265
            ],
            "type": [
                "Fire"
            ],
            "usage": "When trying to bring Magmortar onto the field, look to do so by switching into either resisted special attacks from the likes of Vileplume and Whimsicott or an entry hazard remover like Dhelmise or Silvally-Steel looking to clear hazards. If possible, avoid switching in when entry hazards are on Magmortar's side of the field, as they severely cut into Magmortar's longevity and lessen its ability to soft check special attacking Ice- and Grass-types like Cryogonal and Whimsicott. Magmortar's coverage should always be taken advantage of when given an opportunity to do so; therefore, when predicting a bulky Water-type to switch in, use Thunderbolt, and when predicting a Pokemon such as Audino or Gastrodon to switch in, using Focus Blast is ideal. Additionally, timing Magmortar's Z-Move usage is crucial in ensuring it can safely take out Pokemon such as Incineroar and Vaporeon. Magmortar should also look to use Taunt to prevent Pokemon like Vaporeon and Delphox from recovering health with Wish or crippling it with Toxic.",
            "moves": [
                [
                    "Fire Blast"
                ],
                [
                    "Focus Blast"
                ],
                [
                    "Thunderbolt"
                ],
                [
                    "Taunt"
                ]
            ],
            "item": [
                " Fightinium Z",
                " Electrium Z"
            ],
            "ability": [
                "Vital Spirit"
            ],
            "nature": [
                "Modest"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Choice Specs",
            "stats": [
                186,
                203,
                170,
                383,
                227,
                265
            ],
            "type": [
                "Fire"
            ],
            "usage": "Due to Choice Specs locking Magmortar into whatever move it uses, this set revolves heavily around predicting what your opponent will switch into Magmortar's attacks. For example, when predicting a bulky Water-type like Vaporeon or Assault Vest Slowking to switch in, use Thunderbolt. Since Hidden Power Grass has a very limited pool of targets, it's usually best to simply use Focus Blast to nail Seismitoad and Gastrodon unless the opponent has no other switch-in to Magmortar. Avoid bringing Magmortar in on direct attacks or when entry hazards are present; it is key to preserve Magmortar's health throughout the game so that it has more opportunities to safely wallbreak without fear of being KOed. Instead, bring Magmortar in via pivoting moves like U-turn. Because of how absurdly strong Choice Specs-boosted Fire Blast is, it's generally a safe move to use whenever the opportunity presents itself, such as when Magmortar is against a Grass-type like Vileplume or Decidueye.",
            "moves": [
                [
                    "Fire Blast"
                ],
                [
                    "Focus Blast"
                ],
                [
                    "Thunderbolt"
                ],
                [
                    "Hidden Power Grass"
                ]
            ],
            "item": [
                " Choice Specs"
            ],
            "ability": [
                "Vital Spirit"
            ],
            "nature": [
                "Modest"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Water-types",
        "Rock-types",
        "Entry Hazards",
        "Delphox",
        "Revenge Killers"
    ],
    "credits": [
        "Written by Rabia",
        "Earlier versions by quziel",
        "Quality checked by quziel, Eternally,  and banks",
        "Grammar checked by The Dutch Plumberjack and Estronic"
    ]
}