{
    "name": "Manaphy",
    "forms": {
        "Base": {
            "base stats": [
                100,
                100,
                100,
                100,
                100,
                100
            ],
            "types": [
                "Water"
            ],
            "abilities": [
                "Hydration"
            ],
            "tier": [
                "UUBL"
            ],
            "form": "Base"
        }
    },
    "overview": "Manaphy is a powerful wallbreaker that is capable of easily breaking apart defensively oriented teams with Tail Glow, which boosts its Special Attack to incredible levels. It also boasts decent natural bulk and a good defensive typing in mono-Water, which grants it many opportunities to set up. To top it off, Manaphy has access to a number of excellent coverage moves such as Energy Ball, Ice Beam, and Psychic that allow it to customize its moveset to break through some of its traditional checks and counters. However, Manaphy suffers from significant four-moveslot syndrome, as it's unable to fit all the options it wants to run on one set. Additionally, its base 100 Speed tier, although decent, makes it largely ineffective versus offensively oriented teams.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Waterium Z",
            "stats": [
                236,
                212,
                236,
                299,
                237,
                328
            ],
            "type": [
                "Water"
            ],
            "usage": "Manaphy should only try to set up when Aurora Veil is up, as it is very hard to collect two boosts otherwise. Manaphy should use its Z-Move depending on what type of playstyle it is against; offensive teams are very prone to Z-Rain Dance, while bulkier teams are greatly threatened by a well-timed Hydro Vortex. While this set has good matchups under Aurora Veil, Manaphy should still try to avoid damage, since it will need as much of its health as possible to gather two boosts. It should also not attempt to set up if there is a Pokemon that can end its sweep such as Haze Mantine or a healthy Tapu Bulu.",
            "moves": [
                [
                    "Tail Glow"
                ],
                [
                    "Surf"
                ],
                [
                    "Psychic"
                ],
                [
                    "Rain Dance"
                ]
            ],
            "item": [
                " Waterium Z"
            ],
            "ability": [
                "Hydration"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Tail Glow + 3 Attacks",
            "stats": [
                237,
                212,
                236,
                299,
                236,
                328
            ],
            "type": [
                "Water"
            ],
            "usage": "Try to set up Tail Glow against Pokemon that struggle to touch Manaphy, such as Celesteela and non-Bloom Doom Heatran. This Manaphy set is not very useful against offensively oriented teams, as offense tends to have multiple Pokemon that can outpace and KO it. As such, it should focus less on setting up and more on checking specific threats on the opposing team in this matchup. Manaphy is best suited for the role of an early-game wallbreaker, so don't be afraid to set up early in the match and start punching holes in the opposing team. Manaphy can take advantage of its good bulk to switch into weaker or resisted special attacks; for example, it can pivot into Pokemon such as non-Psychic Mew and Keldeo Choice-locked into a Water-type attack.",
            "moves": [
                [
                    "Tail Glow"
                ],
                [
                    "Scald"
                ],
                [
                    "Ice Beam"
                ],
                [
                    "Psychic"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Hydration"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                4,
                0,
                0,
                252,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Grass-types",
        "Water-types",
        "Electric-types",
        "Fast Offensive Pokemon"
    ],
    "credits": [
        "Written by Wob and Vertex",
        "Earlier versions by bludz",
        "Quality checked by Gary, Colonel M, Subject 18,  and p2",
        "Grammar checked by lotiasite, The Dutch Plumberjack,  and Fireflame479"
    ]
}