{
    "name": "Mantine",
    "forms": {
        "Base": {
            "base stats": [
                85,
                40,
                70,
                80,
                140,
                70
            ],
            "types": [
                "Water",
                "Flying"
            ],
            "abilities": [
                "Swift Swim",
                "Water Absorb",
                "Water Veil"
            ],
            "tier": [
                "RU"
            ],
            "form": "Base"
        }
    },
    "overview": "Mantine is a great special wall in OU and is capable of walling a significant portion of the metagame. Because of its typing, it's able to be one of the best answers to Volcarona in the tier while also being able to switch into threats such as Ash-Greninja and Mega Charizard Y. Mantine is also a good Defogger, being able to deter Pokemon such as Bisharp and Landorus-T from switching in to take advantage of it with a Scald burn. However, Mantine is very passive and can drain momentum from your team, and its weakness to Stealth Rock is suboptimal for a defensive Pokemon. The prevalence of Electric-types such as Mega Manectric and Tapu Koko also hinders Mantine, as it can't do much against them. Finally, it has relatively low Defense, even when invested, so Pokemon such as Mega Medicham and Landorus-T can easily do massive damage to it.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Mixed Wall",
            "stats": [
                269,
                104,
                185,
                196,
                408,
                176
            ],
            "type": [
                "Water",
                "Flying"
            ],
            "usage": "Mantine should be used as a defensive pivot to switch into Pokemon such as Ash-Greninja and Mega Scizor. Prioritize keeping Mantine healthy with Roost, as it tends to get worn down a lot between Stealth Rock damage and taking hits. Be careful of Hidden Power Electric from Pokemon that might carry it such as Greninja and Keldeo. Use Haze on Pokemon that are able to set up on Mantine such as Manaphy and Volcarona. If Defog is being run, try to use it on Pokemon Mantine can force out such as Keldeo. Try not to let Mantine get badly poisoned by Toxic, as it severely limits its ability to take hits.",
            "moves": [
                [
                    "Roost"
                ],
                [
                    "Scald"
                ],
                [
                    "Defog"
                ],
                [
                    "Toxic",
                    "Haze"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Water Absorb"
            ],
            "nature": [
                "Calm"
            ],
            "ev spread": [
                252,
                0,
                36,
                0,
                220,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Electric-type Coverage",
        "Passive Damage",
        "Taunt",
        "Rock-type Coverage",
        "Strong Attacks"
    ],
    "credits": [
        "Written by matthewc20090",
        "Earlier versions by Samoyed",
        "Quality checked by Subject 18, Gary,  and p2",
        "Grammar checked by Wob and Fireflame479"
    ]
}