{"name": "Mawile", "forms": {"Base": {"base stats": [50, 85, 85, 55, 55, 50], "types": ["Steel", "Fairy"], "abilities": ["Hyper Cutter", "Intimidate", "Sheer Force"], "tier": ["Untiered"], "form": "Base"}, "Mega": {"base stats": [50, 105, 125, 55, 95, 50], "types": ["Steel", "Fairy"], "abilities": ["Huge Power"], "tier": ["OU"], "form": "Mega"}}, "overview": "Mega Mawile is one of the strongest breakers in the OU metagame. Solid coverage options like Knock Off, Ice Punch, Fire Fang, and Thunder Punch alongside a setup move in Swords Dance make Mega Mawile impossible to deal with defensively, while its access to Sucker Punch gives it the ability to threaten offensive teams. Its typing, combined with Intimidate, grants it many opportunities to either set up or just attack against common Pokemon such as Clefable, Tapu Bulu, and Reuniclus, allowing it to punch holes in teams relatively consistently. However, because of its very poor Speed, Mega Mawile heavily relies on Sucker Punch to deal with faster threats, which allows Pokemon like Tapu Koko, Tapu Lele, and Ash-Greninja to revenge kill it relatively consistently; hence, it struggles more against offensive teams that can overwhelm it before it can get a strong hit off. While Mega Mawile's typing is great, it does give Mega Mawile two weaknesses to extremely common types, namely Ground and Fire, making it vulnerable to common Pokemon such as Heatran, Landorus-T, and Garchomp, which are also bulky enough to take a +2 Sucker Punch. Finally, Mega Mawile has slight issues with picking correct coverage, as it can't always run what it wants.\n", "strategies' format": "OU", "strategies": [{"name": "Swords Dance", "stats": [159, 339, 286, 131, 226, 177], "type": ["Steel", "Fairy"], "usage": "Mega Mawile is best used to soften up defensive teams early- to mid-game so that the rest of its team has an easier time dealing with the remaining Pokemon. Against offensive teams, it's advised to attempt to play aggressively, such as bringing it in on a predicted double switch, so that you can get value out of Mega Mawile in this matchup. Additionally, it's advised to only set up late-game, as early-game, Mega Mawile's checks will be too healthy for it to sweep through them. Mega Mawile is also good at wearing down Pokemon such as Heatran and Landorus-T so that the rest of its team can more easily deal with them. This is especially true with entry hazards on the field. Before Mega Evolving, Mawile can be useful with Intimidate pivoting to help soften blows from physical attackers like Hawlucha, Gyarados, Mega Heracross, and Kartana.", "moves": [["Swords Dance"], ["Play Rough"], ["Sucker Punch"], ["Knock Off", "Thunder Punch"]], "item": [" Mawilite"], "ability": ["Intimidate"], "nature": ["Adamant"], "ev spread": [92, 252, 0, 0, 0, 164], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "All-out Attacker", "stats": [159, 339, 286, 131, 226, 177], "type": ["Steel", "Fairy"], "usage": "Against defensive teams, attempt to get Mega Mawile in as much as possible so it can punch holes with its great power and coverage. You must play aggressively against offensive teams in order to maximize Mega Mawile's potential, since it would normally be too pressured to get any damage off. Good ways to get Mega Mawile in against an offense team would be by double switching or bringing it in via U-turn or Volt Switch. Make sure to predict whenever the opponent tries to maneuver around Mega Mawile's coverage so that you can get the most value out of it. This set is capable of hitting a large part of the metagame super effectively; thus, it is advised to be very aggressive with this set, as it's quite prediction reliant and can be extremely deadly if played correctly.", "moves": [["Play Rough"], ["Thunder Punch"], ["Sucker Punch", "Ice Punch"], ["Brick Break", "Fire Fang"]], "item": [" Mawilite"], "ability": ["Intimidate"], "nature": ["Adamant"], "ev spread": [92, 252, 0, 0, 0, 164], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Faster Offensive Threats", "Will-O-Wisp", "Physically Defensive Walls"], "credits": ["Written by Nuked", "Previous versions by dk", "Quality checked by lyd, Jordy,  and ABR", "Grammar checked by The Dutch Plumberjack and martha"]}