{"name": "Medicham", "forms": {"Base": {"base stats": [60, 60, 75, 60, 75, 80], "types": ["Fighting", "Psychic"], "abilities": ["Pure Power", "Telepathy"], "tier": ["NU"], "form": "Base"}, "Mega": {"base stats": [60, 100, 85, 80, 85, 100], "types": ["Fighting", "Psychic"], "abilities": ["Pure Power"], "tier": ["OU"], "form": "Mega"}}, "overview": "Pure Power doubles Mega Medicham's Attack stat, making it one of the most powerful wallbreakers in the OU tier. Powerful STAB attacks in High Jump Kick and Zen Headbutt in conjunction with solid coverage moves such as Thunder Punch and Ice Punch make Mega Medicham even more challenging to switch into. Mega Medicham's base 100 Speed stat allows it to outpace Heatran, Rotom-W, Tapu Lele, and Landorus-T, among other threatening Pokemon. Mega Medicham also has access to priority moves such as Fake Out and Bullet Punch, which help patch up its only decent Speed stat and allow it to pick off faster offensive Pokemon such as Greninja, Tapu Koko, and Gengar. Mega Medicham's relatively low Speed stat alongside very poor bulk makes it rather easy to revenge kill. Despite Mega Medicham's power, it has issues breaking through bulky Psychic-types such as the prevalent Mew, as well as Reuniclus and Mega Slowbro.\n", "strategies' format": "OU", "strategies": [{"name": "All-out Attacker", "stats": [156, 299, 207, 176, 206, 328], "type": ["Fighting", "Psychic"], "usage": "Beware of using High Jump Kick when the opponent has a Ghost-type Pokemon, as they are immune to the move, and Mega Medicham will lose 50% of its health if it misses. Similarly, Mega Medicham should watch out for Protect users such as Celesteela and Ferrothorn. Mega Medicham has very poor defensive stats, and as such, should not be switched into attacks, since even powerful resisted attacks will do significant damage. Use Mega Medicham's teammates to generate as much momentum as possible for it. Slow U-turns and Volt Switches as well as aggressive double switches can be very beneficial in order to get Mega Medicham as many free switch ins as possible.", "moves": [["Fake Out"], ["High Jump Kick"], ["Ice Punch"], ["Zen Headbutt"]], "item": [" Medichamite"], "ability": ["Telepathy"], "nature": ["Jolly", "Adamant"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Ghost-types", "Bulky Psychic-types", "Faster Offensive Pokemon"], "credits": ["Written by AJB", "Quality checked by Subject 18, Halcyon.,  and Gary", "Grammar checked by Fireflame479 and Rakan"]}