{
    "name": "Meowth",
    "forms": {
        "Base": {
            "base stats": [
                40,
                45,
                35,
                40,
                40,
                90
            ],
            "types": [
                "Normal"
            ],
            "abilities": [
                "Pickup",
                "Technician",
                "Unnerve"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Meowth carves itself a niche as an excellent revenge killer with its Fake Out + Feint combination, which is considerably powerful thanks to STAB combined with Technician. In tandem with Fake Out, Feint can take care of many sweepers like Abra, Zigzagoon, and Carvanha without opposition. Meowth also hits the coveted 19 Speed tier, allowing it to outpace almost the entire unboosted metagame, including threats like Mienfoo and Chinchou, and Speed tying with Ponyta. It's also an excellent anti-lead that is able to reliably take care of Onix and Dwebble. Unfortunately, Meowth is beaten by common priority attacks like Vacuum Wave and Mach Punch. It suffers from four-moveslot syndrome, as it's unable to carry all the coverage it needs, forcing it to be vulnerable to at least one of its checks. It's also incredibly frail and will usually get knocked out if it can't KO what's in front of it. Meowth is forced to run Life Orb, as it's fairly weak without one.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Mixed Attacker",
            "stats": [
                104,
                185,
                95,
                125,
                125,
                291
            ],
            "type": [
                "Normal"
            ],
            "usage": "Meowth is an excellent anti-lead that is able to beat Mienfoo and Onix, so leading with it is often a safe choice. If possible, try to scout whether the Onix is Weak Armor or Sturdy, as using Fake Out on the former is counterproductive. Don't switch Meowth in on attacks if you can, however, as it is very frail and best suited to come in after a slow U-turn or as a revenge killer. Feint should be played to its strengths; for example, use it against common Protect users like Carvanha. Keep Meowth healthy throughout the match, as its ability to reliably deal high amounts of damage is valuable mid- and late-game. If your team struggles against a certain sweeper, preserve Meowth so it can deal a large chunk of damage with its Fake Out and Feint. If you're running U-turn or Knock Off, be sure to use them on predicted switches to keep up momentum.",
            "moves": [
                [
                    "Fake Out"
                ],
                [
                    "Feint",
                    "Return"
                ],
                [
                    "Water Pulse"
                ],
                [
                    "Aerial Ace",
                    "Knock Off",
                    "U-turn"
                ]
            ],
            "item": [
                " Life Orb"
            ],
            "ability": [
                "Technician"
            ],
            "nature": [
                "Hasty"
            ],
            "ev spread": [
                0,
                236,
                0,
                36,
                36,
                196
            ],
            "iv spread": [
                19,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Steel-types",
        "Fighting-types",
        "Bulky Tanks",
        "Faster Pokemon"
    ],
    "credits": [
        "Written by Gummy",
        "Quality checked by Hilomilo, Xayah,  and Nineage",
        "Grammar checked by P Squared and Fireflame479"
    ]
}