{
    "name": "Mesprit",
    "forms": {
        "Base": {
            "base stats": [
                80,
                105,
                105,
                105,
                105,
                80
            ],
            "types": [
                "Psychic"
            ],
            "abilities": [
                "Levitate"
            ],
            "tier": [
                "PU"
            ],
            "form": "Base"
        }
    },
    "overview": "Mesprit is the most versatile Pokemon in PU, with a wide movepool that gives it several viable sets such as Choice Specs and defensive Stealth Rock and a great stat distribution that gives it both bulk and power. Mesprit notably has access to one of the best moves in the game in Stealth Rock, and it is undeniably the best setter in the tier thanks to great defensive stats and Levitate, which allow it to set with relative ease. It also has a fantastic matchup versus the best Rapid Spin user in the tier, Hitmonchan. Levitate also gives Mesprit immunity to all entry hazards except for Stealth Rock, preventing it from being worn down over repeated switches. Mesprit has access to a myriad of useful support moves such as Healing Wish, Thunder Wave, U-turn, and Trick, all allowing it to fulfill support roles. Healing Wish is one of the most notable ones, letting a weakened Mesprit sacrifice itself to fully restore the HP of a teammate. Mesprit also boasts a great offensive presence thanks to a solid base 105 Special Attack stat along with several offensive sets like Choice Specs, Choice Scarf, and (Substitute +) Calm Mind, which are capable of either wallbreaking or setting up on weaker, more passive Pokemon. The Choice sets offer either an immediately powerful special attacker or a decent revenge killer, while the Calm Mind sets offer a reliable sweeper. A Psychic typing along with Levitate allows Mesprit to check common Fighting-, Ground-, and Poison-types effectively, but it also leaves it vulnerable to Pursuit users such as Spiritomb and Skuntank, with more offensive sets being more prone to Sucker Punch users like Absol and the aforementioned Skuntank. Depending on the item Mesprit is holding, however, it is able to potentially beat these checks. Even though Mesprit has good stat distribution, its Speed is rather lacking, meaning that against more offensively based teams it can struggle, especially if it's running an offensive set. Bulkier sets also have no way of restoring HP outside of Leftovers, meaning they can be worn down throughout the course of the game.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Defensive Stealth Rock",
            "stats": [
                259,
                221,
                336,
                246,
                246,
                200
            ],
            "type": [
                "Psychic"
            ],
            "usage": "Thanks to maximum defensive investment, Mesprit is able to effectively switch into physical attacks that aren't super effective. It should especially aim to switch into Fighting- and Ground-types due to its resistance and immunity to their STAB attacks. Mesprit is also one of the few users of Stealth Rock that are able to beat Hitmonchan, the most common user of Rapid Spin in the tier. Mesprit should attempt to use U-turn on a predicted switch to or directly pivot out on Pokemon that it can't hit, such as Steel- and Dark-types like Aggron and Skuntank, and other switch-ins like Oricorio-G, which can take a hit and either set up on it or force it out. Using U-turn against Dark-types also allows Mesprit to avoid extra damage from faster Pursuit users. Mesprit should try to set up Stealth Rock against foes that it isn't directly threatened by, such as Defensive Golem and Regirock, or Pokemon that it forces out with the threat of its STAB move, like Weezing, Gurdurr, and Hitmonchan. Mesprit should aim to use Healing Wish later in the game once it and the rest of its team are weakened, and once it's no longer needed, to restore the HP of a more useful teammate. Thunder Wave is to be used as a form of pseudo-speed control, crippling faster targets like Skuntank or setup sweepers such as Carracosta and making them more susceptible to revenge killing. It is worth noting that once Mesprit's Colbur Berry has been consumed, Mesprit finds it a lot harder to switch in and out when the opponent has a Dark-type Pokemon, because Mesprit is Pursuit trapped a lot more easily. During the late-game Mesprit is generally not very useful, unless it's still required to check Fighting-types like Gurdurr and Hitmonchan, so it should set up Stealth Rock, pivot, and even use Healing Wish earlier on.",
            "moves": [
                [
                    "Stealth Rock"
                ],
                [
                    "Psychic"
                ],
                [
                    "U-turn"
                ],
                [
                    "Healing Wish",
                    "Thunder Wave"
                ]
            ],
            "item": [
                " Colbur Berry"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                252,
                0,
                240,
                0,
                0,
                16
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Choice Scarf",
            "stats": [
                196,
                221,
                247,
                339,
                246,
                259
            ],
            "type": [
                "Psychic"
            ],
            "usage": "Choice Scarf Mesprit appreciates being brought in after something has fainted or by a slow Volt Switch or U-turn user, such as Lanturn, to try to either force out the opposing Pokemon or revenge kill it. It's also able to pivot in on Fighting- and Ground-types. Early- and mid-game, Mesprit shouldn't be played aggressively if the opponent has checks such as Skuntank and should instead opt to gain momentum by using U-turn on these switch-ins. Mesprit can also use coverage moves versus them if they're sufficiently weakened, but it has to be wary of Sucker Punch from Dark-types. Mesprit can be used late-game as a sweeper, as it can clean weakened teams lacking checks to it with STAB Psychic. If Mesprit is no longer needed or is weakened, it can also choose to heal a teammate to full with Healing Wish while also giving that teammate a free switch-in and generating momentum. Since it can be hard to identify what set Mesprit is running from Team Preview, try to use this to your advantage by catching your opponent off guard.",
            "moves": [
                [
                    "Psychic"
                ],
                [
                    "U-turn"
                ],
                [
                    "Healing Wish",
                    "Trick"
                ],
                [
                    "Dazzling Gleam",
                    "Ice Beam"
                ]
            ],
            "item": [
                " Choice Scarf"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Modest",
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                4,
                252,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Choice Specs",
            "stats": [
                196,
                221,
                247,
                339,
                246,
                259
            ],
            "type": [
                "Psychic"
            ],
            "usage": "Due to Mesprit's great wallbreaking capabilities, it should be used early- or mid-game to break teams down with its powerful STAB and coverage moves. It can be brought in on resisted hits from Ground- and Fighting-type Pokemon like Golem and Hitmonchan or on weaker, more passive Pokemon like Weezing. When Pokemon resistant or immune to Mesprit's Psychic-type STAB attack are still present, it should be wary of locking itself into Psychic or Psyshock and instead use coverage when appropriate, like on a predicted switch-in. This is an especially notable tactic against Pokemon like Skuntank and Absol, which are able to Pursuit trap Mesprit. Ice Beam is also a very spammable move. If the opponent has no Pokemon resistant or immune to Psychic or if it has fainted, Mesprit should focus on spamming its Psychic-type STAB attacks in an effort to break the opposing team. Mesprit can also use Healing Wish once it is weakened too much or isn't needed anymore to give a teammate another chance. Due to how many sets Mesprit has, it can sometimes be difficult to tell what set Mesprit is, which you can use to your advantage in certain situations, especially if the opponent believes it to be a more defensive set.",
            "moves": [
                [
                    "Psychic",
                    "Psyshock"
                ],
                [
                    "Dazzling Gleam"
                ],
                [
                    "Ice Beam",
                    "Signal Beam"
                ],
                [
                    "Healing Wish"
                ]
            ],
            "item": [
                " Choice Specs"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Modest",
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                4,
                252,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Calm Mind + 3 Attacks",
            "stats": [
                196,
                221,
                247,
                309,
                246,
                284
            ],
            "type": [
                "Psychic"
            ],
            "usage": "Once Mesprit has set up a Calm Mind, it becomes a strong mid-game wallbreaker able to break teams down with its powerful STAB moves and coverage; bring it in on resisted hits from Ground- and Fighting-type Pokemon like Golem and Poliwrath in order for it to set up. Mesprit can also be brought in on weaker, more passive foes like defensive Carracosta. Mesprit should try to use its Psychic-type STAB move as much as possible if nothing resistant or immune to Psychic is present on your opponent's team, but it should be wary of doing so if Pokemon like Aggron and Skuntank are still around. If Dark-types are present, Mesprit should attempt to use its coverage moves so that they don't get a free switch into its STAB attack. Twinkle Tackle should be used as a one-time nuke to remove or weaken a check to Mesprit like the previously mentioned Skuntank or Aggron, OHKOing or heavily damaging them. Mesprit should avoid setting up on Pokemon with potential status moves, like Regirock and Clefairy, because being paralyzed or badly poisoned makes it more vulnerable to revenge killing or prevents it from wallbreaking effectively. Due to how many sets Mesprit can run, the opponent may have difficulty determining what set Mesprit is, which you can use to your advantage, especially if they believe it to be a more defensive set.",
            "moves": [
                [
                    "Calm Mind"
                ],
                [
                    "Psyshock",
                    "Psychic"
                ],
                [
                    "Dazzling Gleam"
                ],
                [
                    "Hidden Power Ground"
                ]
            ],
            "item": [
                " Colbur Berry",
                " Fairium Z"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                4,
                252,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Offensive Stealth Rock",
            "stats": [
                196,
                221,
                247,
                309,
                246,
                284
            ],
            "type": [
                "Psychic"
            ],
            "usage": "Mesprit is often an offensive team's choice for a Stealth Rock user and should be played aggressively, as it's able to pressure every defensive Stealth Rock setter. Thanks to its offensive set, Mesprit can act as a wallbreaker, especially if it's using a Life Orb over Colbur Berry, allowing it to soften opposing Pokemon for teammates early- and mid-game. Mesprit should be played cautiously if the opponent has a Pursuit trapper because it lacks the bulk to take them on, especially if it opts for Life Orb as its item. It should also be played carefully if it's the team's only Fighting-type check. With U-turn, Mesprit is able to pivot on the switches that it can force, gaining momentum and bringing in teammates potentially for free. You should be wary of spamming U-turn when using Life Orb, however, as Mesprit becomes easily chipped down throughout the match. Offensive Stealth Rock Mesprit can be a hard set for the opponent to pin down because it's rather uncommon, meaning you can use this to your advantage. This is especially noteworthy considering how hard the more offensive sets, outside of Choice Specs, are to tell apart thanks to them having the same damage output, unless this set is using Life Orb. Healing Wish allows a weakened Mesprit to give another teammate a shot at sweeping or breaking, which is extremely useful late-game for offensive teams. It can also be used to block both Defog and Rapid Spin early- or mid-game if needed.",
            "moves": [
                [
                    "Stealth Rock"
                ],
                [
                    "Psychic"
                ],
                [
                    "Dazzling Gleam",
                    "Ice Beam"
                ],
                [
                    "Healing Wish",
                    "U-turn"
                ]
            ],
            "item": [
                " Colbur Berry",
                " Life Orb"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                4,
                252,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Substitute + Calm Mind",
            "stats": [
                248,
                221,
                246,
                258,
                246,
                284
            ],
            "type": [
                "Psychic"
            ],
            "usage": "Mesprit should aim to pivot into many of the more defensive Pokemon in the tier, such as Regirock and Lanturn, to set up with Substitute and Calm Mind, forcing them out. You should be aware that a lot of the defensive Pokemon in the tier carry some form of status, however, which can cripple Mesprit if it directly switches in. Switching into Fighting-types like Hitmonchan also gives Mesprit almost free setup, but it should be wary of Knock Off or U-turn from Gurdurr and Primeape. Substitute + Calm Mind Mesprit is noticeably weaker in comparison to other offensive sets and as such has trouble dealing with opposing Pokemon when unboosted and even when at +1, but it is able to set up on a considerable number of passive bulky Pokemon such as Lanturn and Audino. Due to this, it should be used towards the late-game when the opponent's team has already been weakened by teammates. This Mesprit set struggles with Dark-types the most, as it doesn't have the offensive presence to pressure them or access to Colbur Berry to mitigate damage, meaning it should be used carefully when the opponent still has a Dark-type around. Substitute is able to slightly mitigate this weakness, as it stops Pokemon like Liepard and Skuntank from Pursuit trapping Mesprit while also giving it a way to force mind games versus Sucker Punch users.",
            "moves": [
                [
                    "Substitute"
                ],
                [
                    "Calm Mind"
                ],
                [
                    "Psyshock",
                    "Psychic"
                ],
                [
                    "Ice Beam"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                208,
                0,
                0,
                48,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Weather Setter",
            "stats": [
                258,
                221,
                337,
                246,
                246,
                200
            ],
            "type": [
                "Psychic"
            ],
            "usage": "Mesprit provides excellent role compression for weather teams, as it can set both weather and Stealth Rock along with having access to a momentum move in U-turn. Thanks to its high defensive stats it's also able to take multiple hits throughout the course of the battle, meaning it can set multiple times. Generally when you're using Mesprit it should aim to set up Stealth Rock before setting up weather, because it doesn't want to waste its weather turns for no reason, especially as it's used on such an offensive playstyle. However, some situations may arise where it is only able to use one, and then it should only focus on getting up weather because it's more beneficial for its team. Against Taunt users such as Skuntank and Floatzel, it should be wary of trying to set up. Because it's not carrying a Colbur Berry, Mesprit has to be cautious of opposing Dark-types and may have to make a choice between setting up weather and getting knocked out or not setting up weather so it can be used later on. You should attempt to predict Dark-types coming in and use U-turn to pivot out. On rain teams Mesprit is often the best Fighting-type resistant Pokemon available, so it should be preserved if the opponent still has a Fighting-type like Gurdurr or Assault Vest Hitmonchan.",
            "moves": [
                [
                    "Rain Dance",
                    "Sunny Day"
                ],
                [
                    "Stealth Rock"
                ],
                [
                    "Psychic"
                ],
                [
                    "U-turn"
                ]
            ],
            "item": [
                " Damp Rock",
                " Heat Rock"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                248,
                0,
                244,
                0,
                0,
                16
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Dark-types",
        "Steel-types",
        "Specially Defensive Walls",
        "Ghost-types",
        "Strong Attackers"
    ],
    "credits": [
        "Written by yogi",
        "Quality checked by g, Many,  and Megazard",
        "Grammar checked by The Dutch Plumberjack and frenzyplant"
    ]
}