{
    "name": "Mienshao",
    "forms": {
        "Base": {
            "base stats": [
                65,
                125,
                60,
                95,
                60,
                105
            ],
            "types": [
                "Fighting"
            ],
            "abilities": [
                "Inner Focus",
                "Reckless",
                "Regenerator"
            ],
            "tier": [
                "RUBL"
            ],
            "form": "Base"
        }
    },
    "overview": "Mienshao is a good fast pivot due to its access to U-turn and Knock Off in conjunction with Regenerator and an Assault Vest, allowing it to constantly pivot in and chip foes throughout a game. Furthermore, its high Speed lets it outspeed metagame staples such as Hydreigon, Celebi, and Nihilego, which greatly bolsters its ability as a pivot, and its pure Fighting typing enables Mienshao to check some of the tier's key threats in Hydreigon and Kyurem. Mienshao can also switch into other special attackers more easily due to its resistance to Stealth Rock and its increased special bulk from an Assault Vest. However, its typing also leaves it vulnerable to several key attacking types in Fairy, Flying, and Psychic, and it struggles with foes such as Mega Altaria, Moltres, and Latias as a result. While Mienshao may be able to switch into some special attacks due to its Assault Vest, it has minimal physical bulk, which makes it vulnerable to priority moves from Scizor, Mamoswine, and Crawdaunt and faster physical attackers like Terrakion and Zeraora.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "Assault Vest",
            "stats": [
                191,
                286,
                156,
                203,
                195,
                339
            ],
            "type": [
                "Fighting"
            ],
            "usage": "Mienshao should be used primarily to pivot into special attackers like Hydreigon and Nihilego. It can also be switched into passive Pokemon such as Blissey that it doesn't fear much from; however, it must be wary of status. Once on the field, Mienshao should try to pivot out and generate offensive momentum with U-turn. It can also use U-turn to capitalize on the switches it can force against top-tier Pokemon like Hydreigon and Empoleon. Mienshao should attempt to stay healthy throughout the course of a match to ensure it can consistently check what it needs to. Pivoting or switching it out to recover health with Regenerator after taking an attack helps with this, but it should avoid taking strong attacks unless necessary. If a Pokemon that relies heavily on its item to function, such as Suicune or Choice Specs Primarina, is predicted to switch in, using Knock Off to punish it and thus lessening a threat to Mienshao's teammates is preferred as opposed to switching it out immediately. Against defensive teams, Mienshao functions best as a means to cripple key stall staples and passive Pokemon like Alomomola and Quagsire with the removal of their items, which can make it easier for its more offensive teammates to break through them. Despite Mienshao's lack of offensive investment, it can be used to KO certain frailer offensive threats like Lucario due to its naturally high Attack combined with a high-Base Power STAB move. It must scout for Protect users that can force it to lose 50% of its HP, however, such as Empoleon and Nihilego. Mienshao can be used as an effective switch-in to Volt Switch from Mega Manectric due to its high special bulk and ability to regain HP through Regenerator and pivoting.",
            "moves": [
                [
                    "High Jump Kick"
                ],
                [
                    "Knock Off"
                ],
                [
                    "U-turn"
                ],
                [
                    "Fake Out"
                ]
            ],
            "item": [
                " Assault Vest"
            ],
            "ability": [
                "Regenerator"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                100,
                0,
                0,
                0,
                156,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fairy-types",
        "Flying-types",
        "Physical Attackers",
        "Physically Defensive Pokemon"
    ],
    "credits": [
        "Written by martha",
        "Earlier versions by faded love and Highways",
        "Quality checked by Nuked, Hilomilo,  and A Cake Wearing A Hat",
        "Grammar checked by The Dutch Plumberjack and A Cake Wearing A Hat"
    ]
}