{
    "name": "Morelull",
    "forms": {
        "Base": {
            "base stats": [
                40,
                35,
                55,
                65,
                75,
                15
            ],
            "types": [
                "Grass",
                "Fairy"
            ],
            "abilities": [
                "Effect Spore",
                "Illuminate",
                "Rain Dish"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "With very good defensive stats, a passable Special Attack stat, and a cool signature move in Strength Sap, Morelull can make for a relatively good defensive pivot. Spore and Moonblast add to this by putting switch-ins to sleep and catching incoming Fighting-types, respectively, as does its ability, Effect Spore. However, Morelull is commonly outclassed by the many other bulky Grass-types such as Ferroseed, Lileep, and most of all, Foongus, which also acts as a defensive pivot with Spore but has access to Regenerator. With the rise of Poison-types in SM, Morelull struggles to find a teamslot over Foongus due to its 4x weakness to the type, but its Fairy typing and slightly wider support movepool can certainly grant it a niche. It also struggles with a relatively passive playstyle in a very offensive metagame, making it unwelcome on many teams.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Defensive Pivot",
            "stats": [
                125,
                95,
                225,
                185,
                225,
                66
            ],
            "type": [
                "Grass",
                "Fairy"
            ],
            "usage": "Due to its bulk, Morelull can freely switch into any resisted attack and many neutral attacks. Try to avoid staying in on Poison-types such as Croagunk, Mareanie, and Stunky. Using Strength Sap to heal up when you predict a physical attacker switching in can both heal Morelull and lower the Attack of said foe. However, even when pivoting, never be careless with letting Morelull lose excessive amounts of health, as its recovery is not passive like Foongus's, and it doesn't work very well against special attackers.",
            "moves": [
                [
                    "Spore"
                ],
                [
                    "Moonblast"
                ],
                [
                    "Giga Drain"
                ],
                [
                    "Strength Sap"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Effect Spore"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                36,
                0,
                236,
                76,
                156,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Poison-types",
        "Steel-types",
        "Fire-types",
        "Special Attackers with Super Effective Coverage"
    ],
    "credits": [
        "Written by Drew",
        "Quality checked by tahu, Fiend,  and Nineage",
        "Grammar checked by Kris and CryoGyro"
    ]
}