{
    "name": "Mr. Mime",
    "forms": {
        "Base": {
            "base stats": [
                40,
                45,
                65,
                100,
                120,
                90
            ],
            "types": [
                "Psychic",
                "Fairy"
            ],
            "abilities": [
                "Filter",
                "Soundproof",
                "Technician"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        }
    },
    "overview": "Mr. Mime possesses a notable niche over other Psychic-types like Mesprit and Jynx thanks to its secondary Fairy typing. Its Nasty Plot set works well against balance and stall teams by breaking through walls and hitting surprisingly hard with its perfect neutral coverage. Its coverage and Speed tier allow Mr. Mime to do well versus offensive teams, especially in a tier full of Fighting-types. Its Fairy typing also helps it serve as a reliable check to threatening Dragon-types in the tier like Drampa and Alolan Exeggutor. However, although Mr. Mime's Speed is slightly above average, it is slow enough to be scared out by faster Pokemon due to its poor physical bulk and HP. Its defenses also leave it susceptible to priority moves and Pursuit trapping, which can make it hard to use. While its Fairy typing can lend a hand in checking Fighting-types more easily, Mr. Mime still faces a lot of competition from fellow Psychic-type Jynx, which is often more of an offensive threat thanks to its slightly higher Speed and Ice coverage.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Nasty Plot",
            "stats": [
                116,
                113,
                166,
                299,
                277,
                306
            ],
            "type": [
                "Psychic",
                "Fairy"
            ],
            "usage": "The goal with this set is to get a Nasty Plot up and start doing damage. It is possible to sweep with it, but the more realistic goal is to break through the other team's bulkier Pokemon to make way for your other Pokemon to sweep. In the event the opposing player is running a very offensive team, Mr. Mime is strong enough to hit frail offensive Pokemon hard enough without a Special Attack boost, so just firing off attacks is the best option. The easiest way to set up a Nasty Plot is to do so on a threatened or passive Pokemon. A slow U-turn or Volt Switch from Mesprit or Lanturn can aid in getting Mr. Mime in on these Pokemon. Notable Pokemon Mr. Mime can set up on are Hitmonchan, Musharna, Gurdurr, Sableye, and Lanturn. Hitmonchan, Gurdurr, and Sableye can still be threatening with their strong physical hits, however, so caution is advised. When using Life Orb Mr. Mime, it is imperative that the player limit the use of Mr. Mime and wait until a safe opportunity to set up or attack due to the limited number of attacks that can be used. If All-Out Pummeling is not needed for a specific wall, keep in mind that it is still the strongest move in Mr. Mime's arsenal, but always be wary of the opponent's Ghost-types when using it.",
            "moves": [
                [
                    "Nasty Plot"
                ],
                [
                    "Dazzling Gleam"
                ],
                [
                    "Focus Blast"
                ],
                [
                    "Psyshock"
                ]
            ],
            "item": [
                " Fightinium Z",
                " Life Orb"
            ],
            "ability": [
                "Soundproof"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fast Physical Attackers",
        "Priority Users",
        "Ghost-types",
        "Bulky Pokemon"
    ],
    "credits": [
        "Written by MadMax123",
        "Quality checked by Megazard, yogi,  and TONE",
        "Grammar checked by martha and The Dutch Plumberjack"
    ]
}