{
    "name": "Mudbray",
    "forms": {
        "Base": {
            "base stats": [
                70,
                100,
                70,
                45,
                55,
                45
            ],
            "types": [
                "Ground"
            ],
            "abilities": [
                "Inner Focus",
                "Own Tempo",
                "Stamina"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Thanks to an excellent defensive ability in Stamina as well as good defensive stats, Mudbray is one of the best defensive Pokemon in Little Cup. It also has an incredible base 100 Attack stat as well as excellent physical coverage, allowing it to run a viable offensive set as well. Even with no investment, it still reaches an impressive 17 Attack, meaning defensive sets are still not passive at all. Additionally, even though it is slow, it can reach 14 Speed without a Jolly nature, meaning it can run a Choice Scarf set to catch its opponents off guard.\nHowever, Mudbray lacks reliable recovery outside of Rest, meaning that it is prone to being worn down over time. Without a Choice Scarf, Mudbray will also usually be outsped by offensive Pokemon, which sometimes means it struggles to switch into them without being forced to use Rest immediately, thus losing your team momentum. Lastly, since Mudbray doesn't fulfill a specific role, it is sometimes difficult to fit on a team.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Offensive",
            "stats": [
                205,
                313,
                185,
                113,
                146,
                165
            ],
            "type": [
                "Ground"
            ],
            "usage": "Mudbray should try and set up Stealth Rock early on in the game to support its team. After that, Earthquake is Mudbray's most spammable attack. Thanks to Mudbray's high Attack stat, it hits incredibly hard against anything that doesn't resist or is immune to it. When a switch is predicted, don't be afraid to use the appropriate coverage moves. Mudbray hits hard even with coverage moves, meaning that it is difficult to stay in even if it is not using Earthquake. Since Berry Juice is quite important to extend Mudbray's longevity, switching into a potential Knock Off is usually not recommended.",
            "moves": [
                [
                    "Earthquake"
                ],
                [
                    "Heavy Slam"
                ],
                [
                    "Rock Slide"
                ],
                [
                    "Stealth Rock"
                ]
            ],
            "item": [
                " Eviolite",
                " Berry Juice"
            ],
            "ability": [
                "Stamina"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                116,
                196,
                36,
                0,
                0,
                156
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "RestTalk",
            "stats": [
                205,
                265,
                185,
                113,
                225,
                126
            ],
            "type": [
                "Ground"
            ],
            "usage": "Mudbray should usually be switched in when an opposing physical attacker is predicted to go for a weaker move. For example, Mienfoo going for Drain Punch instead of High Jump Kick, or Timburr going for Mach Punch. It will usually take the hit quite well while getting a Defense boost in the progress thanks to Stamina. This boost can allow it to wall the physical attacker further. Be careful of staying in and using Rest against special attackers. Many of them will be able to 3HKO Mudbray, meaning that the duration of the sleep that Rest causes is too long to wall them. Don't be afraid of using Earthquake a lot. Thanks to Mudbray's high Attack stat, it will significantly hurt any foe that does not resist or is immune to it. Rest should be used when Mudbray is running low on HP to recover all of its health. While Mudbray is sleeping, Sleep Talk should be used to potentially hit the foe hard. Keep in mind that every time Mudbray uses Rest, it can use Sleep Talk exactly twice. After that, it will wake up, and a different move should be used.",
            "moves": [
                [
                    "Earthquake"
                ],
                [
                    "Rest"
                ],
                [
                    "Sleep Talk"
                ],
                [
                    "Heavy Slam"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Stamina"
            ],
            "nature": [
                "Careful"
            ],
            "ev spread": [
                116,
                116,
                36,
                0,
                236,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Choice Scarf",
            "stats": [
                185,
                313,
                185,
                113,
                146,
                185
            ],
            "type": [
                "Ground"
            ],
            "usage": "Since Choice Scarf Mudbray is uncommon, your opponent will usually not expect it. Use this to your advantage by not revealing that Mudbray has a Choice Scarf too early in the match. Mudbray can be used to revenge kill Pokemon such as Chinchou and Ferroseed, though if the former is holding a Choice Scarf it will outspeed and potentially KO Mudbray. Be careful of locking Mudbray into Earthquake if the opponent still has a Ground-immune Pokemon remaining. They will easily be able to come in and set up or do significant damage to Mudbray or one of its teammates. This set can also be used as a lure for Staryu and Snivy. Staryu is 2HKOed by Earthquake, while Heavy Slam does the same to Snivy and, since they expect to outspeed and OHKO Mudbray, they will often switch in. Thanks to the Choice Scarf, Mudbray can surprise them and knock them out.",
            "moves": [
                [
                    "Earthquake"
                ],
                [
                    "Heavy Slam"
                ],
                [
                    "Rock Slide"
                ],
                [
                    "Close Combat"
                ]
            ],
            "item": [
                " Choice Scarf"
            ],
            "ability": [
                "Stamina"
            ],
            "nature": [
                "Adamant",
                "Jolly"
            ],
            "ev spread": [
                36,
                196,
                36,
                0,
                0,
                236
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Grass-types",
        "Ground-immune Pokemon",
        "Water-types",
        "Strong Special Attackers"
    ],
    "credits": [
        "Written by Xayah and washibon",
        "Quality checked by Rowan, Coconut, Fiend,  and Berks",
        "Grammar checked by GatoDelFuego and The Dutch Plumberjack"
    ]
}