{"name": "Nidoking", "forms": {"Base": {"base stats": [81, 102, 77, 85, 75, 85], "types": ["Poison", "Ground"], "abilities": ["Poison Point", "Rivalry", "Sheer Force"], "tier": ["UU"], "form": "Base"}}, "overview": "Nidoking's access to a great pool of Sheer Force-boosted coverage options such as Ice Beam, Flamethrower, and Thunderbolt allows it to deal heavy damage to defensive Pokemon like Zapdos, Toxapex, Tapu Fini, Landorus-T, and Tangrowth. Its great typing combination grants it immunities to Electric-type attacks, Thunder Wave, and Toxic and lets it absorb Toxic Spikes, something most wallbreakers in the tier cannot do, thus giving it a defensive niche. However, it must compete with stronger or faster wallbreakers in the metagame like Kyurem-B, Hoopa-U, and Mega Charizard Y, and its mediocre bulk and Speed tier make it vulnerable to fast offensive threats like Greninja, Garchomp, Tornadus-T, and Tapu Lele, which doesn't help much in that regard.\n", "strategies' format": "OU", "strategies": [{"name": "Life Orb Attacker", "stats": [198, 216, 190, 269, 187, 295], "type": ["Poison", "Ground"], "usage": "Use pivots and Volt Switch and U-turn users against offensive teams to switch in Nidoking unscratched, which will allow it to apply immense offensive pressure on its foe. Take advantage of the switches Nidoking can force by going for Substitute. This allows it to apply a lot of offensive pressure while also forcing the opponent to go for certain moves that one can further take advantage of. Nidoking can also be switched into weakened, bulkier Pokemon like Skarmory or a predicted Moonblast from Tapu Fini and proceed to use its two main STAB moves and coverage moves to break through the team, helping faster teammates potentially clean late-game. In order to utilize Nidoking to its fullest, the player is required to predict switches and use its coverage moves accordingly.", "moves": [["Earth Power"], ["Sludge Wave"], ["Ice Beam"], ["Substitute", "Flamethrower"]], "item": [" Life Orb"], "ability": ["Sheer Force"], "nature": ["Timid"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Faster Threats", "Chansey", "Psychic-types", "Assault Vest Tornadus-T", "Celesteela", "Strong Water-types"], "credits": ["Written by CKW", "Quality checked by PK Gaming, Finchinator,  and Gary", "Grammar checked by P Squared and The Dutch Plumberjack"]}