{
    "name": "Noivern",
    "forms": {
        "Base": {
            "base stats": [
                85,
                70,
                80,
                97,
                80,
                123
            ],
            "types": [
                "Flying",
                "Dragon"
            ],
            "abilities": [
                "Frisk",
                "Infiltrator",
                "Telepathy"
            ],
            "tier": [
                "RU"
            ],
            "form": "Base"
        }
    },
    "overview": "Noivern's fantastic Speed tier, access to Taunt and Roost, and decent bulk allow it to act as an effective revenge killer and stallbreaker. Noivern's Speed in particular allows it to outpace the majority of unboosted Pokemon in RarelyUsed, including threats like Virizion and Salazzle. The defensive perks of Noivern's Dragon / Flying typing, notably resistances to Fighting-, Fire-, Bug-, and Grass-type moves, let it act as a workable switch-in to common offensive Pokemon, such as Virizion, Arcanine, Golisopod, and Roserade, and force prediction from stronger wallbreakers like Flame Orb Machamp. Noivern has a fully customizable fourth moveslot with options such as Super Fang, U-turn, Flamethrower, and Draco Meteor, which allows it to improve bad matchups. For example, if a wallbreaking teammate such as Choice Band Pangoro needs opportunities to break defensive cores, Noivern can opt for U-turn to give it free turns. Choice Scarf Noivern is one of the best revenge killers in the tier, able to handle extremely quick setup sweepers such as Shell Smash Barbaracle and Rock Polish Tyrantrum while still providing utility in U-turn and Switcheroo. However, Noivern's bulk, while great for an offensive Pokemon, only allows it to barely avoid KOs from attacks like Virizion's Stone Edge, so any residual damage from sources such as Toxic and Stealth Rock severely cuts into its ability to switch into threats.\n",
    "strategies' format": "RU",
    "strategies": [
        {
            "name": "Support",
            "stats": [
                206,
                158,
                196,
                293,
                197,
                379
            ],
            "type": [
                "Flying",
                "Dragon"
            ],
            "usage": "Don't switch directly into Toxic users like Registeel, as being inflicted with status heavily compromises Noivern's ability to stallbreak. Make use of Noivern's excellent Speed tier and plethora of resistances by revenge killing setup Pokemon like Virizion and checking Pokemon like Golisopod. Make use of U-turn to bring in wallbreakers such as Flame Orb Machamp and Taunt + Roost to stop walls such as Bronzong from making any headway.",
            "moves": [
                [
                    "Hurricane"
                ],
                [
                    "Taunt"
                ],
                [
                    "Roost"
                ],
                [
                    "U-turn"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Infiltrator"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Choice Scarf",
            "stats": [
                206,
                158,
                196,
                293,
                197,
                379
            ],
            "type": [
                "Flying",
                "Dragon"
            ],
            "usage": "Use Noivern as a revenge killer to boosted sweepers like Barbaracle, Feraligatr, and Rock Polish Metagross. Use U-turn to generate momentum by pivoting out of switch-ins like Bronzong. Be cautious when using Draco Meteor; the Special Attack drop could cost you greatly, as it gives setup sweepers such as Feraligatr free turns. Similarly, don't use Switcheroo unless all sweepers are removed, Noivern is faster than them without Choice Scarf, or you have other means of checking them.",
            "moves": [
                [
                    "Hurricane"
                ],
                [
                    "Draco Meteor"
                ],
                [
                    "U-turn"
                ],
                [
                    "Switcheroo"
                ]
            ],
            "item": [
                " Choice Scarf"
            ],
            "ability": [
                "Infiltrator"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Special Walls",
        "Residual Damage",
        "Faster Offensive Threats",
        "Fairy-types",
        "Rock-types"
    ],
    "credits": [
        "Written by roman",
        "Quality checked by zizalith, Mr. Aldo,  and Chrisloud1",
        "Grammar checked by CryoGyro and The Dutch Plumberjack"
    ]
}