{
    "name": "Nosepass",
    "forms": {
        "Base": {
            "base stats": [
                30,
                45,
                135,
                45,
                90,
                30
            ],
            "types": [
                "Rock"
            ],
            "abilities": [
                "Magnet Pull",
                "Sand Force",
                "Sturdy"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "At first Nosepass may seem like a good pick thanks to its access to Sturdy + Berry Juice and Stealth Rock, which allows it to function as a reliable entry hazard setter. It also has great bulk, and its Flying resistance lets it check the metagame's very threatening Flying-types such as Vullaby and Doduo. Furthermore, its access to Volt Switch is especially useful because it allows Nosepass to pivot out of the two most common hazard removers, Staryu and Kabuto, and access to Thunder Wave differentiates it from other Stealth Rock setters. However, its bad Attack and Speed massively limit its offensive presence, making it passive and somewhat vulnerable to being set up on. It is also outclassed by Onix, which is faster and has a greater Defense stat. Its bad defensive typing gives it weaknesses to common threats like Staryu, Mienfoo, and Pawniard. Overall, Nosepass is generally not worth using.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "SturdyJuice Utility",
            "stats": [
                96,
                145,
                401,
                126,
                265,
                86
            ],
            "type": [
                "Rock"
            ],
            "usage": "Sometimes, it is ideal to lead with Nosepass so that Stealth Rock can be used as soon as possible; however, you should watch out for threats such as Taunt Onix and Mienfoo, which are often used as leads too. You should use Thunder Wave if a foe like Shellder is going to set up or if you want to decrease the foe's Speed so that Nosepass's team can deal with it more easily. You should also try to preserve Nosepass's Berry Juice by avoiding Knock Off. Alolan Grimer, Pawniard, and Mienfoo are all examples of common Knock Off users. Keep Nosepass healthy while the opponent has an entry hazard remover, so that Nosepass can set up Stealth Rock again if it gets removed, or Flying-type, so that Nosepass can continue to switch into it throughout the match. You can keep Nosepass healthy by using Volt Switch on predicted switches instead of immediately after taking hits. Be cautious if the opponent has Timburr, which could benefit from paralysis via Guts. It can also set up on Nosepass with Bulk Up. Additionally, you should be wary of Diglett, which can trap and remove Nosepass. You should switch Nosepass in on Pokemon that it can check such as Flying-types like Doduo for a safe opportunity to set up Stealth Rock. Volt Switch should be used to switch out and gain momentum, but be careful if the opponent has a Ground-type.",
            "moves": [
                [
                    "Stealth Rock"
                ],
                [
                    "Rock Blast"
                ],
                [
                    "Thunder Wave"
                ],
                [
                    "Volt Switch"
                ]
            ],
            "item": [
                " Berry Juice"
            ],
            "ability": [
                "Sturdy"
            ],
            "nature": [
                "Relaxed"
            ],
            "ev spread": [
                0,
                76,
                236,
                0,
                196,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Ground-types",
        "Fighting-types",
        "Water-types",
        "Grass-types:"
    ],
    "credits": [
        "Written by MeButYou82",
        "Quality checked by Nineage, Xayah,  and Hilomilo",
        "Grammar checked by The Dutch Plumberjack and Fireflame479"
    ]
}