{"name": "Numel", "forms": {"Base": {"base stats": [60, 60, 40, 65, 45, 35], "types": ["Fire", "Ground"], "abilities": ["Oblivious", "Own Tempo", "Simple"], "tier": ["LC"], "form": "Base"}}, "overview": "Numel can turn into a powerful sweeper with its amazing ability Simple, doubling the magnitude of stat changes, which is complemented by its movepool with access to boosting moves like Flame Charge and Growth and powerful STAB options like Fire Blast and Earth Power. Numel also boasts a great typing, being able to check common Grass-, Steel-, and Fire-types like Ferroseed, Magnemite, and Larvesta and sporting an immunity to Thunder Wave as well as a near-unresisted STAB combination. However, this typing leaves Numel with two weaknesses to common types in Ground and Water, making it vulnerable to Diglett before a Flame Charge boost and extremely weak to Aqua Jet from the likes of Corphish and Tirtouga. Numel is also quite slow before a Flame Charge boost, meaning it's susceptible to faster Pokemon, and even with a Flame Charge boost, it is still outsped by fast Choice Scarf users such as Doduo and Gastly. It's not very strong before a Growth boost either, meaning it requires both boosts to be really effective, which will rarely happen in a match because of how fast paced and offensive the LC metagame is. Lastly, Numel faces competition from Ponyta and Larvesta as an offensive Fire-type due to their reliability, with Ponyta sporting recovery and a better Speed stat and Larvesta being able to pivot while sporting a Fighting-type resistance.\n", "strategies' format": "LC", "strategies": [{"name": "Sweeper", "stats": [165, 140, 116, 247, 126, 165], "type": ["Fire", "Ground"], "usage": "Numel functions as a late-game sweeper, so it is best to remove any checks and counters, especially Aqua Jet users like Corphish and Tirtouga, before sending Numel in. It should also be switched in on Pokemon it threatens out or Pokemon that can't do much damage to it, like Ferroseed, Magnemite, and Pumpkaboo-XL, to let Numel more easily set up with Flame Charge or Growthor get Stealth Rock up. Flame Charge should generally be used before Growth, as Numel is quite slow before a boost and will likely be outsped and KOed by a switch-in otherwise. Groundium Z sets can work as a lure to Staryu wanting to switch in and trying to remove entry hazards and check Numel, OHKOing them after Stealth Rock damage. It is also useful for taking out a very bulky Pokemon such as Spritzee or Timburr during a sweep. On sets that lack Groundium Z, Numel should tank a hit to set up either Growth or Flame Charge, as it wants both boosts to be able to safely sweep.", "moves": [["Flame Charge"], ["Fire Blast"], ["Earth Power"], ["Growth", "Stealth Rock"]], "item": [" Eviolite", " Berry Juice", " Groundium Z"], "ability": ["Simple"], "nature": ["Modest"], "ev spread": [36, 0, 0, 236, 0, 236], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Water-types", "Ground-types", "Revenge Killers", "Archen"], "credits": ["Written by crusty", "Quality checked by Corporal Levi, Xayah,  and Nineage", "Grammar checked by The Dutch Plumberjack and P Squared"]}