{
    "name": "Omanyte",
    "forms": {
        "Base": {
            "base stats": [
                35,
                40,
                100,
                90,
                55,
                35
            ],
            "types": [
                "Rock",
                "Water"
            ],
            "abilities": [
                "Shell Armor",
                "Swift Swim",
                "Weak Armor"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Omanyte has a rock-solid place in the LC metagame thanks to its high Defense, which gives it many setup opportunities, coupled with its high Special Attack, which allows it to pressure the opponent's team at the same time. Omanyte is able to perform two very different roles, each with different counterplay, which gives it a certain measure of unpredictability. First, it can run a Shell Smash set, allowing it to boost its already-high Special Attack and sweep teams in the late-game. Alternatively, it can adopt a supporting role, using Weak Armor to boost its Speed and its wide support movepool to set entry hazards and disrupt the opposing team. In addition, Omanyte's typing gives it key resistances to Flying- and Fire-type moves, but it also gives it weaknesses to the more common Electric-, Grass-, and Fighting-type moves. Omanyte is also held back by its poor Speed, which leaves it reliant on either a Weak Armor or Shell Smash boost to perform its role effectively, and its lack of priority, leaving it susceptible to certain revenge killers.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Shell Smash Sweeper",
            "stats": [
                125,
                104,
                236,
                291,
                146,
                165
            ],
            "type": [
                "Rock",
                "Water"
            ],
            "usage": "Shell Smash Omanyte works as a late-game sweeper, meaning it should virtually always be preserved until its checks and counters are weakened enough for it to sweep, and the priority users that can revenge kill it have been eliminated. Omanyte should usually attempt to set up with Shell Smash when it can secure a turn against a Pokemon whose moves it resists, such as a Flying-type that is locked into its Flying-type STAB attack, a Fire-type, or a more passive Pokemon. After Omanyte has set up, it can sweep with its wide coverage.",
            "moves": [
                [
                    "Shell Smash"
                ],
                [
                    "Hydro Pump",
                    "Surf"
                ],
                [
                    "Ice Beam"
                ],
                [
                    "Earth Power"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Shell Armor"
            ],
            "nature": [
                "Modest"
            ],
            "ev spread": [
                76,
                0,
                0,
                196,
                0,
                236
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Support",
            "stats": [
                125,
                104,
                265,
                269,
                146,
                145
            ],
            "type": [
                "Rock",
                "Water"
            ],
            "usage": "Omanyte can work well at various points throughout a match. On hyper offense teams, it works well as a lead, nearly always surviving an attack and getting two layers of Spikes or Stealth Rock up and putting immediate offensive pressure on the opposing team. Omanyte also cripples common Dwebble and Onix leads with Knock Off, and KOes them with Hydro Pump. On other teams, Omanyte works through the early- and mid-game, switching into resisted Fire-, Ice-, and Flying-type attacks to get a Weak Armor boost and continuing to stack entry hazards or disrupt the opposing team with Knock Off. Omanyte can take advantage of its unpredictability to bluff a Shell Smash set; however, the opponent will be cautious about activating Weak Armor after they know it has Weak Armor, so plan switches to activate Weak Armor accordingly.",
            "moves": [
                [
                    "Spikes",
                    "Stealth Rock"
                ],
                [
                    "Hydro Pump"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Stealth Rock",
                    "Toxic Spikes"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Weak Armor"
            ],
            "nature": [
                "Modest"
            ],
            "ev spread": [
                76,
                0,
                116,
                116,
                0,
                156
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Ferroseed",
        "Super Effective Attacks",
        "Strong Priority",
        "Sturdy and Focus Sash Users",
        "Specially Bulky Pokemon"
    ],
    "credits": [
        "Written by Nineage",
        "Quality checked by Fiend, OP,  and Quote",
        "Grammar checked by fleurdyleurse and piikachuuu"
    ]
}