{
    "name": "Omastar",
    "forms": {
        "Base": {
            "base stats": [
                70,
                60,
                125,
                115,
                70,
                55
            ],
            "types": [
                "Rock",
                "Water"
            ],
            "abilities": [
                "Shell Armor",
                "Swift Swim",
                "Weak Armor"
            ],
            "tier": [
                "PU"
            ],
            "form": "Base"
        }
    },
    "overview": "Omastar's toolkit has great variety both offensively and defensively, letting it perform the role of a threatening setup sweeper with Shell Smash or of a utility entry hazard setter with access to Stealth Rock, Spikes, and Toxic Spikes. Omastar's phenomenal Special Attack stat, coverage options with moves like Ice Beam and Earth Power, and great use of Z-Moves give it both immediate offensive presence and ways of dealing with checks such as Lanturn, Jynx, and Poliwrath. Its flexibility also lies in its abilities, as offensive sets appreciate Weak Armor and Swift Swim creating advantageous positions, while Shell Armor is great for securing its durability defensively. With a large Defense stat and a solid Rock / Water typing, Omastar can find opportunities to set up Shell Smash or hazards on many offensive and defensive Pokemon alike. That same typing and Defense also allow it to act as an effective physical wall capable of checking a variety of threats including Skuntank, Scyther, and Stoutland. However, despite its great offensive presence, Omastar's low Speed inhibits its ability to threaten faster Pokemon like Mesprit and Alolan Raichu before setting up. This flaw also means that even after a boost, it is susceptible to popular Choice Scarf users such as Primeape. For all its advantages with its typing, it suffers from weaknesses to several common types, notably a severe weakness to Grass, which leaves it pressured by STAB or coverage moves from Pokemon like Bellossom and Floatzel. Its Fighting weakness leaves it susceptible to common priority users such as Hitmonchan, Gurdurr, and Poliwrath, while its Electric weakness leaves it vulnerable to Pokemon like Lanturn and Manectric. Its low Special Defense not only worsens this issue against these Grass- and Electric-type Pokemon but also limits Omastar's setup opportunities to situational circumstances like against Choice Specs Froslass locked into Ice Beam.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Shell Smash",
            "stats": [
                176,
                140,
                287,
                361,
                176,
                209
            ],
            "type": [
                "Rock",
                "Water"
            ],
            "usage": "Omastar's game plan varies depending on the opponent's team composition and its item, particularly its Z-Crystal. Waterium Z gives Omastar more leeway in breaking down bulky targets early- to mid-game, as it offers the highest damage output in any situation and can let Omastar break past bulky Pokemon like Clefairy or and Throh without the need of prior damage after a Shell Smash boost. Omastar should aim to set up Shell Smash on forced switches, Choice-locked foes, and Pokemon that can't really threaten it like Scyther, Skuntank, and Type: Null. Omastar doesn't need to set up to threaten Pokemon due to its raw power, good STAB move, and coverage, so against offensive teams, it may be better to simply fire off a powerful unboosted Hydro Pump or Z-Move and nab KOs on slower foes that stay in due to the threat of setting up. Groundium Z variants often need bulky targets whittled down a fair amount before attempting to threaten the opposing team and should otherwise be preserved for when certain bulky Water-types are present for Omastar to break past them. Otherwise, it is often best to avoid attempting a sweep until later in the game where checks are likely weakened and priority users looking to pick Omastar off are removed. Weak Armor can be effective for boosting Omastar's Speed on a timely hit, and thanks to Omastar's high Defense stat, it can capitalize on it Weak Armor by pivoting into moves such as Fake Out from Kangaskhan and Aerial Ace from Scyther. That said, Omastar should avoid switching in too many times, especially when entry hazards on its side of the field are present, as it's important to stay out of range of super effective or powerful priority attacks such as Hitmonchan's Mach Punch, Poliwrath's Vacuum Wave, and Absol's Sucker Punch. Omastar's niche on rain teams stems from its doubled Speed and boosts to its main STAB attack, which let it more liberally threaten opposing teams without setting up. Omastar can also find opportunities to pivot in through momentum from staple teammates such as Mesprit and Liepard and apply pressure whenever possible.",
            "moves": [
                [
                    "Shell Smash"
                ],
                [
                    "Hydro Pump"
                ],
                [
                    "Ice Beam"
                ],
                [
                    "Earth Power",
                    "Hidden Power Grass"
                ]
            ],
            "item": [
                " Groundium Z",
                " Waterium Z",
                " White Herb"
            ],
            "ability": [
                "Weak Armor",
                "Swift Swim"
            ],
            "nature": [
                "Modest",
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                4,
                252,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Defensive Hazard Utility",
            "stats": [
                238,
                140,
                379,
                272,
                176,
                146
            ],
            "type": [
                "Rock",
                "Water"
            ],
            "usage": "Omastar's key role is to pressure the opposing team by racking up entry hazards, and it should use its defensive attributes and attacking options to pivot into Pokemon that it can wall and threaten out, such as Regirock, Skuntank, and Scyther. If the opponent has a Defog user, particularly one susceptible to its coverage options, Omastar should use them sparingly to surprise them on the switch or after putting them in a position where they are pressured to remove the hazards. Omastar should set the proper hazard depending on the opposing team's composition before other hazards. Against teams where pressuring Pokemon like Oricorio-G, Aurorus, and Scyther is important, it should opt to get up Stealth Rock first, while more grounded teams would face more consistent pressure from Spikes or Toxic Spikes. After hazards are set up, Omastar can afford to pressure switch-ins such as Hitmonchan and Lurantis with a potential Scald burn or 2HKO Lurantis with Ice Beam, and it is great at providing consistent damage with its attacks due to its solid Special Attack, even with little investment. This set is vulnerable to strong special attackers such as Drampa and Eelektross throughout the match, so Omastar should pivot out into checks on either a double switch or after it has set up a layer of hazards on their switch.",
            "moves": [
                [
                    "Stealth Rock"
                ],
                [
                    "Spikes"
                ],
                [
                    "Scald"
                ],
                [
                    "Ice Beam",
                    "Hidden Power Electric"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Shell Armor"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                248,
                0,
                236,
                24,
                0,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Lead",
            "stats": [
                176,
                140,
                287,
                329,
                176,
                229
            ],
            "type": [
                "Rock",
                "Water"
            ],
            "usage": "Given that Omastar's Focus Sash is pivotal in granting it opportunities to set up both Stealth Rock and Spikes, it should typically come in early-game, when it is most likely to be preserved. Against a reliable Defog user that Omastar struggles to take down such as Silvally-Water or Articuno, it should either fish for Scald burns, chip it down with the right coverage option, or simply double out into a check that can appropriately pressure them depending on the situation. Using Weak Armor to Omastar's advantage can be very rewarding in the right circumstances, as it allows Omastar to either set up more entry hazards against an opponent trying to pick it off or threaten normally faster threats with its attacks, letting it force switches and add chip damage against the opposing team. Omastar can afford to stay in on powerful attackers and Grass-types liberally, as it has the option of either setting up hazards or weakening them for the rest of the team due to its Focus Sash. If needed, Omastar can stick around to check Pokemon like Kangaskhan, Scyther, and Zangoose in an emergency, being able to pivot into an attack at least once and outspeed them afterward thanks to Weak Armor.",
            "moves": [
                [
                    "Stealth Rock"
                ],
                [
                    "Spikes"
                ],
                [
                    "Scald"
                ],
                [
                    "Ice Beam",
                    "Hidden Power Electric"
                ]
            ],
            "item": [
                " Focus Sash"
            ],
            "ability": [
                "Weak Armor"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                4,
                252,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Water-types",
        "Priority",
        "Faster Pokemon",
        "Specially Defensive Pokemon",
        "Strong Special Attackers",
        "Jynx"
    ],
    "credits": [
        "Written by jklioe",
        "Quality checked by allstarapology, Darkinium,  and Megazard",
        "Grammar checked by TheDutchPlumberjack and A Cake Wearing A Hat"
    ]
}