{
    "name": "Palossand",
    "forms": {
        "Base": {
            "base stats": [
                85,
                75,
                110,
                100,
                75,
                35
            ],
            "types": [
                "Ghost",
                "Ground"
            ],
            "abilities": [
                "Sand Veil",
                "Water Compaction"
            ],
            "tier": [
                "NU"
            ],
            "form": "Base"
        }
    },
    "overview": "Palossand has a small niche in the UnderUsed metagame over other Stealth Rock setters, capable of checking several physical attackers like Mega Aerodactyl, Cobalion, Zeraora, and one of the most threatening wallbreakers in the tier, Terrakion. Its Ground typing gives it an Electric immunity that prevents Mega Manectric and Zeraora from using Volt Switch to switch out, while its Ghost typing gives it a Fighting immunity and resistance to U-turn. However, Palossand is fairly passive and is prone to becoming setup fodder for Pokemon such as Swords Dance Scizor and Nasty Plot Togekiss. Palossand also faces competition from other Stealth Rock setters like Hippowdon, Gligar, Swampert, and even Seismitoad to an extent as it exerts less offensive pressure and has no phazing move. Hippowdon's overall superior bulk and much more useful ability makes it usually a better pick than Palossand.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "Stealth Rock",
            "stats": [
                269,
                167,
                326,
                236,
                209,
                106
            ],
            "type": [
                "Ghost",
                "Ground"
            ],
            "usage": "Palossand is given many opportunities to switch in and set up Stealth Rock. It can easily switch into Cobalion, Terrakion, and physical variants of Infernape and Lucario. Palossand can also pivot into a Volt Switch from Mega Manectric, Zeraora, or Rotom-H and drain vital momentum from the opposing team. Shore Up should be used to keep your Palossand healthy, especially in long matches. Toxic is an overall amazing utility move, and it is imperative that it should be used against opposing walls, Ground-immune Pokemon, and setup sweepers that cannot handle the status. However, you must prevent your Palossand from becoming poisoned itself, as this hinders its longevity. Its Ghost typing makes non-Colbur berry Palossand appear to be weak to Pursuit trappers, but it surprisingly enough doesn't have the worst matchup in the world against them. With proper prediction, it can even beat some trappers like Choice Scarf Krookodile by using Shore Up to scout for Pursuit or Knock Off. However, do not become too paranoid against a Scizor set that you don't know yet, as you could predict wrong, and the Scizor could end up being a Swords Dance variant.",
            "moves": [
                [
                    "Stealth Rock"
                ],
                [
                    "Earth Power"
                ],
                [
                    "Shore Up"
                ],
                [
                    "Toxic"
                ]
            ],
            "item": [
                " Leftovers",
                " Colbur Berry"
            ],
            "ability": [
                "Water Compaction"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                252,
                0,
                164,
                0,
                92,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Dark-types",
        "Water-types",
        "Ground-immune Pokemon",
        "Status-resistant Setup Sweepers",
        "Ice-types",
        "Ghost-types"
    ],
    "credits": [
        "Written by BackAtYouBro",
        "Quality checked by Amane Misa, A Cake Wearing A Hat,  and Hilomilo",
        "Grammar checked by A Cake Wearing A Hat and Electrolyte"
    ]
}