{
    "name": "Pancham",
    "forms": {
        "Base": {
            "base stats": [
                67,
                82,
                62,
                46,
                48,
                43
            ],
            "types": [
                "Fighting"
            ],
            "abilities": [
                "Iron Fist",
                "Mold Breaker",
                "Scrappy"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Pancham's access to Parting Shot in combination with its solid bulk and great Attack turns it into an excellent pivot capable of easily giving setup sweepers a free switch. Its wide movepool also includes Swords Dance, which can potentially turn it into a powerful wallbreaker or, with Sticky Web support, even a sweeper, and good coverage options such as Gunk Shot and Zen Headbutt, setting it apart from other Fighting-types.\nHowever, despite these unique traits, Pancham faces stiff competition as a Fighting-type from Mienfoo and Timburr, of which the former is faster and has Regenerator, giving it a form of recovery, and the latter has Guts and priority in Mach Punch, mitigating its low Speed and giving it an easier time setting up. Pancham also suffers from a low Speed stat, which means it is usually forced to take a hit before attacking and thus easily worn down.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Parting Shot Pivot",
            "stats": [
                170,
                269,
                185,
                115,
                185,
                125
            ],
            "type": [
                "Fighting"
            ],
            "usage": "Pancham can be switched in on the Pokemon it threatens, such as Pawniard, Ferroseed, and Tirtouga, to create opportunities to dent the opponent's walls or generate momentum with Parting Shot. However, Pancham tends to get worn down quickly, so be careful not to switch it in too often and to preserve it for the threats it needs to beat. Be careful of using Parting Shot if the opponent has a Pawniard or Snivy: they both get offensive boosts if they are hit by the move. In the late-game, Parting Shot should be used to pivot into a powerful cleaner such as Shellder or Nasty Plot Vullaby, as the stat drops can give them the opportunity they need to set up and win the game.",
            "moves": [
                [
                    "Parting Shot"
                ],
                [
                    "Drain Punch"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Gunk Shot",
                    "Zen Headbutt"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Iron Fist",
                "Mold Breaker"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                0,
                180,
                100,
                0,
                212,
                12
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Swords Dance Wallbreaker",
            "stats": [
                170,
                269,
                185,
                115,
                185,
                125
            ],
            "type": [
                "Fighting"
            ],
            "usage": "Pancham should be brought in on Pokemon it threatens out, such as Pawniard, Ferroseed, and Tirtouga. The opportunities created by these forced switches should be used to dent the opponent's switch-in and remove items in the early-game. In the late-game, these opportunities should be used to set up a Swords Dance to sweep the opponent's team or remove walls for your sweeper. If Pancham is being used as a wallbreaker for your team, setting up a Swords Dance can be useful, as it allows Pancham to power through walls even more quickly. Since Pancham will usually not be using Drain Punch on forced switches with this set, it tends to be worn down very quickly. As such, it should not be used as the primary counter for any Pokemon, but should instead focus on wallbreaking with the power boost from Swords Dance. If your team has Sticky Web, Pancham should be preserved until the late-game in order to set up a Swords Dance and sweep the opponent's team.",
            "moves": [
                [
                    "Swords Dance"
                ],
                [
                    "Drain Punch"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Gunk Shot",
                    "Zen Headbutt"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Mold Breaker",
                "Iron Fist"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                0,
                180,
                100,
                0,
                212,
                12
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Poison-types",
        "Fairy-types",
        "Revenge Killers",
        "Parting Shot Switch-ins",
        "Will-O-Wisp Users"
    ],
    "credits": [
        "Written by Xayah",
        "Quality checked by Fiend, Nineage,  and OP",
        "Grammar checked by The Dutch Plumberjack and Mr. Uncompetitive"
    ]
}