{
    "name": "Passimian",
    "forms": {
        "Base": {
            "base stats": [
                100,
                120,
                90,
                40,
                60,
                80
            ],
            "types": [
                "Fighting"
            ],
            "abilities": [
                "Defiant",
                "Receiver"
            ],
            "tier": [
                "NU"
            ],
            "form": "Base"
        }
    },
    "overview": "Passimian takes the role of a capable revenge killer in the NU metagame thanks to the combination of its formidable attacking power, good bulk, and relatively high Speed tier, enabling it to fit on a variety of teams. Possessing a great movepool consisting of good coverage options such as Knock Off, Gunk Shot, and Earthquake alongside a pivot move in U-turn lets Passimian break through certain checks depending on what moves it chooses to run. Its Fighting typing allows it to check the majority of Dark-, Ice-, and Steel-types in the tier such as Incineroar, Mega Glalie, and Klinklang, making it a valuable choice on more offensive teams that need a reliable revenge killer for the aforementioned threats. While it has a good Speed tier, it still can be outsped by quite a few offensive Pokemon, such as opposing Choice Scarf users like Scyther, Delphox, and Rotom, alongside Vivillon and Klinklang after a setup boost. Passimian's ability Receiver is rather useless, meaning it has a hard time differentiating itself compared to other Fighting-types such as Hitmonlee, Medicham, and Hariyama due to it solely relying on its moveset and stats to outline itself. It can also be worn down rather quickly due to the lack of reliable recovery, which is further problematic because of its tendency to pivot in repeatedly against common threats such as Incineroar, Sneasel, and Klinklang throughout the match, leading to it being chipped quite easily at times.\n",
    "strategies' format": "NU",
    "strategies": [
        {
            "name": "Choice Scarf",
            "stats": [
                236,
                339,
                217,
                104,
                156,
                284
            ],
            "type": [
                "Fighting"
            ],
            "usage": "Passimian is generally utilized to provide momentum for its team when utilizing a Choice Scarf, as its ability to force switches enables it to pivot out against the majority of threats with ease thanks to U-turn. While it is generally preferred to pivot out versus the opposing threat, Passimian should also be mindful if the opponent decides to stay in, in which case using one of its coverage moves may be more desirable. However, it must be mindful of mindlessly spamming its STAB move in Close Combat, as it can often leave it in a predicament where it is forced to switch out, as threats such as Rotom and Palossand can easily come in and gain momentum. Although Passimian possesses substantial bulk, it should not be used to sponge hits coming off of powerful offensive threats, as it can easily be worn down rather quickly. This means that Passimian should generally be coming in against defensive threats that do not threaten it, such as Miltank and Silvally-Steel. Knock Off is a great move that can be spammed the majority of the time when Passimian is not pivoting out via U-turn, as Knock Off can even cripple threats that resist it by removing useful items such as Leftovers, pinch Berries, and Assault Vest from threats like Vaporeon, Incineroar, and Hariyama.",
            "moves": [
                [
                    "Close Combat"
                ],
                [
                    "U-turn"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Gunk Shot",
                    "Earthquake"
                ]
            ],
            "item": [
                " Choice Scarf"
            ],
            "ability": [
                "Defiant"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fairy-types",
        "Ghost-types",
        "Physically Defensive Walls",
        "Poison-types",
        "Faster Offensive Threats"
    ],
    "credits": [
        "Written by Funbot28",
        "Quality checked by quziel, kay,  and Eternally",
        "Grammar checked by martha and Fireflame479"
    ]
}