{"name": "Pelipper", "forms": {"Base": {"base stats": [60, 50, 100, 95, 70, 65], "types": ["Water", "Flying"], "abilities": ["Drizzle", "Keen Eye", "Rain Dish"], "tier": ["OU"], "form": "Base"}}, "overview": "Pelipper's ability Drizzle makes it a staple on rain teams because it supports dangerous rain sweepers such as Mega Swampert, Ash-Greninja, Kingdra, and Qwilfish. Pelipper's typing allows it to check Pokemon such as Mega Scizor, defensive Landorus-T, Mega Charizard Y, and Choice Scarf Keldeo, the latter two of which are huge problems for rain teams. Pelipper's solid STAB moves and wide support movepool mean it can assist rain teams in two ways. On one hand, Pelipper can run a defensive Damp Rock set to extend rain turns and provide help its teammates switch in freely with its slow U-turn. On the other, Pelipper can break down conventional rain checks such as Toxapex and Ferrothorn with a Choice Specs set. Pelipper does have mediocre stats, however, which means it is easy to pressure and keep out with Pokemon such as Ash-Greninja, Tornadus-T, and Tapu Koko. Pelipper loses one-on-one to Tyranitar and Mega Charizard Y, which replace the rain with their own weather. Pelipper is also weak to Stealth Rock, which makes it an even more unreliable Defogger because it has to switch into the entry hazard to remove it.\n", "strategies' format": "OU", "strategies": [{"name": "Defensive", "stats": [218, 122, 269, 226, 232, 166], "type": ["Water", "Flying"], "usage": "Pelipper is a fine choice as a lead to set up rain right away. Pelipper is often paired with Mega Swampert, so leading with Pelipper does not lose much momentum if the opponent decides to lead with an Electric-type Pokemon. Pelipper should be played conservatively and should only be sacrificed for rain turns if its teammates can win the game with the remaining turns of rain. Because Pelipper is so important for rain teams to function, it should scout out potential Z-Moves that could eliminate it, such as Continental Crush from Landorus-T and Bloom Doom from Heatran. Roost should be used to keep Pelipper healthy so it can come in on Stealth Rock safely. It is often best to use U-turn more than Scald to keep momentum, unless a threat such as Celesteela or Ferrothorn needs to be burned so Pelipper's teammates can handle it better.", "moves": [["Scald"], ["U-turn"], ["Roost"], ["Defog", "Hurricane"]], "item": [" Damp Rock"], "ability": ["Drizzle"], "nature": ["Bold"], "ev spread": [248, 0, 36, 0, 224, 0], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Specs", "stats": [156, 122, 236, 317, 177, 229], "type": ["Water", "Flying"], "usage": "Pelipper is very frail without defensive investment, fainting to many special attacks such as Greninja's Choice Specs-boosted Dark Pulse and Tapu Lele's Psychic. Because of this, Pelipper should come in on Pokemon it has a good matchup against defensively, such as Mega Charizard Y, defensive Landorus-T, Mega Scizor, and Mew. Pelipper can use VoltTurn support to get in, too. While Hydro Pump is Pelipper's strongest attack, Hurricane is usually more threatening early-game because it threatens a lot of defensive pivots in the tier such as Toxapex and Tangrowth. While this variant of Pelipper only brings five turns of rain, it should still be preserved because teammates such as Mega Swampert and Kingdra depend on it.", "moves": [["Hydro Pump"], ["Hurricane"], ["Surf", "Knock Off"], ["U-turn"]], "item": [" Choice Specs"], "ability": ["Drizzle"], "nature": ["Modest"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Electric-types", "Opposing Weather Setters", "Stealth Rock", "Special Attackers", "Chansey"], "credits": ["Written by Vertex", "Quality checked by Gary, p2,  and Subject 18", "Grammar checked by frenzyplant and The Dutch Plumberjack"]}