{"name": "Pikipek", "forms": {"Base": {"base stats": [35, 75, 30, 30, 30, 65], "types": ["Normal", "Flying"], "abilities": ["Keen Eye", "Pickup", "Skill Link"], "tier": ["LC"], "form": "Base"}}, "overview": "At first glance, Pikipek may seem an underwhelming choice; it boasts overall mediocre stats, has almost nonexistent defenses, and does not have many coverage options. Secondly, there are stronger Flying-types like Doduo, Archen, and Rufflet that can work better than Pikipek, which has to rely on Brave Bird and Life Orb to deal significant damage, meaning that it will constantly lose its HP in the process; this combined with a weakness to Stealth Rock makes it difficult for Pikipek to be efficient. However, Pikipek carves itself a small niche that makes it truly shine and, more importantly, it doesn't share with any other Flying-type Pokemon in LC: access to Bullet Seed and Skill Link, meaning that it can remove Rock-types with ease, even Sturdy + Berry Juice ones. It also sports respectable Attack and Speed stats, letting it deal a solid amount of damage with its STAB or coverage moves and outspeed Pokemon such as Pawniard and Rufflet with ease. While far from being the premier LC Flying-type, Pikipek can prove to be a good pick on teams searching a way to beat opposing leads and check a good number of Rock- and Water-types.\n", "strategies' format": "LC", "strategies": [{"name": "Choice Scarf", "stats": [106, 245, 105, 86, 96, 247], "type": ["Normal", "Flying"], "usage": "Choice Scarf Pikipek should be brought in early in the match, as it can be useful to gain momentum against the opposing lead, or to eliminate the opposing lead itself with Bullet Seed (in Onix's case) or severely dent it with a Brave Bird (in Mienfoo's case). U-turn or coverage moves should be used when a switch is predicted. Remember that Choice Scarf Pikipek is not going to punch huge holes in the opposing team; it should be played with \"hit-and-run\" tactics, with frequent switches out or U-turn uses, unless the opponent lacks a way to stop Pikipek; in that case, just spam Brave Bird or Bullet Seed on frail and slower enemies. Pikipek applies a large amount of pressure on its checks when it's paired with other powerful Flying-types such as Archen and Vullaby; the aforementioned partners can severely weaken the Flying-type checks, leaving Pikipek free to pick them all off.", "moves": [["Brave Bird"], ["Bullet Seed"], ["Brick Break", "Drill Peck"], ["U-turn"]], "item": [" Choice Scarf"], "ability": ["Skill Link"], "nature": ["Jolly", "Adamant"], "ev spread": [0, 236, 36, 0, 0, 236], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Life Orb", "stats": [85, 245, 105, 86, 96, 247], "type": ["Normal", "Flying"], "usage": "This set can be used in the first turns of the match to gain momentum against opposing leads; however, keep in mind that Jolly Pikipek Speed ties with Jolly non-Choice Scarf Mienfoo and, more dangerously, with Jolly Onix. Pikipek can work more efficiently when priority users (specifically Pawniard) and faster Electric- and Rock-types (including Choice Scarf Chinchou and Archen) are removed from the field. When using Pikipek, prediction is essential; even though Brave Bird or Drill Peck should be the move to spam the most, Bullet Seed should be used when a Chinchou or Rock-type switch-in is predicted, since it has a very high chance to KO speedy variants of Chinchou, while Brick Break or Flame Charge should be used only when it's obvious that a Steel-type is entering the battlefield or when the opponent struggles to deal with a +1 Speed Pikipek.", "moves": [["Brave Bird", "Drill Peck"], ["Bullet Seed"], ["Brick Break", "Flame Charge"], ["Flame Charge", "Substitute", "U-turn"]], "item": [" Life Orb"], "ability": ["Skill Link"], "nature": ["Jolly"], "ev spread": [0, 236, 36, 0, 0, 236], "iv spread": [10, 31, 31, 31, 31, 31]}], "counters": ["Steel-types", "Rock-types", "Electric-types", "Revenge Killers and Strong Priority Users", "Status Ailments and Residual Damage"], "credits": ["Written by Alolan Dusky", "Quality checked by OP, Corporal Levi,  and Fiend", "Grammar checked by CryoGyro and The Dutch Plumberjack"]}