{
    "name": "Piloswine",
    "forms": {
        "Base": {
            "base stats": [
                100,
                100,
                80,
                60,
                60,
                50
            ],
            "types": [
                "Ice",
                "Ground"
            ],
            "abilities": [
                "Oblivious",
                "Snow Cloak",
                "Thick Fat"
            ],
            "tier": [
                "NU"
            ],
            "form": "Base"
        }
    },
    "overview": "Piloswine is a solid Pokemon in NU due to its access to Stealth Rock and its powerful STAB combination, which allows it to simultaneously threaten most other Stealth Rock users, Rapid Spin users, Defog users, and Xatu, the sole NU Pokemon with Magic Bounce. On top of this, Piloswine is immune to Volt Switch, which combined with its bulk makes it a great offensive check to Electric-types. Thick Fat allows Piloswine to be one of the most reliable switch-ins to opposing Ice-types in NU. Piloswine is quite slow and has a poor matchup against common Pokemon such as Passimian and defensive Slowking.\n",
    "strategies' format": "NU",
    "strategies": [
        {
            "name": "Stealth Rock",
            "stats": [
                299,
                328,
                197,
                140,
                156,
                136
            ],
            "type": [
                "Ice",
                "Ground"
            ],
            "usage": "With Piloswine, try to get Stealth Rock up and use Earthquake as much as possible in order to maximize Piloswine's damage output, especially if the opposing team lacks a Ground-immune Pokemon. Icicle Crash is most often used when playing against a team with multiple Pokemon immune to Earthquake, such as Mismagius, Rotom, and Braviary. Piloswine can pivot into most Electric-types quite easily and attack back, although it must be wary of switching into Heliolisk and Rotom because they can cripple it with Surf and Will-O-Wisp, respectively.",
            "moves": [
                [
                    "Stealth Rock"
                ],
                [
                    "Earthquake"
                ],
                [
                    "Ice Shard"
                ],
                [
                    "Icicle Crash"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Thick Fat"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                252,
                252,
                4,
                0,
                0,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Bulky Water-types",
        "Bulky Fighting-types",
        "Offensive Grass-types",
        "Cryogonal"
    ],
    "credits": [
        "Written by Raseri",
        "Quality checked by Eternally, Hootie,  and Kiyo",
        "Grammar checked by frenzyplant and Fireflame479"
    ]
}