{
    "name": "Pinsir",
    "forms": {
        "Base": {
            "base stats": [
                65,
                125,
                100,
                55,
                70,
                85
            ],
            "types": [
                "Bug"
            ],
            "abilities": [
                "Hyper Cutter",
                "Mold Breaker",
                "Moxie"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        },
        "Mega": {
            "base stats": [
                65,
                155,
                120,
                65,
                90,
                105
            ],
            "types": [
                "Bug",
                "Flying"
            ],
            "abilities": [
                "Aerilate"
            ],
            "tier": [
                "OU"
            ],
            "form": "Mega"
        }
    },
    "overview": "Mega Pinsir is an extremely powerful wallbreaker thanks to Aerilate and its high Attack, which can be boosted further with Swords Dance. It possesses good coverage options in Earthquake and Close Combat. Aerilate-boosted Quick Attack uniquely gives Mega Pinsir Flying-type priority that lets it pick off Pokemon like Volcarona and weakened Greninja, two troubling Pokemon for offense. Mega Pinsir is also faster than many other wallbreakers such as Mega Mawile, Mega Medicham, Mega Heracross, and Tapu Bulu, as well as some offensive Pokemon such as Garchomp and Tapu Lele due to its high Speed stat. However, Mega Pinsir's typing leaves it with a nasty Stealth Rock weakness, making solid entry hazard control support highly recommended, something that not many offensive teams are able to afford. It also faces slight competition for the Mega slot with Mega Medicham, Mega Mawile, and Mega Heracross, all of which are very scary wallbreakers that require less support and have more coverage options; Mega Mawile in particular has much more defensive presence. Mega Pinsir is also relatively frail on the special side and has a mediocre defensive typing.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Wallbreaker",
            "stats": [
                166,
                409,
                277,
                149,
                216,
                339
            ],
            "type": [
                "Bug",
                "Flying"
            ],
            "usage": "Mega Pinsir is a wallbreaker first and a sweeper second. Only aim to sweep with it if the opponent's team is heavily weak to it; otherwise, focus on using it to weaken walls for teammates. Against more defensively inclined teams without decent Flying-resistant Pokemon, aim to set up Swords Dance on more passive Pokemon like Toxapex (watch out for Scald burns, though), or start punching holes for teammates, as Mega Pinsir forces out Pokemon like Tangrowth and Tapu Bulu. If the opponent has a Skarmory or another solid Flying switch-in, fire off Return early-game to soften them up, either for teammates or Mega Pinsir itself if it's running Close Combat. Against more offensively inclined teams, fire off Return to weaken pivots, as even unboosted Return hits quite hard coming from Mega Pinsir. It might be a good idea to hold off Mega Evolving in some cases, as Hyper Cutter can be useful. Because Pinsir is grounded before Mega Evolving, it can set up Swords Dance on Tapu Fini without risking a Scald burn due to Misty Terrain, and it takes less damage from Stealth Rock.",
            "moves": [
                [
                    "Swords Dance"
                ],
                [
                    "Return"
                ],
                [
                    "Earthquake",
                    "Close Combat"
                ],
                [
                    "Quick Attack"
                ]
            ],
            "item": [
                " Pinsirite"
            ],
            "ability": [
                "Hyper Cutter"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Electric-types",
        "Steel-types",
        "Psychic Terrain",
        "Faster Attackers"
    ],
    "credits": [
        "Written by Niadev",
        "Quality checked by Gary, Colonel M,  and Finchinator",
        "Grammar checked by Lemonade and Fireflame479"
    ]
}