{
    "name": "Piplup",
    "forms": {
        "Base": {
            "base stats": [
                53,
                51,
                53,
                61,
                56,
                40
            ],
            "types": [
                "Water"
            ],
            "abilities": [
                "Defiant",
                "Torrent"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Piplup has a niche as one of the few LC Pokemon that can both set up hazards with Stealth Rock and get rid of the opponent's with Defog, giving it decent role compression. It's also a Defog user that isn't weak to Stealth Rock, allowing it to switch in more easily. Supporting this are its decent defenses and good defensive typing, letting it take resisted attacks and some neutral ones. Its access to a Water-type STAB move in Scald lets it beat most traditional Stealth Rock setters like Onix and Dwebble. However, Piplup is extremely passive, making it setup bait for sweepers like Shellder and Calm Mind Spritzee. It is also forced into performing its predictable niche, as it's outclassed as a Water-type attacker by Chinchou and defensive Staryu due to their better Speed and movepools. Piplup has access to no recovery outside of Rest, making it prone to getting worn down over time. Finally, it faces competition from Kabuto, a Water-type hazard setter with Rapid Spin, Knock Off, and Weak Armor, as well from Slowpoke and Mareanie, bulkier Water-types with access to Regenerator and recovery.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Utility",
            "stats": [
                165,
                124,
                225,
                158,
                185,
                116
            ],
            "type": [
                "Water"
            ],
            "usage": "Piplup should focus on hazard control and not be used for offensive purposes, as its offensive presence is incredibly low. It performs best when coming in on a slow Volt Switch or U-turn, as it doesn't get worn down as quickly. Piplup functions as a decent lead, as it can beat other common leads like Onix and Dwebble. It also has good bulk, so it can usually switch in on resisted and neutral hits. However, Piplup lacks recovery, so try to avoid switching it in often, especially into powerful attacks like Pawniard's Knock Off and Doduo's Brave Bird. Be careful about using Defog if there is a Pawniard on the other team, as it can switch in and get a +2 Attack boost thanks to Defiant. Finally, Defog can remove all hazards, including the ones you've set, so it can be counterproductive if used directly after Stealth Rock. Try using Defog before using Stealth Rock.",
            "moves": [
                [
                    "Stealth Rock"
                ],
                [
                    "Defog"
                ],
                [
                    "Scald"
                ],
                [
                    "Ice Beam"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Torrent"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                92,
                0,
                252,
                0,
                148,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Bulky Grass-types",
        "Taunt Users",
        "Electric-types",
        "Water-types",
        "Residual Damage"
    ],
    "credits": [
        "Written by Gummy",
        "Quality checked by Xayah, Hilomilo,  and Corporal Levi",
        "Grammar checked by P Squared and Fireflame479"
    ]
}