{
    "name": "Poliwag",
    "forms": {
        "Base": {
            "base stats": [
                40,
                50,
                40,
                40,
                40,
                90
            ],
            "types": [
                "Water"
            ],
            "abilities": [
                "Damp",
                "Swift Swim",
                "Water Absorb"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "With its excellent Speed stat and access to Belly Drum, Poliwag can make a decent sweeper for offensive teams. Its access to Hypnosis can also help it set up and gives it a small niche over other Belly Drum users. However, better Belly Drum users such as Zigzagoon and, to an extent, Magby do a much better job at sweeping due to their access to good priority options. Poliwag is also held back by its relatively small movepool and paper-thin defenses, which keep it from finding reliable setup opportunities. It is incredibly vulnerable to being revenge killed by Choice Scarf and priority users as well. Finally, Poliwag needs a lot of support to even be worth using over other offensive Water-types and Belly Drum users.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Belly Drum",
            "stats": [
                145,
                185,
                116,
                104,
                116,
                291
            ],
            "type": [
                "Water"
            ],
            "usage": "Be sure to conserve Poliwag for late-game, as its primary role is a late-game sweeper. However, sometimes Poliwag can come in on more passive Pokemon such as Spritzee and proceed to sweep. Also, avoid switching Poliwag into attacks, as its paper-thin defenses will usually result in it being KOed. The one exception to this is switching into Water-type attacks, as Water Absorb will absorb them, although this is incredibly dangerous and should only be done when you are sure the foe will use a Water-type move. Instead, try to get Poliwag in with a Volt Switch or U-turn user or after one of your Pokemon has fainted. Before Poliwag sets up, it is a good idea to use Hypnosis to cripple the foe by putting them to sleep. Be sure to eliminate all revenge killers, primarily faster Pokemon, priority users, and Abra, as they can stop Poliwag's sweep quite quickly. Also, be sure to eliminate Ferroseed and Lileep if Poliwag is not running Wake-Up Slap and Frillish and Pumpkaboo-XL if Poliwag is not running Thief.",
            "moves": [
                [
                    "Belly Drum"
                ],
                [
                    "Waterfall"
                ],
                [
                    "Hypnosis",
                    "Thief"
                ],
                [
                    "Return",
                    "Thief"
                ]
            ],
            "item": [
                " Berry Juice"
            ],
            "ability": [
                "Water Absorb"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                116,
                196,
                0,
                0,
                0,
                196
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Bulky Water-resistant Pokemon",
        "Faster Pokemon",
        "Priority"
    ],
    "credits": [
        "Written by Drew",
        "Quality checked by Xayah, Hilomilo,  and Corporal Levi",
        "Grammar checked by Fireflame479 and Eyan"
    ]
}