{
    "name": "Poliwrath",
    "forms": {
        "Base": {
            "base stats": [
                90,
                95,
                95,
                70,
                90,
                70
            ],
            "types": [
                "Water",
                "Fighting"
            ],
            "abilities": [
                "Damp",
                "Swift Swim",
                "Water Absorb"
            ],
            "tier": [
                "PU"
            ],
            "form": "Base"
        }
    },
    "overview": "Poliwrath is a strong option in the PU metagame thanks to its unique defensive typing and ability, which allow it to combat many of the tier's top threats including Jellicent, Aggron, Lycanroc, Omastar, and Skuntank. Aside from extreme role compression, Poliwrath also has a diverse enough movepool to allow it to run a range of offensive and defensive sets as both a physical and special attacker while still managing to keep the aforementioned threats in check. Poliwrath is also one of the few Pokemon with access to moves and abilities such as Circle Throw, Vacuum Wave, and Water Absorb, which are extremely useful for phazing in conjunction with Spikes, revenge killing Omastar, and checking Water-types, respectively. However, Poliwrath's stats are incredibly average, meaning that it can't specialize or excel in any offensive or defensive roles outside of checking the same list of Pokemon. While Poliwrath's typing is extremely good for checking specific Rock- and Water-types, it also leaves Poliwrath vulnerable to a wide range of common Grass-, Flying-, Electric-, and Psychic-types, meaning that almost every team will naturally have multiple Poliwrath checks such as Scyther and Mesprit. Lack of reliable recovery means that Poliwrath must use unreliable means such as Rest or a combination of Leftovers and Protect to avoid being worn down too quickly. Poliwrath also faces some competition from other Fighting- and Water-types such as Gurdurr and Lanturn, but while it will usually be outclassed in terms of raw bulk or strength, its niche is incredibly solid because nothing can compress roles quite like Poliwrath.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Special Tank",
            "stats": [
                279,
                203,
                226,
                216,
                216,
                220
            ],
            "type": [
                "Water",
                "Fighting"
            ],
            "usage": "Be very thoughtful about how Poliwrath's health is preserved. It is often used to switch into a number of different things, and prioritizing whether it's more important to switch directly into Aggron early-game or play around Aggron by other means and keep Poliwrath healthy for checking Omastar late-game can be a critical decision. If running Ice Beam, don't reveal it too early and obviously. Keeping Poliwrath's fourth moveslot vague can be quite useful in catching opponents off guard. Scald is Poliwrath's most spammable move due to its ability to burn switch-ins and Focus Blast's unreliability, but be aware that there are some foes such as Oricorio-E that Poliwrath would much rather cripple with Toxic than burn. Spreading status with Toxic is also a relatively safe option, as most Poliwrath switch-ins like Lurantis and Swanna are extremely averse to being badly poisoned. However, you'll want to avoid spamming Scald if facing teams with Clefairy. Protect is incredibly valuable, but it is also risky; as good as stalling for Toxic and Leftovers recovery is, you should be cautious about giving threats like Alolan Raichu free turns to set up.",
            "moves": [
                [
                    "Scald"
                ],
                [
                    "Focus Blast"
                ],
                [
                    "Toxic"
                ],
                [
                    "Protect",
                    "Vacuum Wave",
                    "Ice Beam"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Water Absorb"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                252,
                0,
                0,
                160,
                0,
                96
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Physically Defensive",
            "stats": [
                279,
                226,
                317,
                176,
                217,
                158
            ],
            "type": [
                "Water",
                "Fighting"
            ],
            "usage": "Use Rest whenever needed to keep Poliwrath healthy enough to switch into threats such as Assault Vest Crabominable. However, you should also attempt to avoid doing so whenever it isn't completely necessary, because it forces Poliwrath to rely on Sleep Talk. When lots of entry hazards are up on the opponent's side, use Circle Throw frequently to rack up chip damage. When no hazards are set up, spamming Scald to fish for burns is generally more effective. Poliwrath is a somewhat common and predictable switch-in to many Pokemon including Aggron, Lycanroc, Omastar, and Alolan Raticate, but beware of double switches or somewhat lure sets such as Normalium Z Omastar and Zen Headbutt Carracosta.",
            "moves": [
                [
                    "Circle Throw"
                ],
                [
                    "Scald"
                ],
                [
                    "Rest"
                ],
                [
                    "Sleep Talk"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Water Absorb"
            ],
            "nature": [
                "Relaxed"
            ],
            "ev spread": [
                252,
                0,
                252,
                0,
                4,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Type-advantaged Pokemon",
        "Specially Defensive Pokemon",
        "Chip Damage"
    ],
    "credits": [
        "Written by Megazard",
        "Quality checked by Darkinium, Jklioe,  and 2xTheTap",
        "Grammar checked by The Dutch Plumberjack and lotiasite"
    ]
}