{
    "name": "Primarina",
    "forms": {
        "Base": {
            "base stats": [
                80,
                74,
                74,
                126,
                116,
                60
            ],
            "types": [
                "Water",
                "Fairy"
            ],
            "abilities": [
                "Liquid Voice",
                "Torrent"
            ],
            "tier": [
                "UU"
            ],
            "form": "Base"
        }
    },
    "overview": "Primarina is a fearsome wallbreaker in the UU tier, possessing a high Special Attack stat that is complemented nicely by its fantastic offensive and defensive typing in Water / Fairy. Its typing along with its solid natural special bulk allows it to reliably handle Hydreigon as well as stomach hits from threats like Moltres, Chandelure, and Mega Pidgeot and KO in return. However, Primarina is ultimately held back by its lackluster Defense stat, worsening its one-on-one matchup against common Pokemon like Mega Aerodactyl, Scizor, and Dragon Dance Mega Altaria. Additionally, due to its low Speed stat, Primarina is often forced to take damage in order to get off attacks of its own, ultimately limiting its longevity in combination with its vulnerability to all entry hazards.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "Choice Specs",
            "stats": [
                219,
                165,
                184,
                386,
                268,
                197
            ],
            "type": [
                "Water",
                "Fairy"
            ],
            "usage": "Primarina is best used early- to mid-game to punch holes for teammates, ideally being brought in on double switches and free switches from U-turn or Volt Switch to preserve its health to handle hits better later on in the match. Primarina does a terrific job of threatening common Stealth Rock users such as Rhyperior, Hippowdon, and Swampert, and it should be used aggressively to take advantage of them early-game. If expecting a hard Primarina counter like Blissey or Empoleon to come in, it is often better to double switch to a teammate that threatens them in order to maintain momentum. Be wary of locking into Psychic, as though it can nab Tentacruel and Amoonguss on the switch, it is easily exploited by common threats like Scizor, Latias, and Krookodile. While Primarina's ability to often stomach a powerful hit and deal huge damage in return to foes is a valuable tool, determine when it is necessary to do so, as it often leaves Primarina too weak to perform its role defensively. Primarina is easily worn down and should be kept at a sufficient amount of HP to check Pokemon like Hydreigon and Infernape if necessary. Entry hazards play a major role in wearing down Primarina, and they should be cleared by teammates whenever needed.",
            "moves": [
                [
                    "Hydro Pump"
                ],
                [
                    "Moonblast"
                ],
                [
                    "Sparkling Aria",
                    "Scald"
                ],
                [
                    "Psychic"
                ]
            ],
            "item": [
                " Choice Specs"
            ],
            "ability": [
                "Torrent"
            ],
            "nature": [
                "Modest"
            ],
            "ev spread": [
                92,
                0,
                0,
                252,
                0,
                164
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Defensive",
            "stats": [
                259,
                165,
                271,
                288,
                269,
                156
            ],
            "type": [
                "Water",
                "Fairy"
            ],
            "usage": "Switch Primarina into Pokemon whose STAB moves it resists, including Crawdaunt, Mega Sharpedo, Hydreigon, Kyurem, and Infernape. Be wary of switching Primarina into Pokemon such as Volcanion and Haxorus, though; even though Primarina resists their STAB moves, they are likely to carry super effective coverage in Sludge Bomb and Poison Jab, respectively. However, in Dragon Dance Haxorus's case, a healthy Primarina can survive even a boosted hit and revenge kill it. Generally, scouting for super effective coverage moves on Pokemon Primarina may attempt to beat, such as Acid Downpour on Hydreigon and Gunk Shot on Infernape, is ideal. Early-game, it is advised to use Scald, as it is very spammable and can potentially burn foes and wear them down. A burn from Scald helps Primarina beat Pokemon like Empoleon and Tentacruel that often rely on passive recovery to beat it and cripples other common switch-ins like Amoonguss. Moonblast should be used mid- to late-game, as it is slightly more powerful than Scald and OHKOes certain Pokemon Scald doesn't, such as Krookodile and Crawdaunt. Moonblast can also be used to pressure opposing Water-types like Alomomola and Empoleon, especially if they are burned. Because of its lack of reliable recovery, Primarina should be using Rest as often as it can to take on threats like Krookodile and Infernape throughout the match. Thanks to Rest, Primarina can also act as a status absorber, as it can come in on Toxic users such as Hippowdon and Empoleon and heal itself with Rest. Sleep Talk should almost always be used if Primarina is asleep and it is in its favor to stay in so it is not completely inactive and may still attempt to burn or hit an opposing Pokemon with a STAB move. However, in the rare cases when Primarina needs to save PP, it should not use Sleep Talk every turn it is asleep. Despite having super effective coverage for Latias, Primarina must be wary of staying in on it, as Calm Mind sets can set up on this variant of Primarina and heal off the damage taken with Roost. Furthermore, to avoid unnecessary risks, if Primarina is asleep, it shouldn't stay in on setup sweepers like Scizor and Cobalion.",
            "moves": [
                [
                    "Scald"
                ],
                [
                    "Moonblast"
                ],
                [
                    "Rest"
                ],
                [
                    "Sleep Talk"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Torrent"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                252,
                0,
                252,
                0,
                4,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Special Walls",
        "Pokemon that Resist Primarina's STAB Moves",
        "Electric-types",
        "Grass-types",
        "Strong Physical Attackers"
    ],
    "credits": [
        "Written by Pak and Amane Misa",
        "Earlier versions by Amaroq",
        "Quality checked by Eyan, TSR, Sage, Nuked, A Cake Wearing A Hat,  and martha",
        "Grammar checked by The Dutch Plumberjack and A Cake Wearing A Hat"
    ]
}