{
    "name": "Primeape",
    "forms": {
        "Base": {
            "base stats": [
                65,
                105,
                60,
                60,
                70,
                95
            ],
            "types": [
                "Fighting"
            ],
            "abilities": [
                "Anger Point",
                "Defiant",
                "Vital Spirit"
            ],
            "tier": [
                "PU"
            ],
            "form": "Base"
        }
    },
    "overview": "Primeape can function as either a revenge killer with its Choice Scarf set or a fearsome wallbreaker with its other sets. Primeape, being one of the few Fighting-types with access to U-turn, is beneficial for providing momentum for its teammates and pivoting out on predicted switches. Primeape also has access to Defiant, which allows it to deter Defog very effectively. Primeape is also somewhat unpredictable, as it is able to run multiple sets, items, and coverage moves. Despite these attributes, Primeape has mediocre bulk and struggles to break past bulky Ghost-, Poison-, and Psychic-types without a moderate amount of team support. Furthermore, common balance Pokemon such as Froslass, Quagsire, and Jellicent make using STAB Close Combat a liability. Base 95 Speed is also a crowded Speed tier for non-Choice Scarf users, with Primeape finding trouble effectively revenge killing Jynx, Silvally Ghost-and -Fairy, and Haunter without forcing a Speed tie. Lastly, the popularity of Mesprit means Primeape now has a check on most offense and balance builds.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Choice Scarf",
            "stats": [
                166,
                309,
                157,
                140,
                176,
                317
            ],
            "type": [
                "Fighting"
            ],
            "usage": "The main function of Choice Scarf Primeape is to grab momentum and revenge kill foes. Close Combat is Primeape's main revenge killing tool and its coverage, most notably Stone Edge, should be used sparingly because it's weak and easily taken advantage of, allowing Pokemon like Musharna and Carracosta to set up for free. You should use U-turn every time you expect a defensive switch-in to be brought in in order to keep momentum up. Be aware that Primeape isn't all that bulky, so be careful when pivoting into Defog users such as Skuntank or Lurantis.",
            "moves": [
                [
                    "Close Combat"
                ],
                [
                    "U-turn"
                ],
                [
                    "Stone Edge"
                ],
                [
                    "Gunk Shot"
                ]
            ],
            "item": [
                " Choice Scarf"
            ],
            "ability": [
                "Defiant"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Offensive",
            "stats": [
                166,
                309,
                157,
                140,
                176,
                317
            ],
            "type": [
                "Fighting"
            ],
            "usage": "This Primeape set is best used as an early-game wallbreaker. If Primeape has not yet revealed its lack of Choice Scarf, it is a good idea to send it in after something has fainted to bluff a Choice Scarf set and take advantage of the forced switch with U-turn. Switching Primeape out instead of switching moves helps bluff the Choice Scarf set as well. U-turn can also be used when Primeape threatens the foe with heavy damage. Intentionally using the incorrect attack against foes that often carry Protect such as Audino and Regirock is smart to lull the opponent into a false sense of security, as they will often stay in afterward believing Primeape is locked into a move. Try not to reveal Encore, use All-Out Pummeling, or switch moves too soon, as revealing the fact that Primeape is not using a Choice Scarf set removes a lot of its surprise factor and makes it less threatening against faster Pokemon. An appropriate time to do the aforementioned is when Primeape is able to KO, heavily damage, or Encore a foe attempting to take advantage of Primeape supposedly being locked into one move. Such Pokemon include Oricorio-G and Type: Null. All-Out Pummeling should be used to KO a foe that would otherwise be out of range of Primeape's other moves. It can also be used to take out foes if you cannot risk Stone Edge or Gunk Shot missing. After having locked a foe into an exploitable move via Encore, using U-turn or Close Combat is generally the best play, as Primeape can either bring a dangerous teammate in for free, pick up momentum as the foe switches out, or fire off a powerful attack with few to no repercussions. If it is known that an enemy Pokemon such as Qwilfish is carrying a Rocky Helmet, spamming U-turn is discouraged,  as Primeape will end up being worn down very quickly. Instead, double switch into an ally such as Mesprit that can beat said foes. As Primeape is very frail, switching it in on even resisted hits is not recommended. Instead, get Primeape in via pivoting moves such as U-turn, double switching, or switching Primeape in on a predicted status move such as Stealth Rock. It can switch into predicted uses of Defog from Pokemon such as Skuntank but must be wary of said Pokemon predicting this and choosing to attack instead.",
            "moves": [
                [
                    "Close Combat"
                ],
                [
                    "Stone Edge"
                ],
                [
                    "U-turn"
                ],
                [
                    "Encore",
                    "Gunk Shot"
                ]
            ],
            "item": [
                " Fist Plate",
                " Fightinium Z"
            ],
            "ability": [
                "Defiant"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Choice Band",
            "stats": [
                166,
                309,
                157,
                140,
                176,
                317
            ],
            "type": [
                "Fighting"
            ],
            "usage": "Close Combat is a very spammable move and, coupled with its high Base Power and a Choice Band, it can severely dent teams. Choice Band Primeape is best utilized as an early- or mid-game wallbreaker. Generally, you want to get Primeape on the field as often as possible for it to take advantage of its wallbreaking opportunities for its teammates, usually a late-game cleaner or sweeper. Primeape has decently strong coverage, so feel free to use whatever works in different situations to avoid being set up on by Pokemon that tank Close Combat. With that said, using Primeape with Choice Band requires a decent amount of prediction, so playing aggressively will get the most out of it; you have to be very careful about getting set up on if you are locked into Stone Edge and the opponent brings in a Pokemon like Alolan Persian or Carracosta.",
            "moves": [
                [
                    "Close Combat"
                ],
                [
                    "U-turn"
                ],
                [
                    "Stone Edge"
                ],
                [
                    "Gunk Shot"
                ]
            ],
            "item": [
                " Choice Band"
            ],
            "ability": [
                "Defiant"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Ghost-types",
        "Psychic-types",
        "Flying-types",
        "Faster Pokemon"
    ],
    "credits": [
        "Written by TJ and Darkinium",
        "Quality checked by Megazard, Akir, g, allstarapology,  and yogi",
        "Grammar checked by Haund, Eien, A Cake Wearing A Hat,  and The Dutch Plumberjack"
    ]
}