{"name": "Probopass", "forms": {"Base": {"base stats": [60, 55, 145, 75, 150, 40], "types": ["Rock", "Steel"], "abilities": ["Magnet Pull", "Sand Force", "Sturdy"], "tier": ["Untiered"], "form": "Base"}}, "overview": "Probopass's near-exclusive access to Magnet Pull allows it to trap and either severely weaken or eliminate Steel-types such as Steelix and non-U-turn Togedemaru for teammates. Additionally, its excellent all-around bulk combined with a rare resistance to Ice means it can check dangerous attackers like Sneasel on a reasonably consistent basis. Furthermore, Probopass has access to a handful of useful utility moves like Stealth Rock. However, its typing hurts it because of the lack of resistances and weakness to common coverage from the Pokemon it wants to check, such as Hidden Power Ground from Comfey and Earth Power from Diancie. Probopass also faces heavy competition in the role of an Ice-type switch-in or Stealth Rock user from Pokemon like Togedemaru, Silvally-Steel, and Steelix, and its lack of recovery makes it easy to wear down throughout the match.\n", "strategies' format": "NU", "strategies": [{"name": "Magnet Pull", "stats": [199, 131, 326, 273, 336, 137], "type": ["Rock", "Steel"], "usage": "Use Probopass to trap and remove Steel-types like Steelix and non-U-turn Togedemaru for wallbreakers and sweepers like Sneasel, Klinklang, and Diancie. Play aggressively to get in versus Steelix without risking it popping Probopass's Air Balloon, doubling out of Pokemon like Sneasel that lure it out or capitalizing on U-turn support from Pokemon that Steelix stops cold, such as Scyther. Use Probopass to keep Pokemon whose STAB attacks it resists, such as non-Hidden Power Ground Vanilluxe, in check defensively. If you successfully get in versus Vanilluxe, it is usually best to use Stealth Rock if it is not up already and you don't expect Xatu to switch in because it allows you to take advantage of Vanilluxe's Stealth Rock weakness to put it under passive pressure each time it's forced out. Even aside from these situations, Probopass should try to set up Stealth Rock as early as possible to get as much mileage out of it as possible.", "moves": [["Earth Power"], ["Stealth Rock"], ["Magnet Rise"], ["Taunt", "Power Gem"]], "item": [" Air Balloon"], "ability": ["Magnet Pull"], "nature": ["Modest"], "ev spread": [172, 0, 0, 252, 0, 84], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fighting-types", "Klinklang:", "Water-types", "Ground- and Fighting-type Coverage"], "credits": ["Written by Martin", "Quality checked by Disjunction, Eternally,  and banks", "Grammar checked by The Dutch Plumberjack and Fireflame479"]}