{
    "name": "Purrloin",
    "forms": {
        "Base": {
            "base stats": [
                41,
                50,
                37,
                50,
                37,
                66
            ],
            "types": [
                "Dark"
            ],
            "abilities": [
                "Limber",
                "Prankster",
                "Unburden"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Purrloin finds a niche in the LC metagame because of its great support movepool with moves like Thunder Wave, Encore, Knock Off, Taunt, and U-turn. In combination with its ability, Prankster, this allows Purrloin to act as a disruptive pivot with good utility. However, Purrloin is heavily restricted by its mediocre bulk, even when invested, giving it few opportunities to utilize its movepool. It also has low offensive presence, restricting it to a support set. Prankster's inability to hit Dark-types also reduces Purrloin's niche significantly, making it unable to paralyze or use Encore on common Dark-type setup sweepers like Scraggy and Vullaby. A poor defensive typing makes Purrloin susceptible to extremely common Fighting-type priority like Mach Punch and Vacuum Wave. Purrloin faces heavy competition from Cottonee, another Prankster user with access to Memento, better bulk, and a better defensive typing, as well as from Alolan Meowth, a Dark-type pivot with better Speed and access to Parting Shot. However, Purrloin's ability to use both U-turn and Prankster gives it a small niche over these two Pokemon.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Utility",
            "stats": [
                165,
                145,
                145,
                122,
                137,
                185
            ],
            "type": [
                "Dark"
            ],
            "usage": "Using Encore on a foe to lock it into a status move or weak attack and then following up with U-turn can keep momentum on your side. Thunder Wave can be used freely once Ground- and Dark-types are eliminated, and it can help if your team is on the slow side. Remember that Dark-types are unaffected by Prankster, so resort to U-turn or Knock Off instead of using a utility move on Pokemon like Vullaby, Scraggy, and Pawniard. Thanks to Prankster, Purrloin can switch into moves like Shell Smash and Stealth Rock and use Encore without trouble. Finally, watch out for Pokemon like Croagunk and Timburr, which have access to Fighting-type priority. Timburr especially can use paralysis from Purrloin's Thunder Wave to gain a Guts boost or attack with a strong Mach Punch thanks to Iron Fist.",
            "moves": [
                [
                    "Encore"
                ],
                [
                    "U-turn"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Thunder Wave",
                    "Taunt"
                ]
            ],
            "item": [
                " Eviolite",
                " Berry Juice"
            ],
            "ability": [
                "Prankster"
            ],
            "nature": [
                "Careful"
            ],
            "ev spread": [
                188,
                36,
                140,
                0,
                60,
                68
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Dark-types",
        "Fighting-types",
        "Fairy-types"
    ],
    "credits": [
        "Written by Gummy",
        "Quality checked by Hilomilo, Xayah,  and OP",
        "Grammar checked by Wob and Fireflame479"
    ]
}