{"name": "Quagsire", "forms": {"Base": {"base stats": [95, 85, 85, 65, 65, 35], "types": ["Water", "Ground"], "abilities": ["Damp", "Unaware", "Water Absorb"], "tier": ["PU"], "form": "Base"}}, "overview": "With its decent physical bulk when invested, an amazing ability in Unaware, and access to reliable recovery, Quagsire can help stop some of the most dangerous setup sweepers in the tier that could otherwise threaten stall. Its physical bulk also allows it to naturally handle even more threats such as Tyranitar, Mega Charizard X, Landorus-T. Furthermore, it has a useful defensive typing that can help it take on threats, namely most Electric-types lacking Grass-type coverage such as Mega Manectric and non-Grass Knot Tapu Koko. However, Quagsire has very poor special bulk and is therefore left completely vulnerable to almost every somewhat threatening special attacker in the tier such as Tapu Lele, both Greninja formes, and Keldeo. Also, its general passivity and predictability force it to rely on equally passive teammates that can support and benefit from it. While it boasts good physical bulk, relatively powerful physical attackers can simply break through Quagsire. Mega Mawile, Mega Medicham, and Hoopa-U all possess the immediate power to 2HKO Quagsire though its defenses.\n", "strategies' format": "OU", "strategies": [{"name": "Unaware Wall", "stats": [289, 206, 295, 166, 167, 95], "type": ["Water", "Ground"], "usage": "Keeping Quagsire healthy with Recover or Wish passing is the most important aspect of using Quagsire. Allowing it to get weakened, get statused, have its item removed, or switch into more than one layer of entry hazards will severely hinder its ability to check threats such as Adamant Landorus-T. Generally, bring Quagsire in on something it walls and use Scald or Toxic to cripple or weaken the foe or potential switch-ins. Be cautious of double switches, as Quagsire alone cannot retaliate against powerful wallbreakers if caught off guard. Quagsire's passivity and predictability make it relatively easy to play around, so pay attention to how your opponent reacts to Quagsire and the rest of the team early-game. Be cautious of Z-Moves, which can either take Quagsire out or weaken it enough for other sweepers on the opponent's team. Proactively using Recover on common Z-Move users potentially wastes the opponent's Z-Move early. Use Curse to more reliably beat Pokemon such as offensive Z-Move Landorus-T and check Magic Guard Clefable and Swords Dance Alolan Marowak, which are very large nuisances to the passive teams on which Quagsire is found. Simply use Curse when Quagsire is healthy enough to take a subsequent attack after it has boosted, then recover off any damage.", "moves": [["Scald"], ["Earthquake"], ["Recover"], ["Toxic", "Curse"]], "item": [" Leftovers"], "ability": ["Unaware"], "nature": ["Relaxed"], "ev spread": [252, 0, 252, 0, 4, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Grass-types and Grass-type Moves", "Special Attackers", "Powerful Physical Wallbreakers"], "credits": ["Written by Pish", "Earlier versions by HailFall", "Quality checked by p2, Colonel M,  and Hootie", "Grammar checked by lotiasite and CryoGyro"]}