{
    "name": "Rampardos",
    "forms": {
        "Base": {
            "base stats": [
                97,
                165,
                60,
                65,
                50,
                58
            ],
            "types": [
                "Rock"
            ],
            "abilities": [
                "Mold Breaker",
                "Sheer Force"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        }
    },
    "overview": "Rampardos fills a tiny niche in the PU metagame due to its monstrous Attack stat that complements its ability Sheer Force. Head Smash's overwhelming power combined with coverage moves such as Zen Headbutt gives Rampardos the minuscule niche of a Choice Scarf user. However, Rampardos faces massive competition from Lycanroc, which is naturally fast, has priority, and can utilize Swords Dance if it gains the opportunity. Rampardos also has competition against Aggron as a wallbreaker due to its ability able to spam Head Smash with zero drawbacks. While a Choice Scarf is able to patch up Rampardos's middling Speed, it still fails to outspeed faster threats like Lycanroc, Alolan Persian, Floatzel, and other Choice Scarf users like Primeape, Kabutops, and Mesprit. Furthermore, Rampardos's primary attack, Head Smash, racks up recoil damage fairly easily, which further hinders its longevity. Rampardos is also pretty susceptible to priority moves like Mach Punch and Aqua Jet, which aren't too uncommon to come across in PU.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Choice Scarf",
            "stats": [
                230,
                429,
                156,
                149,
                137,
                236
            ],
            "type": [
                "Rock"
            ],
            "usage": "Due to how frail Rampardos is, you should find opportunities to give it free switches through slow pivots or aggressively coming in through double switches. You will have to occasionally predict perfectly in order to land super effective damage on the opponent's Pokemon. Having to guess between Zen Headbutt and Superpower is a situation that could possibly occur, and guessing wrong will result in you giving your opponent free turns. There is a fine difference between whether Head Smash or Rock Slide should be used in specific scenarios. If Rampardos accumulates too much Head Smash recoil, it puts itself into the range of getting KOed by priority moves like Mach Punch from Hitmonchan. However, the extra damage from Head Smash can be important for claiming a KO on defensive Mesprit. Rampardos is also capable of performing the role of a late-game cleaner, as it will often want its checks removed or at least chipped and faster Pokemon eliminated so it can fire off Head Smash far more with fewer drawbacks.",
            "moves": [
                [
                    "Head Smash"
                ],
                [
                    "Rock Slide"
                ],
                [
                    "Superpower",
                    "Pursuit"
                ],
                [
                    "Zen Headbutt"
                ]
            ],
            "item": [
                " Choice Scarf"
            ],
            "ability": [
                "Sheer Force"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                0,
                0,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Ground-types",
        "Fighting-types",
        "Faster Pokemon",
        "Steel-types"
    ],
    "credits": [
        "Written by BackAtYouBro",
        "Quality checked by tondas, UberSkitty,  and TONE",
        "Grammar checked by The Dutch Plumberjack and Fireflame479"
    ]
}