{
    "name": "Riolu",
    "forms": {
        "Base": {
            "base stats": [
                40,
                70,
                40,
                35,
                40,
                60
            ],
            "types": [
                "Fighting"
            ],
            "abilities": [
                "Inner Focus",
                "Prankster",
                "Steadfast"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Riolu's niche over Little Cup's other Fighting-types lies in its access to Copycat and Prankster. This allows Riolu to gain priority on its most recently used attack with Copycat and beat faster Pokemon that would otherwise threaten it such as Diglett, Doduo, and Gastly. Furthermore, Riolu's expansive movepool, fair bulk with Eviolite, high Attack stat, and access to Swords Dance altogether allow it to function as a fairly potent sweeper. Unfortunately, Riolu's lack of Knock Off and a more reliable STAB attack than High Jump Kick, as well as worse bulk than most other Fighting-types still leave it generally outclassed by better options in Mienfoo and Timburr. It also struggles to find setup opportunities due to its only decent bulk as well as rather unimpressive Speed, and it can at times, struggle to maintain Copycat chains due to the tier's prevalence of priority.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Bulky Swords Dance",
            "stats": [
                145,
                247,
                145,
                95,
                125,
                165
            ],
            "type": [
                "Fighting"
            ],
            "usage": "Due to its poor longevity and frailty, it is best to preserve Riolu early-game and remove its checks so it can function as a late-game sweeper. Protect is a move that serves many uses; most importantly, it can help Riolu protect itself from some of the tier's most powerful attacks in Rufflet's Brave Bird, boosted Omanyte's Hydro Pump, and Diglett's Earthquake and proceed to use Copycat to severely dent the aforementioned threats with their own attacks. It also allows Riolu to scout out Choice Scarf users or generate momentum by scouting and copying pivoting moves. Although it can struggle to find setup opportunities, Riolu can often reliably use Swords Dance when predicting a switch. If a foe uses Stealth Rock or sets another entry hazard, Riolu can do the same with Copycat and help weaken its teammates' checks. It can also make good use of Copycat in utilizing slow pivots as partners to copy either their U-turn or Volt Switch and wear down foes. Riolu must be wary of Ghost-type switch-ins when using High Jump Kick, as it will take severe crash damage if the move fails. It should also be noted that if Riolu doesn't 2HKO a foe with High Jump Kick and the foe attacks after it, it will not be able to use Copycat to receive priority on High Jump Kick. Because of High Jump Kick's heavy recoil damage, Riolu must also be wary of common Protect users in Carvanha and Spritzee, as they will take no damage from its attack and potentially KO it after the 50% HP loss from crash damage. It is best to use Riolu once powerful Psychic-, Fairy-, and Flying-type attackers are removed, as they will all severely dent Riolu with their super effective STAB attacks regardless of its bulk investment and weaken it for their teammates to revenge kill. If Riolu isn't running Protect, it should use the coverage move of choice on predicted switches to deal sufficient damage to certain Fighting-resistant Pokemon.",
            "moves": [
                [
                    "Swords Dance"
                ],
                [
                    "Copycat"
                ],
                [
                    "High Jump Kick"
                ],
                [
                    "Protect",
                    "Iron Tail",
                    "Zen Headbutt",
                    "Crunch"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Prankster"
            ],
            "nature": [
                "Adamant"
            ],
            "ev spread": [
                116,
                196,
                116,
                0,
                36,
                36
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Ghost-types",
        "Revenge Killers",
        "Fairy-types",
        "Poison-types",
        "Powerful Special Attackers",
        "Faster Priority Users"
    ],
    "credits": [
        "Written by Hilomilo",
        "Quality checked by Xayah, Nineage,  and tahu",
        "Grammar checked by Fireflame479 and Rakan"
    ]
}