{
    "name": "Roselia",
    "forms": {
        "Base": {
            "base stats": [
                50,
                60,
                45,
                100,
                80,
                65
            ],
            "types": [
                "Grass",
                "Poison"
            ],
            "abilities": [
                "Leaf Guard",
                "Natural Cure",
                "Poison Point"
            ],
            "tier": [
                "PU"
            ],
            "form": "Base"
        }
    },
    "overview": "Roselia's bulk and defensive typing allow it to solidly check dangerous special attackers such as Jellicent, Victreebel, and Omastar. Its access to Spikes and ability to absorb Toxic Spikes give it good utility, and Synthesis and Natural Cure provide it with greater longevity than other entry hazard setters and allow it to absorb status. Furthermore, Roselia's good STAB combination and decent Special Attack prevent it from being overly passive and allow it to pressure removers like Lurantis and Hitmonchan in one way or another. However, Roselia's defenses are easily exploited due to its low physical bulk and reliance on Eviolite, and its otherwise good defensive typing leaves it vulnerable to Flying-, Ice-, and Psychic-types. This is especially notable because it enables removers like Alolan Sandslash as well as Skuntank to switch in and exploit it. Roselia also faces competition from other Spikes setters like Qwilfish and Froslass, as they're both faster, possess greater utility options, and have slightly greater offensive presences while still maintaining solid defensive presences.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Specially Defensive",
            "stats": [
                198,
                140,
                126,
                236,
                280,
                172
            ],
            "type": [
                "Grass",
                "Poison"
            ],
            "usage": "Roselia should primarily switch into threats it can check such as Omastar and Poliwrath, as it will force them out and gain a free opportunity to set Spikes. Use Synthesis when Roselia starts losing noticeable amounts of HP so that it can consistently check threats, but take care to use the move as conservatively as possible due to its low PP. Teams with Aurorus or Abomasnow can exploit the use of Synthesis because of the hail these Pokemon set, so be careful about using the move against them. Although Roselia can be used to check certain weaker or passive physical attackers like Regirock, its mediocre physical bulk can prevent it from reliably handling them, meaning that it should only be done if absolutely necessary. If the opposing team has an entry hazard remover that Roselia is incapable of threatening, such as Skuntank or Alolan Sandslash, aim to wear them down, double switch whenever anticipating them to switch in, or set Spikes in hopes of forcing the use of removal. Scout for moves like Knock Off, Trick, and Switcheroo before switching directly into Pokemon such as Lurantis, Jellicent, and Manectric, as Roselia is nearly completely dependent on Eviolite for its bulk. Due to Natural Cure, Roselia should often be used to absorb status conditions like burns and paralysis for its team.",
            "moves": [
                [
                    "Spikes"
                ],
                [
                    "Synthesis"
                ],
                [
                    "Sludge Bomb"
                ],
                [
                    "Giga Drain"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Natural Cure"
            ],
            "nature": [
                "Calm"
            ],
            "ev spread": [
                248,
                0,
                0,
                0,
                236,
                24
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Strong Physical Attackers",
        "Loss of Eviolite",
        "Flying-types",
        "Steel-types",
        "Poison-types",
        "Specially Bulky Pokemon",
        "Psychic-types"
    ],
    "credits": [
        "Written by allstarapology",
        "Quality checked by jklioe, yogi,  and Megazard",
        "Grammar checked by The Dutch Plumberjack and Kris"
    ]
}