{"name": "Rotom", "forms": {"Base": {"base stats": [50, 50, 77, 95, 77, 91], "types": ["Electric", "Ghost"], "abilities": ["Levitate"], "tier": ["NU"], "form": "Base"}}, "overview": "Rotom is a fairly versatile Pokemon, capable of serving as a bulky Defog user, an offensive pivot that can easily wear teams down with Volt Switch and Hex, or a Choice Scarf user that can revenge kill offensive threats like Aerodactyl and +1 Vivillon. Levitate and an Electric / Ghost typing give Rotom a good number of resistances and immunities that includes Flying, Electric, Steel, Fighting, Normal, and Ground, enabling it to check important threats such as Passimian, Braviary, and Klinklang. Rotom has access to a solid support movepool with options like Will-O-Wisp, Trick, and Defog. Defog is especially notable given that Rotom's immunity to all entry hazards besides Stealth Rock and ability to threaten most hazard setters with Will-O-Wisp + Hex give it an easier time removing hazards. Volt Switch also gives Rotom the ability to pivot out against counters like Guzzlord as well as generate momentum for its team and give deadly wallbreakers an easier time switching in, and few Ground-types can reliably switch into Volt Switch thanks to the threat of being burned by Will-O-Wisp. However, Rotom's defensive capabilities are hindered by its average bulk, reliance on Iapapa Berry for recovery, and vulnerability to Dark, a very common offensive typing. Choice Scarf Rotom doesn't appreciate how easy its STAB moves are to exploit, whereas non-Choice Scarf variants don't appreciate being outpaced by common offensive Pokemon such as Sceptile and Sneasel. Even with Special Attack investment, Rotom isn't very powerful on its own and is often reliant on Z-Moves to deal with bulkier foes like pivot Incineroar, meaning that it can struggle with consistently breaking through teams.\n", "strategies' format": "NU", "strategies": [{"name": "Defog", "stats": [198, 122, 190, 228, 190, 309], "type": ["Electric", "Ghost"], "usage": "Rotom should primarily be brought in whenever it predicts Pokemon like Klinklang and non-Assault Vest Slowking to switch in, as it forces these Pokemon out and can use that turn to remove hazards, use Volt Switch, or burn a predicted switch-in. Early-game, the main moves Rotom should be using are Will-O-Wisp and Volt Switch, as they tend to apply the most pressure on many teams. Burning foes as soon as possible also makes Hex more spammable. If the opposing team has a Ground-type, try to catch it on a predicted switch with Will-O-Wisp, as burn damage in tandem with Hex and potential entry hazards limits its ability to reliably block Volt Switch. Whenever Rotom anticipates Incineroar or Guzzlord to switch in, it should use Volt Switch to preserve momentum. Be wary of Pursuit trappers like Sneasel and Absol, as they can potentially remove Rotom after it clears the field or KOes a foe, especially if Rotom isn't holding Colbur Berry.", "moves": [["Defog"], ["Will-O-Wisp"], ["Hex"], ["Volt Switch"]], "item": [" Colbur Berry", " Iapapa Berry"], "ability": ["Levitate"], "nature": ["Timid"], "ev spread": [248, 0, 0, 8, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Z-Move", "stats": [136, 122, 191, 289, 190, 309], "type": ["Electric", "Ghost"], "usage": "Rotom should primarily be switched in when it predicts foes to use Ground-type moves or Rapid Spin, as it is immune to these moves, or when predicting Pokemon such as Slowking and Klinklang to switch in, as it can force them out and generate a free turn for itself. Spamming Will-O-Wisp early-game is smart, as this punishes Electric-immune Pokemon and potential Pursuit trappers and powers up Hex against as many targets as soon as possible. However, if the opposing team has an Incineroar or Houndoom, Rotom should focus on using Volt Switch rather than Will-O-Wisp, as these Pokemon otherwise freely switch in and take advantage of Rotom by either setting up on it or Pursuit trapping it. Against defensive teams, Rotom should save its Z-Move until it's needed to break through a bulkier Pokemon that it can't afford to burn first. Rotom can more freely use its Z-Move against offensive teams, however, as it typically won't be reliant on it to break through walls. Once all Ground-types have been removed, the move Rotom uses most should be Volt Switch, as it wears bulkier foes down while also generating momentum for a teammate. If possible, try to preserve Rotom until all Pursuit trappers have been removed, since it cannot reliably KO a foe without fearing being removed immediately after.", "moves": [["Will-O-Wisp"], ["Hex"], ["Thunderbolt"], ["Volt Switch"]], "item": [" Ghostium Z"], "ability": ["Levitate"], "nature": ["Timid"], "ev spread": [0, 0, 4, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Scarf", "stats": [136, 122, 191, 289, 190, 309], "type": ["Electric", "Ghost"], "usage": "Primarily switch Rotom into Pokemon that it can check, such as Braviary, Klinklang, and Golbat, as well as into predicted Ground-type moves. Be wary of Toxic from Golbat, however. Though Rotom can also switch into Rapid Spin, certain spinners like Dhelmise and Hitmonlee can heavily damage or OHKO it, meaning that this should only be done if absolutely necessary. Rotom should also be switched into fast threats such as +1 Vivillon, +2 Omastar, and Accelgor after they KO one of its teammates to easily revenge kill them. Spamming Volt Switch early- and mid-game is smart, as this allows Rotom to keep up pressure and momentum while dealing decent damage to targets that don't resist Electric, avoiding being Pursuit trapped by Pokemon like Sneasel looking to switch in on Shadow Ball, and pivoting out against checks like Guzzlord. Against teams with Ground-types, however, Rotom should refrain from using Volt Switch as much and aim to wear them down throughout the match with Shadow Ball, cripple them with Trick, or simply double switch to a teammate that can take them on. Rotom should mainly use Trick against bulkier teams, as doing so allows it to place more pressure on defensive Pokemon and it needs its Choice Scarf to function well against offensive teams. Be sure to consider whether Rotom needs its item anymore before using Trick. If you wish to use Rotom as a cleaner late-game, try to avoid locking into Shadow Ball during the early stages of the game against teams with Pursuit trappers unless absolutely necessary, as they can easily switch into Rotom after it KOes a foe and remove it. Only use Defog when attempting to sacrifice Rotom or if Rotom forces a switch, as being locked into it is a massive momentum sink and can lead to Pokemon such as Incineroar and Comfey being able to freely set up on it.", "moves": [["Volt Switch"], ["Thunderbolt"], ["Shadow Ball"], ["Trick", "Defog"]], "item": [" Choice Scarf"], "ability": ["Levitate"], "nature": ["Timid"], "ev spread": [0, 0, 4, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Dark-types", "Specially Bulky Pokemon", "Faster Pokemon"], "credits": ["Written by allstarapology", "Quality checked by Blast, Eternally,  and Rabia", "Grammar checked by The Dutch Plumberjack and CryoGyro", "Earlier versions by roman"]}