{
    "name": "Salandit",
    "forms": {
        "Base": {
            "base stats": [
                48,
                44,
                40,
                71,
                40,
                77
            ],
            "types": [
                "Poison",
                "Fire"
            ],
            "abilities": [
                "Corrosion",
                "Oblivious"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Salandit can make for a relatively good wallbreaker with its high Speed, good offensive typing, and good Special Attack. Its hidden ability, Oblivious, lets it set up Nasty Plot without needing to worry about being Taunted; getting Taunted is not a big problem for most set up sweepers in the first place, but it can be useful. However, Salandit's huge weakness to trappers largely holds it back from its full potential. It also has paper-thin defenses, being OHKOed by almost every super effective hit. But, despite its weaknesses, Salandit can shine through in the right scenarios.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Poisonium Z",
            "stats": [
                132,
                111,
                125,
                226,
                125,
                269
            ],
            "type": [
                "Poison",
                "Fire"
            ],
            "usage": "Poisonium Z Salandit's main function is to sweep, clean, wallbreak, and in some cases revenge kill. Due to Salandit's poor defensive stats, it should rarely be directly switched into attacks and should instead be used as a revenge killer or simply be brought in through a U-turn or Volt Switch user. Flame Charge should only be used in two certain scenarios: if a Pokemon that can't do much to Salandit such as Spritzee is in, and if a Pokemon that can be KOed is in, usually either a Pokemon on a sliver of HP due to Focus Sash or Sturdy or a weakened Grass- or Ice-type. If the opponent has a Pokemon with Weak Armor, such as Onix or Kabuto, you should be extra careful about using Flame Charge, as if these Pokemon switch in on it, it can give them a Speed boost. In fact, if necessary, you can try and predict the switch, then pick off the incoming Pokemon with Hidden Power Grass. Salandit should usually be saved for late in the game, but if necessary, it can function as a fairly good revenge killer. Sweeping with Salandit is also best done when a good opportunity to use Flame Charge presents itself. Try to save Acid Downpour for when it can KO a Pokemon that would otherwise be a big threat, such as Staryu. All of Salandit's checks should be removed before an attempted sweep. If Diglett is alive on your opponent's team, Salandit is in a position where if it scores a KO without being at +1 Speed, it will easily be trapped and eliminated. Therefore, be sure to always eliminate Diglett before using Salandit. As a riskier option, Salandit can use Flame Charge on a predicted switch of a faster Pokemon, Choice Scarf Chinchou and Ponyta being notable, but, again, this is extremely risky. It can also use Acid Downpour in these situations to merely remove these threats.",
            "moves": [
                [
                    "Sludge Bomb"
                ],
                [
                    "Fire Blast"
                ],
                [
                    "Hidden Power Grass"
                ],
                [
                    "Flame Charge"
                ]
            ],
            "item": [
                " Poisonium Z"
            ],
            "ability": [
                "Corrosion"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                36,
                192,
                36,
                220
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Life Orb",
            "stats": [
                104,
                83,
                125,
                225,
                126,
                269
            ],
            "type": [
                "Poison",
                "Fire"
            ],
            "usage": "Conserving Salandit until the late-game is usually the best option, but if your opponent has many ways to stop Salandit from sweeping, it can be used to make a dent in their team before they can deal with it. If you think Sludge Bomb will knock out your foe, it is always good to use it over Fire Blast, as risking a miss can result in an immediate stop to Salandit's sweep. Be sure to eliminate all opposing threats before attempting to sweep, as sweeps can be stopped very easily by one of Salandit's many counters. Only use Nasty Plot when you're confident you can pull off a sweep and when all threats are gone, as a poorly timed Nasty Plot can result in a KOed Salandit.",
            "moves": [
                [
                    "Nasty Plot"
                ],
                [
                    "Sludge Bomb"
                ],
                [
                    "Fire Blast"
                ],
                [
                    "Hidden Power Grass"
                ]
            ],
            "item": [
                " Life Orb"
            ],
            "ability": [
                "Oblivious"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                36,
                192,
                40,
                220
            ],
            "iv spread": [
                3,
                0,
                31,
                30,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Trappers",
        "Faster Pokemon",
        "Sturdy + Berry Juice Users",
        "Ground- and Water-types",
        "Munchlax"
    ],
    "credits": [
        "Written by Drew",
        "Quality checked by OP, Rowan, Fiend, Nineage, jake,  and Berks",
        "Grammar checked by CryoGyro, Haund, lotiasite,  and The Dutch Plumberjack"
    ]
}