{
    "name": "Sawk",
    "forms": {
        "Base": {
            "base stats": [
                75,
                125,
                75,
                30,
                75,
                85
            ],
            "types": [
                "Fighting"
            ],
            "abilities": [
                "Inner Focus",
                "Mold Breaker",
                "Sturdy"
            ],
            "tier": [
                "PUBL"
            ],
            "form": "Base"
        }
    },
    "overview": "Sawk manages to carve a niche for itself among RU's Fighting-type Pokemon for a few reasons. It hits pretty hard and has solid coverage overall with moves like Knock Off and Poison Jab, and a solid Speed tier places it above common metagame threats like Mega Blastoise and Nidoqueen. Sawk's Sturdy ability gives it a huge niche in general as a catch-all answer to many offensive threats and also allows it to check setup sweepers like Barbaracle in a pinch. Due to its good Speed tier, Sawk can afford to run utility moves like Taunt that other Fighting-types in the tier cannot. However, Sawk is pretty frail and outpaced by many offensive threats such as Swellow, Roserade, and Zygarde-10%. Lastly, it faces competition with other Fighting-type wallbreakers like Flame Orb Machamp and Bewear. As a faster Fighting-type, it also faces competition with Virizion, Toxicroak, Medicham, and Passimian.\n",
    "strategies' format": "RU",
    "strategies": [
        {
            "name": "Wallbreaker",
            "stats": [
                186,
                349,
                187,
                86,
                186,
                295
            ],
            "type": [
                "Fighting"
            ],
            "usage": "It's usually best not to directly switch Sawk in due to its frailty and the risk of breaking its Sturdy. It is especially not recommended to switch Sawk in when there are entry hazards or status users on the field or when a hail or sand setter such as Gigalith or Mega Abomasnow is present. Sawk's Sturdy ability can be utilized to safely get a hit in on any Pokemon, even Pokemon that hit it super effectively. Taunt is most effectively used when a defensive Pokemon such as Mandibuzz or Bronzong is on the field, preventing them from using moves like Toxic, Defog, or Stealth Rock in the case of the latter. Finally, All-Out Pummeling should be utilized when you want to unleash a powerful STAB attack against the opponent, but note that using it when a Pokemon that resists it is on the field is not recommended.",
            "moves": [
                [
                    "Close Combat"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Taunt"
                ],
                [
                    "Poison Jab",
                    "Earthquake"
                ]
            ],
            "item": [
                " Fightinium Z"
            ],
            "ability": [
                "Sturdy"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Revenge Killers",
        "Flying-types",
        "Psychic-types",
        "Residual Damage"
    ],
    "credits": [
        "Written by Melons-N-Soda",
        "Quality checked by MrAldo, zizalith,  and roman",
        "Grammar checked by estronic and The Dutch Plumberjack"
    ]
}