{
    "name": "Scolipede",
    "forms": {
        "Base": {
            "base stats": [
                60,
                100,
                89,
                55,
                69,
                112
            ],
            "types": [
                "Bug",
                "Poison"
            ],
            "abilities": [
                "Poison Point",
                "Speed Boost",
                "Swarm"
            ],
            "tier": [
                "UUBL"
            ],
            "form": "Base"
        }
    },
    "overview": "Scolipede can fulfill the role of a cleaner and wallbreaker in one slot due to its access to Speed Boost and Swords Dance to threaten offensive and defensive teams. Functioning in these roles is enabled by decent Attack, good Speed, and a sufficient movepool, so Scolipede can utilize strong attacks and coverage moves such as Megahorn, Earthquake, and Aqua Tail. However, Scolipede's below average defenses mean Scolipede will require entry hazard removal to set up properly. Even if Scolipede manages to set up, it will often be in range of priority moves from Ash-Greninja, Mega Scizor, and Mega Mawile, for example, meaning its capabilities cannot be fully unleashed in practice.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Swords Dance",
            "stats": [
                156,
                299,
                215,
                131,
                174,
                355
            ],
            "type": [
                "Bug",
                "Poison"
            ],
            "usage": "Scolipede's typing allows it to get a free Swords Dance against Tapu Fini and most Grass-types such as Tapu Bulu and Tangrowth, so utilize these opportunities right away. Otherwise, Scolipede will be forced to take damage in order to set up. If this is the case, prioritize removing entry hazards so Scolipede can set up in front of Mega Scizor and defensive Landorus-T and stay out of the KO range of most priority.",
            "moves": [
                [
                    "Swords Dance"
                ],
                [
                    "Megahorn"
                ],
                [
                    "Aqua Tail"
                ],
                [
                    "Earthquake"
                ]
            ],
            "item": [
                " Waterium Z"
            ],
            "ability": [
                "Speed Boost"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Priority",
        "Stealth Rock",
        "Playing Around Hydro Vortex",
        "Physically Defensive Pokemon"
    ],
    "credits": [
        "Written by Vertex",
        "Quality checked by Colonel M, Gary,  and p2",
        "Grammar checked by Lemonade and Fireflame479"
    ]
}