{
    "name": "Scrafty",
    "forms": {
        "Base": {
            "base stats": [
                65,
                90,
                115,
                45,
                115,
                58
            ],
            "types": [
                "Dark",
                "Fighting"
            ],
            "abilities": [
                "Intimidate",
                "Moxie",
                "Shed Skin"
            ],
            "tier": [
                "NU"
            ],
            "form": "Base"
        }
    },
    "overview": "Scrafty is a great setup sweeper due to the combination of its unique typing, great bulk, and amazing abilities. Said unique typing gives Scrafty great STAB moves, including Knock Off, High Jump Kick, and Drain Punch, which let it handle common Dark-, Ghost-, and Psychic-types such as Incineroar, Rotom, and Slowking. Thanks to its great bulk, Scrafty has an easy time setting up on passive Pokemon and can make teams that depend on common defensive cores, like Steelix + Slowking and Vaporeon + Silvally-Steel, really struggle. The ability Shed Skin gives Scrafty a way to also set up on Pokemon like Rotom and Vaporeon, which rely on spreading status conditions with moves like Will-O-Wisp and Toxic. However, Scrafty has a really poor Speed tier, making it easy to revenge kill with common Choice Scarf users like Passimian and other fast Pokemon like Whimsicott and Sceptile even after a Dragon Dance boost. It's also extremely susceptible to Fairy-types, like Whimsicott, Aromatisse, and Comfey, and Pokemon that run Fairy-type coverage moves, such as Mismagius and Delphox.\n",
    "strategies' format": "NU",
    "strategies": [
        {
            "name": "Bulk Up",
            "stats": [
                229,
                217,
                266,
                113,
                361,
                152
            ],
            "type": [
                "Dark",
                "Fighting"
            ],
            "usage": "Scrafty should generally use its Shed Skin and great bulk to switch into passive Pokemon, like Palossand, Vaporeon and Ferroseed, and status-inducing moves. Thanks to its ability, Scrafty can be used as a great status absorber for teams that struggle against Pokemon like Slowking and Rotom. While it's in play, Scrafty should use Knock Off to cripple its checks and counters like Passimian and Whimsicott. Once these checks are weakened, it will have an easier time setting up and pressuring defensive teams. Since it's 4x weak to Fairy, Scrafty should be cautious of Pokemon like Mismagius and Delphox, which can carry Dazzling Gleam, and Fairy-types like Mega Audino and Comfey.",
            "moves": [
                [
                    "Bulk Up"
                ],
                [
                    "Knock Off"
                ],
                [
                    "Drain Punch"
                ],
                [
                    "Rest"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Shed Skin"
            ],
            "nature": [
                "Careful"
            ],
            "ev spread": [
                252,
                4,
                0,
                0,
                252,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Dragon Dance",
            "stats": [
                166,
                279,
                267,
                113,
                266,
                236
            ],
            "type": [
                "Dark",
                "Fighting"
            ],
            "usage": "You should use Knock Off and High Jump Kick early-game to weaken Scrafty's checks and counters. Knock Off should be used to remove items from checks like Comfey and Golbat, while High Jump Kick should be used to weaken checks such as Passimian and Whimsicott. However, High Jump Kick should not be used recklessly, as a Ghost-type like Decidueye, Rotom, or Palossand could switch in. Once the majority of Scrafty's check and counters are weakened, try to set up on Pokemon that can't heavily damage it like Steelix, Cryogonal, and Palossand. However, if Scrafty isn't using Shed Skin, it should worry about status conditions from Scald and Toxic users like Slowking and Blastoise. If it's paired with Healing Wish support, you can use Scrafty early-game to break defensive cores and weaken the opposing team, then switch it out to be used again if needed. If Scrafty is holding a Chople Berry, it has an easier time setting up even if the opponent has a Fighting-type Pokemon such as Passimian. If you have one Dragon Dance up while facing a Choice Scarf Passimian, set up again because you can outspeed the following turn and do a lot of damage.",
            "moves": [
                [
                    "Dragon Dance"
                ],
                [
                    "Knock Off"
                ],
                [
                    "High Jump Kick"
                ],
                [
                    "Drain Punch",
                    "Iron Tail"
                ]
            ],
            "item": [
                " Chople Berry",
                " Fightinium Z"
            ],
            "ability": [
                "Shed Skin",
                "Moxie"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fairy-type Pokemon",
        "Poison-type Pokemon",
        "Fighting-type Pokemon",
        "Flying-type Pokemon",
        "Fast Pokemon"
    ],
    "credits": [
        "Written by Abejas",
        "Quality checked by quziel, banks,  and kay",
        "Grammar checked by CryoGyro and The Dutch Plumberjack",
        "Earlier versions by banks"
    ]
}