{"name": "Sharpedo", "forms": {"Base": {"base stats": [70, 120, 40, 95, 40, 95], "types": ["Water", "Dark"], "abilities": ["Rough Skin", "Speed Boost"], "tier": ["RUBL"], "form": "Base"}, "Mega": {"base stats": [70, 140, 70, 110, 65, 105], "types": ["Water", "Dark"], "abilities": ["Strong Jaw"], "tier": ["UU"], "form": "Mega"}}, "overview": "Mega Sharpedo is a great late-game cleaner, utilizing both its pre-Mega ability in Speed Boost and its post-Mega ability in Strong Jaw to sweep. Its great Attack and Speed stats allow Mega Sharpedo to hit very hard and very fast at the same time, with Crunch severely damaging Pokemon such as Scizor and Mamoswine. Strong Jaw also boosts the Base Power of coverage moves like Ice Fang and Psychic Fangs, allowing Mega Sharpedo to hit would-be checks and counters, such as Mega Altaria, Heracross, and Hydreigon, very hard. Mega Sharpedo has terrible bulk and a defensive typing that gives it numerous weaknesses to common types like Fighting, Grass, and Bug, although it does resist a very important priority move in Bullet Punch. Said poor bulk means that if Mega Sharpedo doesn't OHKO what's in front of it, it will likely get OHKOed in return. It also faces great competition from other Mega Evolutions like Mega Aerodactyl and Mega Altaria, both of which also have greater defensive utility and wider movepools. Finally, Mega Sharpedo struggles to break through bulky walls like Mega Aggron and Swampert without them being significantly weakened beforehand, which can stop a late-game sweep in its tracks. It also struggles to sweep without entry hazard support.\n", "strategies' format": "UU", "strategies": [{"name": "Cleaner", "stats": [177, 379, 176, 230, 166, 339], "type": ["Water", "Dark"], "usage": "Mega Sharpedo is best used to clean up late-game when there are no Pokemon left on the opposing team that can outspeed Mega Sharpedo or survive one of its attacks. Therefore, don't Mega Evolve Sharpedo unless it can successfully clean or there is nothing on the opposing team that can outspeed it. Unless Sharpedo is sent out against a slower foe that it can KO without Mega Evolving, it's generally safest to use Protect the first turn Sharpedo is on the field so that it gets a guaranteed Speed boost. Mega Sharpedo should always come in either after a teammate has been KOed or on a free switch from Volt Switch or U-turn, as its poor bulk means it will usually be KOed by any strong neutral move. Before attempting to sweep, make sure that bulky Pokemon such as Cobalion, Amoonguss, Alomomola, and Scizor have been sufficiently weakened to the point where Mega Sharpedo can finish them off without getting KOed. Priority users like Infernape and Lucario must be removed before Mega Sharpedo attempts to sweep, as they can KO Mega Sharpedo before it can attack. Scout for Choice Scarf users like Infernape, Latias, and Gengar before Mega Sharpedo attempts a sweep, as they can KO Mega Sharpedo before it can attack unless it has more than one Speed boost. If Mega Sharpedo is running an Adamant nature, it's advised to bring it out on something it can KO, like Nihilego or Choice-locked Infernape, so it can obtain two Speed boosts to outspeed Choice Scarf Hydreigon and Krookodile.", "moves": [["Crunch"], ["Ice Fang"], ["Psychic Fangs"], ["Protect"]], "item": [" Sharpedonite"], "ability": ["Speed Boost"], "nature": ["Jolly", "Adamant"], "ev spread": [4, 252, 0, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Bulky Steel-types", "Water-types", "Fairy-types", "Choice Scarf Users", "Priority"], "credits": ["Written by Nuked", "Quality checked by Sage, martha,  and Hilomilo", "Grammar checked by A Cake Wearing A Hat and martha"]}