{
    "name": "Shaymin",
    "forms": {
        "Base": {
            "base stats": [
                100,
                100,
                100,
                100,
                100,
                100
            ],
            "types": [
                "Grass"
            ],
            "abilities": [
                "Natural Cure"
            ],
            "tier": [
                "RU"
            ],
            "form": "Base"
        }
    },
    "overview": "Shaymin distinguishes itself from other offensive Grass-types like Celebi and Mega Sceptile with its access to Z-Celebrate, which boosts all of its stats by one stage. The boosted bulk and Speed can make Shaymin fairly difficult to revenge kill due to its neutrality to Scizor's Bullet Punch and ability to outspeed Mega Aerodactyl and Choice Scarf Hydreigon with boosts. Shaymin also finds easy opportunities to set up on common Pokemon such as Krookodile and Slowbro due to its decent Speed and bulk. which further defines its niche as the only viable user of Z-Celebrate in the tier, and access to the devastating Seed Flare can make common counterplay such as Mega Aggron and Moltres possibly lose if they immediately switch in and have their Special Defense dropped. Shaymin’s biggest flaw that it has only one opportunity to set up, which makes it confined to late-game as a cleaner. It needs to ensure that it doesn’t set up prematurely to where its checks can still reliably wall and remove it. It's mono-Grass typing can also be a burden due to the lack of a secondary typing that could give it leverage against checks such as Mega Aggron and Moltres. Shaymin also requires strenuous team support and the rest of the team to work together to remove or chip away at its checks to let it sweep late-game. Shaymin cannot circumvent special walls such as Blissey and Amoonguss, unlike other offensive Grass-types like Celebi and Decidueye. Because of this, Shaymin finds major competition against Celebi, which can reliably set up Nasty Plot far more throughout the match and can bust through common counterplay with Z-Moves.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "Z-Celebrate",
            "stats": [
                236,
                212,
                236,
                299,
                237,
                328
            ],
            "type": [
                "Grass"
            ],
            "usage": "Shaymin should only be brought in late-game once its checks and counters have either been chipped down or removed. Because of this, Shaymin should stay as healthy as possible and should never be brought in on anything unless it is a last resort scenario. Shaymin can set up on Pokemon such as Krookodile and Slowbro, as they fail to do any significant damage to it. However, Shaymin should avoid setting up on Pokemon that can still deal a significant amount of damage even if Shaymin can beat them, as Shaymin takes a longer time to break through them. Mega Steelix and Gligar are defensive Pokemon that fall under this criteria. Avoid Toxic and paralysis while setting up, as they can either hinder or neutralize Shaymin completely and waste its one opportunity at sweeping. Seed Flare is useful in fishing for possible Special Defense drops on Pokemon that take it neutrally such as Nihilego and Mega Steelix in order to break through them much more smoothly. Seed Flare can also place Pokemon such as Latias and Amoonguss in range of Shaymin’s coverage moves.",
            "moves": [
                [
                    "Celebrate"
                ],
                [
                    "Seed Flare"
                ],
                [
                    "Dazzling Gleam"
                ],
                [
                    "Hidden Power Fire"
                ]
            ],
            "item": [
                " Normalium Z"
            ],
            "ability": [
                "Natural Cure"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Special Walls",
        "Fire-types",
        "Steel-types",
        "Flying-types"
    ],
    "credits": [
        "Written by BackAtYouBro",
        "Quality checked by Surgeon, martha,  and Nuked",
        "Grammar checked by Estronic and The Dutch Plumberjack"
    ]
}