{"name": "Shiftry", "forms": {"Base": {"base stats": [90, 100, 60, 90, 60, 80], "types": ["Grass", "Dark"], "abilities": ["Chlorophyll", "Early Bird", "Pickpocket"], "tier": ["Untiered"], "form": "Base"}}, "overview": "Shiftry is an offensive force to be reckoned with as a result of its solid offensive typing, decent mixed attacking stats, and strong STAB options such as Knock Off, Leaf Storm, Seed Bomb, and Sucker Punch. Because of its mixed coverage, Shiftry manages to stand apart from other Dark- and Grass-types in the tier and is a massive threat to teams that are overly reliant on Pokemon such as Aggron, Mawile, and Regirock to check physical attackers. Shiftry becomes even more threatening under sun because of its ability Chlorophyll doubling its Speed, which allows it to also threaten opposing sun teams. It can also function well as an offensive user of Defog because its typing gives it the ability to threaten common entry hazard setters such as Mudsdale, Golurk and Regirock, allowing it to clear the field of entry hazards on the turn that they switch out. However, its great offensive typing curses it with weaknesses to common attack typings such as Fire, Flying, Poison, and Ice, and its poor bulk doesn't make matters much better. Although its Speed is far from terrible, Shiftry is outsped by common offensive Pokemon such as Jynx and Simisear, and its main method of mitigating this in Sucker Punch isn't very reliable due to how it can be taken advantage of. Finally, as a purely physical wallbreaker, Shiftry faces competition from other Dark-types in the tier such as Absol and Alolan Raticate, both of which, while slower, are stronger.\n", "strategies' format": "PU", "strategies": [{"name": "Mixed Life Orb", "stats": [216, 328, 140, 217, 156, 259], "type": ["Grass", "Dark"], "usage": "Use Knock Off a lot early on, as it's Shiftry's most reliable STAB move and cripples defensive Pokemon like Gourgeist-XL and Tangela by nullifying Colbur Berry or removing Eviolite, rendering them unable to check Shiftry as effectively. If you're using Defog on Shiftry, bring it in on entry hazard setters that it threatens like Bronzor and Regirock, and Defog on the turn they switch. Sucker Punch is a great tool for revenge killing, but as mentioned before, it can be exploited by Pokemon that can recover their health or set up such as Jynx and Swanna. Exercise caution when using Explosion, as Shiftry only gets one use at the move, so refrain from using it until Shiftry is no longer required and wants to dish out one last heavy hit. Shiftry is easy to wear down due to Life Orb recoil, entry hazards, and its poor bulk, so not letting it take much or any unnecessary damage is smart, especially if it's the team's only form of entry hazard control.", "moves": [["Knock Off"], ["Sucker Punch"], ["Leaf Storm"], ["Defog", "Low Kick"]], "item": [" Life Orb"], "ability": ["Chlorophyll"], "nature": ["Lonely", "Hasty"], "ev spread": [0, 252, 0, 4, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Swords Dance", "stats": [216, 328, 157, 194, 156, 259], "type": ["Grass", "Dark"], "usage": "Using Knock Off a lot early on to weaken checks and remove the items of checks is good for pressuring them and making them unable to keep Shiftry in check. Finding opportunities to set up a Swords Dance on Pokemon that Shiftry forces out like Bronzor, Gastrodon, or Sableye is ideal due to their passivity. Once Shiftry manages to use Swords Dance, it should weaken and break as much of the opposing team as it can, paving the way for its teammates to and clean up. Sucker Punch allows Shiftry to check faster but frailer Pokemon as well as setup sweepers. None of them appreciate taking a Sucker Punch, especially if Shiftry uses Swords Dance beforehand. Shiftry is really frail and doesn't like taking even resisted hits when it doesn't have to, so be sure to keep Shiftry as healthy as possible when attempting to set up.", "moves": [["Swords Dance"], ["Seed Bomb"], ["Knock Off"], ["Sucker Punch"]], "item": [" Life Orb", " Black Glasses"], "ability": ["Chlorophyll"], "nature": ["Adamant", "Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Scarf", "stats": [216, 328, 157, 194, 156, 259], "type": ["Grass", "Dark"], "usage": "Using Knock Off a lot early on is smart, as it keeps opponents from immediately suspecting Shiftry's set. Refrain from using Rock Slide or otherwise making it obvious that you're using a Choice Scarf set until need be, as this will make the set ineffective at luring in faster threats. This set isn't very common in comparison to the other two, so take advantage of how it's unexpected by luring in the faster Pokemon that normally force Shiftry out like Simisear and Skuntank and KOing them. Shiftry serves as a solid revenge killer, as well, due to its lack of reliance on Sucker Punch for picking things off, so take advantage of Choice Scarf by taking down normally faster Pokemon like Alolan Raichu and Oricorio-G. Explosion still packs a punch despite the lack of a Life Orb boost, so use it to deal heavy damage to Pokemon like Skuntank and weakened physical walls.", "moves": [["Knock Off"], ["Leaf Blade"], ["Rock Slide"], ["Low Kick", "Explosion"]], "item": [" Choice Scarf"], "ability": ["Chlorophyll"], "nature": ["Adamant"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Poison-types", "Fighting-types", "Faster Pokemon", "Priority"], "credits": ["Written by allstarapology", "Quality checked by yogi, Megazard,  and TONE", "Grammar checked by The Dutch Plumberjack and frenzyplant"]}