{"name": "Simisear", "forms": {"Base": {"base stats": [75, 98, 63, 98, 63, 101], "types": ["Fire"], "abilities": ["Blaze", "Gluttony"], "tier": ["Untiered"], "form": "Base"}}, "overview": "Simisear is a decent sweeper that differentiates itself with its rare access to Fire-type STAB moves and decent coverage, along with Nasty Plot and a solid Speed tier. It can utilize various Z-Moves to break through would-be checks such as Lanturn and Audino, which makes it more threatening and unpredictable. However, Simisear's paltry defenses and weakness to Stealth Rock leave it open to Choice Scarf users like Primeape, Aurorus, and Swanna, along with certain forms of priority like Kabutops's Aqua Jet and Skuntank's Sucker Punch. Its meager bulk also makes it more difficult to set up a Nasty Plot, which is necessary to patch up Simisear's low damage output so that it can threaten defensive switch-ins more easily. Combusken and Turtonator are other options that give Simisear competition as Fire-type breakers, with Combusken being capable of cleaning with Speed Boost, Turtonator being able to more easily set up with its bulk, and both wielding an additional STAB type.\n", "strategies' format": "PU", "strategies": [{"name": "Nasty Plot", "stats": [186, 208, 162, 295, 163, 331], "type": ["Fire"], "usage": "Utilize Simisear's solid Speed tier and coverage to threaten a Pokemon out such as Jynx or Oricorio-E, and attack or set up Nasty Plot. Only set up when Simisear can force a switch, as it can't afford to take a hit while setting up. Simisear is quite frail, especially considering its Stealth Rock weakness, and avoid switching it into any attacks, as most of them can either KO Simisear or weaken it to the point where it can't set up. Simisear can also throw out attacks before a boost to hit offensive checks such as Lycanroc or Floatzel that it lures in on the switch. Be conservative with its Z-Move, and don't make it obvious which one it's running, as the potential threat of either Z-Move allows Simisear to threaten out and break through more Pokemon. Simisear can wallbreak early- or mid-game to open up holes in the opposing team and possibly attempt to go for a sweep itself late-game once certain roadblocks such as Choice Scarf users have been dealt with by its teammates.", "moves": [["Nasty Plot"], ["Fire Blast"], ["Grass Knot"], ["Focus Blast", "Hidden Power Ice"]], "item": [" Firium Z", " Grassium Z"], "ability": ["Blaze"], "nature": ["Timid"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Faster Pokemon", "Specially Defensive Pokemon", "Stealth Rock", "Priority"], "credits": ["Written by Jmash324", "Quality checked by UberSkitty, Megazard,  and tondas", "Grammar checked by martha and The Dutch Plumberjack"]}