{
    "name": "Simipour",
    "forms": {
        "Base": {
            "base stats": [
                75,
                98,
                63,
                98,
                63,
                101
            ],
            "types": [
                "Water"
            ],
            "abilities": [
                "Gluttony",
                "Torrent"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        }
    },
    "overview": "Simipour carves itself a niche in PU by being a fast Water-type with immediate offensive pressure thanks to its high Speed, good Special Attack, ability to boost with Nasty Plot, and unresisted coverage in one moveset. However, Simipour is very frail, so it rarely gets the opportunity to set up. Additionally, Simipour may have a good Speed tier, but it is still prone to being revenge killed by faster threats such as Scyther, Lycanroc, and Alolan Raichu. Simipour faces stiff competition as a Nasty Plot sweeper from the likes of Alolan Raichu, Jynx, and Simisear. Alolan Raichu is faster, while Jynx's Substitute and Lovely Kiss give it more opportunities to set up. Simisear virtually does the same thing that Simipour does except it has a better matchup against Grass-types such as Lilligant, Bellossom, and Roselia, while the entire tier has a difficult time switching directly into it. However, Simipour is not weak to Stealth Rock and  has a much easier time setting up against Pokemon like Regirock, Aggron, and Mudsdale on forced switches. Simipour also has to compete with its fellow Water-types such as Jellicent, Omastar, and Floatzel. Jellicent is immediately stronger, is bulkier, has access to Trick, has dual STAB, and can spinblock; Omastar is a better late-game sweeper with Shell Smash and can set up entry hazards; Floatzel is faster, has Aqua Jet, and can bluff a physical set.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Nasty Plot",
            "stats": [
                186,
                208,
                162,
                295,
                163,
                331
            ],
            "type": [
                "Water"
            ],
            "usage": "Simipour can potentially wallbreak early- to mid-game to soften up its potential checks for itself and its team. Afterwards, if Simipour is still around and faster Pokemon have been removed from the battle, it can set up and sweep late-game. Because of its poor bulk, try to get Simipour into battle either with the help of a slow pivot such as Lanturn or Eelektross or after one of its teammates has been knocked out, as both of these options are safe and don't require Simipour to take a hit. Before setting up, make sure that any Pokemon that can potentially outspeed and revenge kill Simipour is properly taken care of. Simipour can safely set up with Nasty Plot by threatening out a slower, more passive Pokemon such as Regirock, Gastrodon, or Quagsire with its powerful moves. Try to conserve Simipour's  Z-Move for its intended target, ideally a specially defensive Pokemon such as Clefairy, Eelektross, or Assault Vest Hitmonchan. Hydro Vortex can also threaten Skuntank and Rotom-F in one-on-one situations where it cannot set up.",
            "moves": [
                [
                    "Nasty Plot"
                ],
                [
                    "Hydro Pump"
                ],
                [
                    "Ice Beam"
                ],
                [
                    "Grass Knot"
                ]
            ],
            "item": [
                " Waterium Z"
            ],
            "ability": [
                "Torrent"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Faster Threats",
        "Priority",
        "Specially Defensive Pokemon"
    ],
    "credits": [
        "Written by JustoonSmitts",
        "Quality checked by tondas, UberSkitty,  and TJ",
        "Grammar checked by NixHex and Rabia"
    ]
}