{
    "name": "Slurpuff",
    "forms": {
        "Base": {
            "base stats": [
                82,
                80,
                86,
                85,
                75,
                72
            ],
            "types": [
                "Fairy"
            ],
            "abilities": [
                "Sweet Veil",
                "Unburden"
            ],
            "tier": [
                "NUBL"
            ],
            "form": "Base"
        }
    },
    "overview": "Slurpuff is a unique and incredibly threatening sweeper in the RU tier due to its access to both Unburden and Belly Drum, which can maximize its Attack and double its Speed in one turn. Thanks to its Fairy typing and decent bulk, Slurpuff is able to set up in front of any Choice-locked Dragon- or Fighting-type Pokemon like Zygarde-10%, Goodra and Bewear. Unfortunately, popular Steel-types in the tier such as Metagross, Registeel and Bronzong can thwart a potential Slurpuff sweep if they are kept relatively healthy. Furthermore, Slurpuff's sweep can similarly be cut short by status ailments and priority moves such as Machamp and Pangoro's Bullet Punch and as such faces competition from Linoone, whose Belly Drum and Extreme Speed combination makes it far harder to revenge kill. Unburden only activating once means Slurpuff is only granted one setup opportunity; it is typically useless in a match until you are able to find a time to set up safely.\n",
    "strategies' format": "RU",
    "strategies": [
        {
            "name": "Belly Drum Sweeper",
            "stats": [
                201,
                284,
                208,
                185,
                186,
                243
            ],
            "type": [
                "Fairy"
            ],
            "usage": "Ideally, save Slurpuff for late-game, as it only has one chance to activate Unburden to sweep. Additionally, Slurpuff wants its checks and counters, such as Metagross, Escavalier, and Bronzong, weakened or eliminated to increase the likelihood of a sweep. However, Slurpuff can also set up earlier in the game to weaken opposing bulky Pokemon like Escavalier and Bronzong to clear a path for its teammates such as Flygon, Swellow, and Linoone to sweep. Slurpuff can take advantage of Dragon-type Pokemon such as Flygon and Zygarde-10% that are locked into Outrage and use them as setup fodder. In a similar vein, more defensive Pokemon, such as Registeel, Florges, and Cresselia, grant Slurpuff an opportunity to set up.",
            "moves": [
                [
                    "Belly Drum"
                ],
                [
                    "Play Rough"
                ],
                [
                    "Return"
                ],
                [
                    "Drain Punch"
                ]
            ],
            "item": [
                " Sitrus Berry"
            ],
            "ability": [
                "Unburden"
            ],
            "nature": [
                "Adamant",
                "Jolly"
            ],
            "ev spread": [
                4,
                252,
                0,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Bulky Steel-types",
        "Status Conditions",
        "Priority Users"
    ],
    "credits": [
        "Written by teachable",
        "Earlier versions by AJB",
        "Quality checked by avocado, phantom,  and MrAldo",
        "Grammar checked by Eyan and Fireflame479"
    ]
}