{
    "name": "Snivy",
    "forms": {
        "Base": {
            "base stats": [
                45,
                45,
                55,
                45,
                55,
                63
            ],
            "types": [
                "Grass"
            ],
            "abilities": [
                "Contrary",
                "Overgrow"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Snivy's niche comes from the ability Contrary and the move Leaf Storm, which when paired together give Snivy a 130-Base Power move that also provides a +2 boost to its Special Attack, making it one of the best wallbreakers and the best offensive Grass-type Pokemon in Little Cup. Contrary also has several other uses, including making Snivy one of the best Sticky Web checks in the metagame by giving it a +1 boost to Speed every time it comes in when the entry hazard is up. In addition, Defog lets it support its teammates by clearing entry hazards. However, Snivy's poor offensive movepool forces it to rely on Hidden Power for coverage against the wide variety of Pokemon that resist Leaf Storm. Additionally, Snivy hits 17 Speed, which, while decent, leaves it susceptible to being revenge killed by faster Pokemon; couple this with its mediocre defenses, and its sweeping potential becomes rather limited.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Eviolite Wallbreaker",
            "stats": [
                126,
                113,
                146,
                186,
                146,
                247
            ],
            "type": [
                "Grass"
            ],
            "usage": "With an Eviolite, Snivy can take on more of a pivot role, being able to switch into Drilbur, Mudbray, and Chinchou reliably and immediately go on the offensive. Leaf Storm deals enormous amounts of damage to anything that doesn't resist it. Snivy can use its Hidden Power to deal with the Grass-resistant foes that switch in to deal with it, as well as paralyze switch-ins with Glare if the move is run. Defog should be used to clear entry hazards as necessary to support its team. Synthesis should be used periodically to allow Snivy to keep attacking, but it forfeits momentum when it is used. Despite having an Eviolite, Snivy should try not to switch into attacks it does not resist.",
            "moves": [
                [
                    "Leaf Storm"
                ],
                [
                    "Defog",
                    "Glare",
                    "Knock Off"
                ],
                [
                    "Synthesis"
                ],
                [
                    "Hidden Power Ice",
                    "Hidden Power Ground",
                    "Hidden Power Fire"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Contrary"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                240,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Berry Juice",
            "stats": [
                126,
                113,
                146,
                186,
                146,
                247
            ],
            "type": [
                "Grass"
            ],
            "usage": "Leaf Storm is a very easy move to spam thanks to its enormous power and its side effect of boosting Snivy's Special Attack every time it is used. Snivy's Hidden Power can be used in situations where its coverage is needed, but keep in mind that Snivy usually has to have used Leaf Storm to boost its Special Attack to do decent damage with a Hidden Power. As this Snivy set does not have much longevity after its Berry Juice is gone, avoid switching into attacks that Snivy does not resist, and even then, it should only switch in infrequently. As such, Defog should be used only when necessary so that Snivy does not lose too many turns. If Substitute is chosen, it should be used when it is predicted that a foe will use a status move such as Thunder Wave, to activate Berry Juice and bring Snivy's HP to full, or on a switch to ease predictions. In a pinch, Snivy can set up a Substitute as a check enters the battlefield, use Glare to paralyze it, and continue to use Substitute until the foe is fully paralyzed for a turn in order to give Snivy two free attacks. Glare is also useful on its own to slow down faster checks such as Ponyta to allow Snivy to deal with it more easily later in the game.",
            "moves": [
                [
                    "Leaf Storm"
                ],
                [
                    "Defog",
                    "Substitute",
                    "Knock Off"
                ],
                [
                    "Glare",
                    "Defog"
                ],
                [
                    "Hidden Power Ice",
                    "Hidden Power Ground",
                    "Hidden Power Fire"
                ]
            ],
            "item": [
                " Berry Juice"
            ],
            "ability": [
                "Contrary"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                240,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Normalium Z",
            "stats": [
                126,
                85,
                146,
                185,
                145,
                247
            ],
            "type": [
                "Grass"
            ],
            "usage": "Unlike other Snivy sets, this Snivy is very frail; it should only be used once it can successfully sweep or to wallbreak. Bring Snivy into play against Pokemon it forces out, such as Chinchou. Use Leaf Storm as your opponent switches in a Snivy counter such as Foongus, and then use Breakneck Blitz to eliminate that counter. This set functions best as a lure, so don't reveal Wring Out until it can be used to eliminate a counter. In addition, this Snivy set can also clean late-game. Use Glare or Substitute on a predicted switch to either cripple a check or get off an attack for free, respectively. Finally, faster Pokemon such as Gastly and Doduo as well as any Choice Scarf users should be paralyzed or KOed before you attempt a sweep.",
            "moves": [
                [
                    "Leaf Storm"
                ],
                [
                    "Wring Out"
                ],
                [
                    "Hidden Power Ground"
                ],
                [
                    "Glare",
                    "Substitute"
                ]
            ],
            "item": [
                " Normalium Z"
            ],
            "ability": [
                "Contrary"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                240,
                0,
                252
            ],
            "iv spread": [
                31,
                0,
                31,
                30,
                30,
                31
            ]
        },
        {
            "name": "Choice Scarf",
            "stats": [
                126,
                113,
                146,
                186,
                146,
                247
            ],
            "type": [
                "Grass"
            ],
            "usage": "Choice Scarf Snivy's main purpose is as a late-game cleaner and situational sweeper, so be sure to remove Snivy's checks before it tries to sweep or clean. Important checks include Alolan Grimer, Vullaby, Foongus, and most of all Ferroseed. Snivy isn't that strong on its own, so it should usually be using Leaf Storm. Using Knock Off or Glare when you predict troublesome Pokemon to switch in can cripple Snivy's biggest foes. Since it's relatively uncommon, Choice Scarf Snivy can bluff being a slower variant and surprise faster Pokemon such as Choice Scarf Chinchou and Abra that would otherwise revenge kill it. Due to Choice Scarf Snivy's recovery being limited to Giga Drain, it must be kept as healthy as possible, and it should usually only be brought on a free switch. Prediction is important with Choice Scarf Pokemon, and Snivy is no exception. Be sure to use your Hidden Power of choice when you predict Pokemon weak to it to switch in. Snivy's coverage is also quite weak, so unless you're trying to score some surprise damage on a switch-in, these threats should be left to its teammates to deal with. Defog should be used sparingly due to being locked into the non-damaging move after use but can be very useful for supporting a teammate before Snivy faints. Due to this set's lack of a defensive item, it can't be switched in well on threats like Mudbray that it would otherwise be able to.",
            "moves": [
                [
                    "Leaf Storm"
                ],
                [
                    "Giga Drain",
                    "Defog"
                ],
                [
                    "Knock Off",
                    "Defog"
                ],
                [
                    "Hidden Power Ground",
                    "Hidden Power Fire"
                ]
            ],
            "item": [
                " Choice Scarf"
            ],
            "ability": [
                "Contrary"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                240,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Grass-resistant Pokemon",
        "Revenge Killers"
    ],
    "credits": [
        "Written by Nineage, Merritt,  and Drew",
        "Quality checked by Fiend, Rowan, OP, Nineage, Corporal Levi,  and Xayah",
        "Grammar checked by The Dutch Plumberjack, P Squared, GMars, Eyan,  and lotiasite"
    ]
}