{
    "name": "Snubbull",
    "forms": {
        "Base": {
            "base stats": [
                60,
                80,
                50,
                40,
                40,
                30
            ],
            "types": [
                "Fairy"
            ],
            "abilities": [
                "Intimidate",
                "Rattled",
                "Run Away"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Thanks to its Fairy typing and Intimidate, Snubbull acts as a reliable check to many metagame-defining Pokemon, including Mienfoo, Timburr, and Vullaby, and as a soft check to a slew of physical attackers. Numerous support options, including Heal Bell, Thief, and Thunder Wave, let Snubbull adequately support its team, and its good Attack, fantastic coverage options, and access to Bulk Up make it an immediate threat, generally outperforming other Fairy-types, most notably Spritzee, on offensive teams as a result. Although drawbacks in low Speed and a lack of built-in recovery mean that it is easily forced out and worn down, its coveted niche as an offensive Fighting-type check ensures that it remains very useful in the metagame.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Berry Juice",
            "stats": [
                165,
                225,
                181,
                104,
                165,
                105
            ],
            "type": [
                "Fairy"
            ],
            "usage": "Switch into predicted Knock Offs from Pokemon that Snubbull checks, notably including Mienfoo and Timburr, to immediately pressure the opposing team with Thief. Once Berry Juice has been activated or removed, aim to use Thief on a Pokemon that relies on Eviolite or Berry Juice, like Foongus or Magnemite, so that Snubbull gains bulk to better check its targets or even more longevity. Be careful of the opponent predicting Thief and switching to a Choice Scarf or Life Orb user, as those items cripple Snubbull. Do not switch Snubbull into Pawniard unless you are certain that it has a Choice Scarf and is locked into a resisted move, as Intimidate activates Defiant. For the same reason, be wary of double switches into Pawniard when switching Snubbull in on foes it obviously checks, which are mostly Fighting-types. Use Earthquake and Fire Punch on predicted Mareanie and Foongus switch-ins, respectively, as Snubbull will need to hit them on the switch to 2HKO them and they can easily shrug off damage dealt by Play Rough because of Regenerator. The same applies for faster Pokemon like Magnemite and Ponyta that don't mind Play Rough and can immediately force it out with the threat of a strong special attack or a burn. When predicting switch-ins that Snubbull can OHKO or come close to OHKOing with an unexpected coverage move, such as Ferroseed with Fire Punch or Close Combat, it is safer to only reveal such a coverage move after they have switched in so that Snubbull can act as a lure.",
            "moves": [
                [
                    "Play Rough"
                ],
                [
                    "Fire Punch",
                    "Earthquake"
                ],
                [
                    "Thief"
                ],
                [
                    "Earthquake",
                    "Bulk Up",
                    "Thunder Wave"
                ]
            ],
            "item": [
                " Berry Juice"
            ],
            "ability": [
                "Intimidate"
            ],
            "nature": [
                "Impish",
                "Careful"
            ],
            "ev spread": [
                36,
                116,
                116,
                0,
                196,
                36
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Sub Snub (Substitute)",
            "stats": [
                156,
                269,
                165,
                104,
                116,
                145
            ],
            "type": [
                "Fairy"
            ],
            "usage": "Switch Snubbull into Fighting-type Pokemon as often as possible. This set is designed to create momentum specifically against Mienfoo and Timburr, so take advantage of them as much as possible. To this end, don't be timid in your use of Substitute! Creating a Substitute allows Snubbull to block status, take weak or resisted hits, and pressure the opponent. For example, bringing Snubbull in on a Timburr will often cause your opponent to switch out their Timburr for a Pokemon better equipped to take Snubbull's powerful Play Rough, such as Ferroseed or Foongus. If you use Substitute on the switch turn, Snubbull will now be safe from status moves and will be able to 2HKO them with the appropriate coverage move. Another use of Substitute is to activate Berry Juice to restore Snubbull's HP in order to survive a strong hit and fire off one of your own, as it will activate as soon as Snubbull is below 50% HP. Additionally, your opponent may not expect Snubbull to have Substitute, which will grant you the element of surprise and may be key to luring in those key switch-ins to Snubbull. In addition to being able to steal momentum from Timburr- and Mienfoo-wielding opponents, due to Intimidate, Snubbull is an effective check to most physical attackers that lack type advantage. Lastly, be cautious of taking a Knock Off; while it will remove Snubbull's valuable Berry Juice, it will also allow it to make great use of Thief. In essence, weigh the risk of not having recovery with the reward of a guaranteed item theft.",
            "moves": [
                [
                    "Substitute"
                ],
                [
                    "Play Rough"
                ],
                [
                    "Thief"
                ],
                [
                    "Fire Punch",
                    "Earthquake"
                ]
            ],
            "item": [
                " Berry Juice"
            ],
            "ability": [
                "Intimidate"
            ],
            "nature": [
                "Adamant",
                "Jolly"
            ],
            "ev spread": [
                0,
                196,
                116,
                0,
                0,
                196
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Eviolite",
            "stats": [
                165,
                225,
                145,
                104,
                145,
                159
            ],
            "type": [
                "Fairy"
            ],
            "usage": "Be wary of Snubbull's Intimidate activating Pawniard's Defiant. Save unexpected coverage moves that can heavily damage slower foes, such as Fire Punch for Ferroseed, until after they have switched in so that they are not scared off. Otherwise, try to hit foes on the switch with coverage moves. Thanks to Intimidate, Snubbull can beat most physical attackers, including Drilbur and Doduo. When Snubbull is low on health, it can be sacked against a physical attacker for Intimidate's Attack drop as long as it does not faint to entry hazards in the process; alternatively, against a particularly threatening physical attacker, it can be repeatedly sent in after teammates have been sacked to reactivate Intimidate. Although Bulk Up Snubbull can occasionally be played against a sweeper in especially favorable matchups, it is generally used whenever Snubbull is not attempting to immediately damage a switch-in so that Snubbull can fire off more threatening attacks. If Thief is run, try to use it on an Eviolite or Berry Juice holder such as Croagunk after Snubbull has been hit by Knock Off, as Snubbull can take advantage of these items. This set is preferable for offensive teams that use Snubbull as their sole check to Fighting-types, as the increased initial bulk makes Snubbull more difficult to KO with an unexpected coverage move.",
            "moves": [
                [
                    "Play Rough"
                ],
                [
                    "Earthquake",
                    "Fire Punch"
                ],
                [
                    "Thief",
                    "Fire Punch"
                ],
                [
                    "Thunder Wave",
                    "Bulk Up",
                    "Thief"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Intimidate"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                36,
                116,
                36,
                0,
                116,
                196
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Poison-types",
        "Steel-types",
        "Bulky Fire-types",
        "Strong Special Attackers",
        "Physically Bulky Pokemon"
    ],
    "credits": [
        "Written by Corporal Levi and Berks",
        "Quality checked by Nineage, Hilomilo, Xayah,  and jake",
        "Grammar checked by talkingtree, CryoGyro, The Dutch Plumberjack,  and martha"
    ]
}