{"name": "Stakataka", "forms": {"Base": {"base stats": [61, 131, 211, 53, 101, 13], "types": ["Rock", "Steel"], "abilities": ["Beast Boost"], "tier": ["RUBL"], "form": "Base"}}, "overview": "Stakataka possesses a unique niche in the UU tier, as its respectable Attack stat in conjunction with one of the lowest Speed stats in the game gives it a monstrously strong Gyro Ball. In addition, Stakataka's ability to accrue boosts upon KOing opposing Pokemon through Beast Boost combined with its access to Trick Room can make it a devastating late-game sweeper under the right conditions. A Steel typing and massive 61 / 211 / 101 bulk make Stakataka a decent choice for offensive teams that struggle with common threats such as Latias and Crobat. However, Stakataka's secondary Rock typing hinders its defensive utility by leaving it vulnerable to common bulky Water-types like Swampert and Suicune and compounding its weakness to Ground- and Fighting-type moves, making Stakataka extremely vulnerable to common Pokemon in UU like Krookodile, Cobalion, and Hippowdon as well as leaving it extremely vulnerable to Mach Punch and Vacuum Wave from Infernape and Lucario, hindering its capacity to clean up under Trick Room. Stakataka is also extremely one-dimensional, as its movepool is quite limited outside of Trick Room and its STAB moves. Thus, the same pool of Pokemon that can check Stakataka will always be reliable stops to it.\n", "strategies' format": "UU", "strategies": [{"name": "Offensive Trick Room", "stats": [221, 397, 397, 142, 239, 31], "type": ["Rock", "Steel"], "usage": "Avoid switching Stakataka in until its checks or counters are weakened as much as possible, as taking unnecessary chip damage will hinder its ability to tank common priority moves such as Scizor's Bullet Punch and Crawdaunt's Aqua Jet when attempting to sweep. Stakataka should aim to set up on Pokemon that cannot damage it significantly such as Crobat and Latias, though its massive bulk will usually allow it to set up Trick Room on most neutral hits should the situation require it. Keep in mind that Continental Crush's targets, such as Scizor and Alomomola, are often not safely OHKOed by it and must take a sizeable amount of chip damage before they can be taken out. In addition, bulky Ground-types like Swampert and Hippowdon will stop Stakataka in its tracks and must be removed before it can sweep. Likewise, Fighting-types with priority like Infernape and Lucario must be removed to prevent them from revenge killing Stakataka with a fair amount of prior chip damage.", "moves": [["Trick Room"], ["Gyro Ball"], ["Stone Edge"], ["Earthquake"]], "item": [" Rockium Z"], "ability": ["Beast Boost"], "nature": ["Lonely"], "ev spread": [252, 252, 0, 0, 4, 0], "iv spread": [31, 31, 15, 31, 31, 0]}, {"name": "Defensive", "stats": [221, 298, 459, 142, 331, 27], "type": ["Rock", "Steel"], "usage": "Switch Stakataka into special attackers that don't have super effective STAB moves, such as Latias, Moltres, and Togekiss, and prioritize setting up Stealth Rock against them to punish opposing switch-ins as much as possible. However, in Togekiss's case, it is advised to scout for super effective coverage. Scout with Protect against potential Choice-locked Pokemon such as Hydreigon, Terrakion, and Scizor, but take into account that some of them can punish Stakataka's attempts at scouting by setting up. It is also advised to scout for super effective coverage on Pokemon like Latias and Necrozma, whose STAB moves are resisted by Stakataka, and act accordingly. Hence, unless your team has countermeasures to setup sweepers that have the potential to actually be Choice-locked attackers, Stakataka should not use Protect on them. Gyro Ball is Stakataka's strongest STAB option and is meant to hit faster threats such as Latias and Nihilego. However, because of its low PP, it should be preserved, and Stakataka should use Rock Blast more often, especially if you predict a Steel-resistant Pokemon to switch in. Furthermore, if possible, attempt to double switch if predicting a Steel-resistant Pokemon to switch in. If using Toxic, attempt to cripple opposing switch-ins to Stakataka, such as Swampert and Alomomola.", "moves": [["Gyro Ball"], ["Rock Blast"], ["Stealth Rock"], ["Protect", "Toxic"]], "item": [" Leftovers"], "ability": ["Beast Boost"], "nature": ["Sassy"], "ev spread": [252, 0, 4, 0, 252, 0], "iv spread": [31, 31, 31, 31, 31, 0]}], "counters": ["Ground-types", "Water-types", "Fighting-types", "Physically Bulky Steel-types"], "credits": ["Written by TSR and Amane Misa", "Quality checked by Cynde, Bouff, Pak, Hilomilo, Nuked,  and A Cake Wearing A Hat", "Grammar checked by The Dutch Plumberjack, A Cake Wearing A Hat,  and martha"]}