{
    "name": "Staryu",
    "forms": {
        "Base": {
            "base stats": [
                30,
                45,
                55,
                70,
                55,
                85
            ],
            "types": [
                "Water"
            ],
            "abilities": [
                "Analytic",
                "Illuminate",
                "Natural Cure"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Staryu is one of the best entry hazard removers in Little Cup thanks to its great Speed, good typing, and cool coverage. Though it competes with Defog users such as Vullaby, being able to maintain allied entry hazards when using Rapid Spin is an important advantage. Additionally, the combination of Hydro Pump and Analytic makes Staryu's offensive sets even more potent. All of these factors combine to make Staryu a great partner for hazard-fearing Pokemon such as Ponyta and Doduo and an overall excellent glue Pokemon.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "All-Out Attacker",
            "stats": [
                96,
                113,
                165,
                225,
                146,
                291
            ],
            "type": [
                "Water"
            ],
            "usage": "Staryu is pretty frail when it isn't carrying Eviolite, so be cautious about switching it into anything but the weakest attacks out there. Staryu is really, really strong with Analytic, so bring it in on something it forces out like Ponyta and take a hefty chunk out of whatever switches in with Staryu's high-powered attacks! Be sure to weaken Pokemon with priority attacks such as Timburr and Pawniard, as they can circumvent Staryu's excellent Speed and threaten it with their STAB priority attacks.",
            "moves": [
                [
                    "Hydro Pump"
                ],
                [
                    "Psychic",
                    "Thunderbolt"
                ],
                [
                    "Ice Beam",
                    "Thunderbolt"
                ],
                [
                    "Thunderbolt",
                    "Hidden Power Fire",
                    "Rapid Spin"
                ]
            ],
            "item": [
                " Eviolite",
                " Life Orb"
            ],
            "ability": [
                "Analytic"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                76,
                196,
                0,
                236
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Offensive Rapid Spin",
            "stats": [
                96,
                113,
                185,
                205,
                146,
                291
            ],
            "type": [
                "Water"
            ],
            "usage": "Staryu's main job is to use Rapid Spin to remove entry hazards, so you should make a significant effort to do this whenever possible. If you opponent is packing a Pumpkaboo, however, it may be wise to try to hit it with Ice Beam as it switches in, as no Pumpkaboo can avoid a 2HKO from the attack due to Analytic. In general, Staryu makes for a good switch-in to most Fire-, Rock-, and Ground-type Pokemon, as it is usually faster than them and can threaten them with its Water-type STAB attacks. Additionally, Staryu's excellent Speed allows it to revenge KO many fast, frail Pokemon such as Doduo and Gastly.",
            "moves": [
                [
                    "Rapid Spin"
                ],
                [
                    "Hydro Pump"
                ],
                [
                    "Ice Beam",
                    "Psychic",
                    "Thunderbolt"
                ],
                [
                    "Recover"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Analytic"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                156,
                116,
                0,
                236
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Defensive Rapid Spin",
            "stats": [
                125,
                113,
                185,
                176,
                146,
                291
            ],
            "type": [
                "Water"
            ],
            "usage": "This Staryu set, while more passive than others, tends to be able to switch into and spin against more Pokemon. In addition, this variant of Staryu is capable of switching directly into Gastly thanks to its greater Speed, its ability to OHKO Gastly with Psychic, and the fact that Natural Cure can nullify any Sludge Bomb poison status. Don't be afraid to use Scald unless the opponent has a Pokemon immune to Water-type attacks; its chance to burn the foe makes Scald an incredible move!",
            "moves": [
                [
                    "Rapid Spin"
                ],
                [
                    "Scald"
                ],
                [
                    "Psychic",
                    "Ice Beam",
                    "Thunderbolt"
                ],
                [
                    "Recover"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Natural Cure"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                116,
                0,
                156,
                0,
                0,
                236
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Bulky Water-type Pokemon",
        "Grass-type Pokemon",
        "Ghost-type Pokemon",
        "Fast Electric-types"
    ],
    "credits": [
        "Written by Berks",
        "Quality checked by Rowan, Nineage,  and macle",
        "Grammar checked by The Dutch Plumberjack and CryoGyro"
    ]
}