{
    "name": "Stunky",
    "forms": {
        "Base": {
            "base stats": [
                63,
                63,
                47,
                41,
                41,
                74
            ],
            "types": [
                "Poison",
                "Dark"
            ],
            "abilities": [
                "Aftermath",
                "Keen Eye",
                "Stench"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "With access to Pursuit and Sucker Punch, Stunky is able to trap and remove strong special attackers like Gastly and Abra very easily. Stunky also is able to carve its own niche as a Pursuit trapper that can remove hazards from the field. Its very nice defensive typing grants it an immunity to Psychic-type moves and a weakness to only Ground. However, this one weakness leaves Stunky vulnerable to Pokemon like Diglett, Mudbray, and Drilbur, which are very common. Unfortunately for Stunky, its abilities are mediocre at best; Stench doesn't really help Stunky do its job at all, and Aftermath is rarely useful. Stunky also struggles offensively because it lacks physical coverage options, and it typically has a hard time doing anything aside from Pursuit trapping and removing hazards. Stunky's complete lack of recovery leaves it prone to being worn down over the course of the battle. Alolan Grimer is almost always a better Pursuit trapper due to its better bulk and access to Knock Off.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Life Orb",
            "stats": [
                165,
                225,
                116,
                117,
                118,
                269
            ],
            "type": [
                "Poison",
                "Dark"
            ],
            "usage": "Maximum Speed investment allows Stunky to outrun fast Mienfoo and Onix, a must for this set. Hasty is preferable to Naive because Stunky resists STAB attacks from some of the most common special attackers in LC, such as Abra, Gastly, and Snivy. Maximum Attack investment, coupled with the boost from Life Orb, guarantees an OHKO on Diglett with Sucker Punch after Stealth Rock damage. It also allows Stunky to OHKO most Berry Juice variants of Vullaby with Play Rough and provides a good chance to OHKO standard Mienfoo and Timburr after their Eviolites have been removed.",
            "moves": [
                [
                    "Sucker Punch"
                ],
                [
                    "Play Rough"
                ],
                [
                    "Fire Blast"
                ],
                [
                    "Hidden Power Grass",
                    "Sludge Bomb"
                ]
            ],
            "item": [
                " Life Orb"
            ],
            "ability": [
                "Aftermath"
            ],
            "nature": [
                "Hasty"
            ],
            "ev spread": [
                12,
                252,
                0,
                0,
                0,
                244
            ],
            "iv spread": [
                31,
                31,
                30,
                30,
                31,
                31
            ]
        },
        {
            "name": "Offensive Utility",
            "stats": [
                162,
                225,
                145,
                106,
                181,
                185
            ],
            "type": [
                "Poison",
                "Dark"
            ],
            "usage": "Stunky is able to compress several roles into one Pokemon. You should use Stunky to Pursuit trap Pokemon like Abra and Gastly and to remove entry hazards from the field. If needed, you can switch Stunky into either Abra or Gastly, but if you do so, it is likely that Stunky will be too weakened to do very much after eliminating the opposing Pokemon. You should avoid switching Stunky into Pokemon that it does not wall like Mienfoo, Vullaby, and Staryu because it has no recovery and does not like taking continuous chip damage. Generally, it's recommended to try bringing in Stunky after one of your slower Pokemon uses U-turn or Volt Switch. After one of your Pokemon has been KOed, you can also send in Stunky to Pursuit trap a weakened target.",
            "moves": [
                [
                    "Pursuit"
                ],
                [
                    "Sucker Punch"
                ],
                [
                    "Defog"
                ],
                [
                    "Sludge Bomb",
                    "Fire Blast",
                    "Memento"
                ]
            ],
            "item": [
                " Eviolite"
            ],
            "ability": [
                "Aftermath"
            ],
            "nature": [
                "Careful"
            ],
            "ev spread": [
                0,
                252,
                60,
                0,
                188,
                4
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Steel-types",
        "Ground-types",
        "Bulky Pokemon with Recovery"
    ],
    "credits": [
        "Written by rssp1 and jake",
        "Quality checked by Coconut, Xayah, Hilomilo, Merritt, dcae,  and Corporal Levi",
        "Grammar checked by The Dutch Plumberjack and P Squared"
    ]
}