{"name": "Suicune", "forms": {"Base": {"base stats": [100, 75, 115, 90, 115, 85], "types": ["Water"], "abilities": ["Inner Focus", "Pressure"], "tier": ["UU"], "form": "Base"}}, "overview": "A great defensive Water typing and phenomenal natural bulk allow Suicune to perform as a frightening Calm Mind sweeper. With its great ability Pressure, Suicune can threaten offensive and defensive builds alike that have difficulty breaking through it. Despite common threats on defensive builds such as Toxapex not being scared of Suicune, it can still manage to PP stall a majority of defensive threats that would normally do a great job of checking Water-types, such as Ferrothorn, with Substitute and Pressure. However, commonly seen faster offensive threats like Tapu Koko and Timid Tapu Lele with Psyshock pressure Suicune out of setting up and breaking through numerous offensive teams in the metagame, although they must watch out for Scald burns. In addition, Suicune requires extensive support to get it to function well against teams which utilize defensive stops to it such as Toxapex, Mantine, and Tapu Fini.\n", "strategies' format": "OU", "strategies": [{"name": "Substitute + Calm Mind", "stats": [299, 167, 266, 216, 276, 286], "type": ["Water"], "usage": "Do not send out Suicune until all of its counters, such as Toxapex, Mantine, and Tapu Fini, are eliminated, as they will prevent Suicune from setting up Calm Mind boosts, thus leaving it only able to PP stall and throw out Scalds. Also do not come in when there are Toxic Spikes on the field from threats like Toxapex, as these reduce Suicune's longevity, meaning it has no chance to sweep properly. Calm Mind should be used when Suicune safely has a Substitute up when it needs to handle special attackers like Amoonguss better. However, be careful with using Suicune's Scald PP against threats that are not easily worn down, such as Amoonguss; while Suicune can PP stall it out, it needs its Scald PP in order to sweep after its checks and counters are weakened.", "moves": [["Scald"], ["Substitute"], ["Calm Mind"], ["Protect"]], "item": [" Leftovers"], "ability": ["Pressure"], "nature": ["Timid"], "ev spread": [252, 0, 0, 0, 40, 216], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Water-types", "Grass-types", "Electric-types and Coverage", "Taunt Users", "Status and Knock Off"], "credits": ["Written by Eclipse", "Earlier versions by Tokyo Tom", "Quality checked by Zamrock, Halcyon.,  and Subject 18", "Grammar checked by NixHex and GatoDelFuego"]}