{"name": "Surskit", "forms": {"Base": {"base stats": [40, 30, 32, 50, 52, 65], "types": ["Bug", "Water"], "abilities": ["Rain Dish", "Swift Swim"], "tier": ["LC"], "form": "Base"}}, "overview": "Surskit owns the title of fastest Sticky Web setter in Little Cup due to its ability to reach the 17 Speed benchmark, allowing it to outspeed a lot of the unboosted meta. Not only does Surskit have access to Sticky Web, but it also has an assortment of supportive and offensive options such as Ice Beam, Giga Drain, and Haze at its disposal. However, Surskit is quite weak due to its low base stats bar its Speed, with a lackluster Special Attack stat that only reaches the 14 benchmark and poor natural bulk. Bug and Water is also a relatively weak defensive typing, making Surskit vulnerable to the tier's multitude of Electric- and Flying-types. Surskit also loses to many common entry hazard setters and removers such as Vullaby and Onix, making it harder for it to set up Sticky Web while also forcing the player to use Surskit conservatively until all entry hazard removers are eliminated. While Sticky Web is an invaluable asset for teams dedicated to using it to its full potential, it can be difficult to utilize if the opposing team has naturally slow Pokemon such as Munchlax, airborne Pokemon such as Gastly and Vullaby, or Pokemon that can take advantage of the Speed drop such as Snivy and Pawniard.\n", "strategies' format": "LC", "strategies": [{"name": "Sticky Web Setter", "stats": [125, 86, 105, 185, 145, 247], "type": ["Bug", "Water"], "usage": "Surskit is almost always going to function as a suicide lead where it sets up Sticky Web, damages the foe with Scald, Giga Drain, or Ice Beam, or steals away the foe's item with Thief and then faints. Sticky Web is important to have on the field if the opponent has popular Choice Scarf users such as Drilbur and Magnemite or fast revenge killers such as Abra, as it can give your team more breathing room. However, do note that Surskit may not be worth leading with if the opposing team has entry hazard removers such as Staryu, Archen, and Vullaby, since they can easily remove Sticky Web once Surskit faints. If the opposing team has airborne Pokemon such as Doduo and Rufflet, naturally slower Pokemon such as Ferroseed and Croagunk, or Pokemon that can take advantage of Sticky Web such as Pawniard and Snivy, then it is best not to set up Sticky Web because it either loses its value or benefits the opposing team more. If you do end up conserving Surskit, it can function as a decent revenge killer due to its high Speed stat.", "moves": [["Sticky Web"], ["Hydro Pump", "Scald"], ["Giga Drain"], ["Haze", "Icy Wind"]], "item": [" Focus Sash", " Eviolite", " Choice Scarf"], "ability": ["Swift Swim"], "nature": ["Timid"], "ev spread": [36, 0, 20, 196, 20, 236], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Entry Hazard Removers", "Bulky Pokemon", "Taunt", "Snivy", "Pawniard"], "credits": ["Written by HotFuzzBall", "Quality checked by tahu, Fiend,  and Rowan", "Grammar checked by Mr. Uncompetitive and The Dutch Plumberjack"]}