{
    "name": "Swampert",
    "forms": {
        "Base": {
            "base stats": [
                100,
                110,
                90,
                85,
                90,
                60
            ],
            "types": [
                "Water",
                "Ground"
            ],
            "abilities": [
                "Damp",
                "Torrent"
            ],
            "tier": [
                "UU"
            ],
            "form": "Base"
        },
        "Mega": {
            "base stats": [
                100,
                150,
                110,
                95,
                110,
                70
            ],
            "types": [
                "Water",
                "Ground"
            ],
            "abilities": [
                "Swift Swim"
            ],
            "tier": [
                "OU"
            ],
            "form": "Mega"
        }
    },
    "overview": "Offensively, Swampert is the premier Mega Evolution choice on rain teams because of its Electric immunity. It also has the ability to break down conventional rain checks such as Toxapex, Ferrothorn, and Mantine due to its secondary STAB attack, Earthquake, and its array of coverage moves such as Superpower and Stone Edge. Mega Swampert can also provide great role compression because it is a Stealth Rock user that beats Mega Sableye. Defensively, Mega Swampert opens holes to Pokemon rain is already weak to, most notably Ash-Greninja and Keldeo. Mega Swampert suffers the same problem with other bulky physical attackers, as it is prone to chip damage from Rocky Helmet, Rough Skin, and Iron Barbs, meaning its bulk sometimes cannot be used practically. Mega Swampert is also dependent on rain to function, meaning it can only be used effectively when rain is active.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Rain Sweeper",
            "stats": [
                236,
                399,
                257,
                203,
                256,
                262
            ],
            "type": [
                "Water",
                "Ground"
            ],
            "usage": "One of Mega Swampert's best traits as a Swift Swim user is its high bulk, yet it is generally best not to use this bulk because Mega Swampert will need its health to survive priority attacks from Pokemon such as Mega Mawile and Ash-Greninja and attacks from faster Choice Scarf users such as Keldeo and Garchomp. Mega Swampert already finds itself vulnerable to forms of chip damage such as Spikes, Rocky Helmet, and Iron Barbs, as well as weaker attacks such as Tapu Koko's U-turn and Mega Medicham's Fake Out. Mega Swampert should also be kept away from status moves, as they make it useless or easier to deal when trying to dance around rain turns through continuous switching.",
            "moves": [
                [
                    "Waterfall"
                ],
                [
                    "Earthquake"
                ],
                [
                    "Ice Punch"
                ],
                [
                    "Stealth Rock",
                    "Superpower"
                ]
            ],
            "item": [
                " Swampertite"
            ],
            "ability": [
                "Damp"
            ],
            "nature": [
                "Jolly",
                "Adamant"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Water-types",
        "Grass-types",
        "Faster Pokemon",
        "Ash-Greninja",
        "Removing Rain"
    ],
    "credits": [
        "Written by Vertex",
        "Quality checked by Colonel M, Gary,  and Hootie",
        "Grammar checked by Wob and lotiasite"
    ]
}