{"name": "Swanna", "forms": {"Base": {"base stats": [75, 87, 63, 87, 63, 98], "types": ["Water", "Flying"], "abilities": ["Big Pecks", "Hydration", "Keen Eye"], "tier": ["Untiered"], "form": "Base"}}, "overview": "Swanna has both a great offensive and defensive typing; it is incredibly difficult to switch into and is also a decent check to the many popular Fighting-types like Gurdurr, Primeape, and Hitmonchan. Swanna's higher-than-average Speed tier lets it outspeed important threats such as Skuntank and Oricorio-E, and as a Choice Scarf user it is capable of outspeeding key threats such as Choice Scarf Primeape and +1 Jynx. Because Swanna is so effective at forcing switches and has few true counters, it can use the free turns generated to provide Defog support for its teammates, giving it further utility. Unfortunately, neither Swanna's offenses nor its defenses are particularly impressive. Its offenses are made up for by its high-powered STAB attacks, but Hurricane's accuracy and Brave Bird's recoil are both disappointing. Its defenses are made even worse by a weakness to Stealth Rock, leaving it unable to consistently wall many stronger threats.\n", "strategies' format": "PU", "strategies": [{"name": "Offensive Defog", "stats": [186, 189, 163, 273, 162, 324], "type": ["Water", "Flying"], "usage": "Swanna can switch into many passive foes and Pokemon with a type disadvantage, such as Qwilfish and Gurdurr, and use the opportunity to remove entry hazards. However, Swanna ought to prioritize wallbreaking in many matchups, as it can easily wear down most of its checks. However, if the opponent has a Pokemon such as Lanturn, Clefairy, or Type: Null that Swanna will be unable to break through, double switching to a physical attacker that can better handle them is often an effective strategy. Utilize Roost in order to better check Pokemon like Gurdurr throughout the match, but do not bother with it if Swanna does not need to stay healthy for longer matches. Be careful of using Defog against teams with Primeape, especially if Swanna or your other Fighting-type checks are weakened, as giving Primeape a Defiant boost can be deadly. Swanna's Z-Move does not have to be meticulously preserved; it can be a useful tool for nabbing KOs in certain situations but can be used whenever the opportunity presents itself.", "moves": [["Hurricane"], ["Scald"], ["Defog"], ["Roost"]], "item": [" Flyinium Z", " Life Orb"], "ability": ["Hydration"], "nature": ["Timid"], "ev spread": [0, 0, 4, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Choice Scarf", "stats": [186, 211, 162, 273, 145, 324], "type": ["Water", "Flying"], "usage": "Choice Scarf Swanna is mostly used as a revenge killer, and it should be brought in to force out or KO slower threats such as Jynx and Oricorio-G. The set has some surprise factor, so concealing Swanna's set through double switching and not using Brave Bird too early can lead to a surprise KO later on. Defog should only be used in emergency situations, as it forces Swanna to switch out after use and makes Swanna setup fodder. Swanna can often be used as a late-game cleaner, but be aware that Hurricane is an unreliable move. Use Brave Bird when possible, as it is a much safer option despite its recoil. However, Hurricane is necessary for KOing certain physically bulky Pokemon such as Gurdurr.", "moves": [["Hurricane"], ["Brave Bird"], ["Scald"], ["Defog"]], "item": [" Choice Scarf"], "ability": ["Hydration"], "nature": ["Naive"], "ev spread": [0, 4, 0, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Electric-types", "Specially Bulky Pokemon", "Faster Pokemon"], "credits": ["Written by pancake and Megazard", "Quality checked by Megazard, yogi,  and TONE", "Grammar checked by A Cake Wearing A Hat and The Dutch Plumberjack"]}