{
    "name": "Swoobat",
    "forms": {
        "Base": {
            "base stats": [
                67,
                57,
                55,
                77,
                55,
                114
            ],
            "types": [
                "Psychic",
                "Flying"
            ],
            "abilities": [
                "Klutz",
                "Simple",
                "Unaware"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        }
    },
    "overview": "Swoobat has two unique niches in its ability Simple and its blistering high Speed stat. With the capability to boost quickly, Swoobat's Special Attack skyrockets to absurd levels even after just one Calm Mind. Swoobat doesn't mind taking chip damage as much as other Pokemon, since it will be purposefully reducing its own health with Substitute, although the inability to use Substitute at low HP can be annoying. Not everything is that simple, however, as these niches come at the cost of being very predictable. Due to its extreme frailty, Swoobat will generally be KOed in one hit. It needs immense team support, like dual screens or Memento, to function properly. Swoobat's frailty also means that it is vulnerable to priority attacks such as Skuntank's Sucker Punch. Furthermore, Swoobat's dual typing overlaps weaknesses with several top-tier threats such as Mesprit, Aurorus, and Kingler. This, combined with its frailty and need for team support, makes it somewhat difficult to add while teambuilding. Swoobat is also over-reliant on setting up with Calm Mind, as otherwise it's left with a 20-Base Power Stored Power.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Calm Mind",
            "stats": [
                171,
                135,
                146,
                253,
                146,
                359
            ],
            "type": [
                "Psychic",
                "Flying"
            ],
            "usage": "Swoobat should never be directly switched into an oncoming attack; rather, it should be brought in safely with a slow pivot such as Eelektross or Type: Null, or after a Pokemon from your own side has fainted. Swoobat can also be used to revenge kill Pokemon such as Gurdurr, which it takes advantage of by setting up on the forced switch. Calm Mind should be used in the face of weaker special attackers such as Lurantis and Combusken. Contrarily, Substitute should be used in the face of passive Pokemon such as Clefairy, Audino, and Altaria or when you predict a switch. Make use of Memento and dual screens wisely by correctly determining when to use Calm Mind or Substitute to better the chances of a sweep. Swoobat has the best chance to sweep late-game, since it can have issues setting up more than once and prefers that checks and counters such as Skuntank, Spiritomb, and Choice Scarf Primeape and Togedemaru be removed before setting up.",
            "moves": [
                [
                    "Calm Mind"
                ],
                [
                    "Substitute"
                ],
                [
                    "Stored Power",
                    "Psychic"
                ],
                [
                    "Air Slash"
                ]
            ],
            "item": [
                " Salac Berry"
            ],
            "ability": [
                "Simple"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                4,
                0,
                0,
                252,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Priority Moves",
        "Faster Pokemon",
        "Sound-based Moves"
    ],
    "credits": [
        "Written by Aaronboyer",
        "Quality checked by allstarapology, UberSkitty,  and TONE",
        "Grammar checked by martha and A Cake Wearing A Hat"
    ]
}