{"name": "Sylveon", "forms": {"Base": {"base stats": [95, 65, 65, 110, 130, 60], "types": ["Fairy"], "abilities": ["Cute Charm", "Pixilate"], "tier": ["UU"], "form": "Base"}}, "overview": "Sylveon is one of the best clerics in the tier thanks to its mono-Fairy typing allowing it to switch into strong and powerful Dragon-, Dark-, and Fighting-type moves such as Latias and Hydreigon's Draco Meteor, Krookodile's Knock Off, and Infernape's Close Combat. It also has access to Wish and Heal Bell, which allows it to keep its teammates healthy throughout a match and get rid of potentially damaging status conditions. Additionally, it can take most unboosted special attacks due to its superb special bulk and can retaliate with a strong Pixilate-boosted Hyper Voice. However, some special attackers such as Volcanion and Primarina can 2HKO Sylveon in spite of its bulk. Latias in particular can beat Sylveon with a combination of Calm Mind and Roost. Sylveon is further held back by its mediocre base 65 Defense stat, which means it is 2HKOed by some physical attackers, such as Choice Band Infernape and Terrakion, even with maximum investment. Furthermore, it also has weaknesses to common Poison- and Steel-type moves from the likes of Scizor and Nidoking. It also faces competition from Florges, which trades a lower Defense stat and weaker attacks for more Speed and access to a one-turn recovery move.\n", "strategies' format": "UU", "strategies": [{"name": "Cleric", "stats": [289, 149, 251, 257, 296, 156], "type": ["Fairy"], "usage": "Come in on a Pokemon that Sylveon walls, such as Mega Sceptile or Hydreigon, and use Wish if you need to replenish the HP of Sylveon or use Hyper Voice to chip down frailer switch-ins like Mega Beedrill if this is not the case. Be careful of using Protect, however, as it could allow offensive threats such as Nidoking and Scizor to switch in freely. Lastly, be careful not to let Sylveon take stronger physical attacks such as those from Mamoswine, Terrakion, and Choice Band Infernape due to its middling Defense stat.", "moves": [["Hyper Voice"], ["Wish"], ["Protect"], ["Heal Bell"]], "item": [" Leftovers"], "ability": ["Pixilate"], "nature": ["Bold"], "ev spread": [252, 0, 252, 4, 0, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Steel-types", "Poison-types", "Physical Attackers", "Residual Damage"], "credits": ["Written by faded love", "Quality checked by dodmen, Eyan,  and Hilomilo", "Grammar checked by Wob and The Dutch Plumberjack"]}