{"name": "Talonflame", "forms": {"Base": {"base stats": [78, 81, 71, 74, 69, 126], "types": ["Fire", "Flying"], "abilities": ["Flame Body", "Gale Wings"], "tier": ["RUBL"], "form": "Base"}}, "overview": "Talonflame is able to carve a small niche in the UU metagame as a threatening sweeper and revenge killer for offensive teams thanks to its great speed, excellent offensive typing, ability Gale Wings, and access to the boosting move Swords Dance. Its Fire / Flying typing allows it to hit most of the metagame for neutral damage and grants it key resistances to Fire-, Fighting-, and Fairy-type attacks as well as an immunity to the common Ground-type. Its ability Gale Wings allows Talonflame to hit faster threats with its Flying-type STAB move before being hit in return, letting it deal great damage to common Choice Scarf users such as Krookodile and Hydreigon with Brave Bird or a Supersonic Skystrike if Gale Wings hasn't been broken.\nDespite these attributes, however, losing 50% of its health to Stealth Rock damage means that Talonflame requires a lot of support and constant entry hazard removal in order to function as a reliable sweeper or revenge killer, since any form of damage automatically stops it from making use of its ability. Its defenses also leave much to be desired, which makes it susceptible to Pursuit trappers, priority users, and faster Pokemon that resist its Flying-type moves such as Mega Aerodactyl, Zeraora, and Mega Manectric. Talonflame is also weak to Water-, Electric-, and Rock-type moves, meaning that it will often be walled or forced out by common threats such as Rotom-H and Mega Slowbro. Furthermore, most Rock-type Pokemon in the tier resist both of its attacks and can threaten Talonflame with a 4x effective STAB move or cripple it with status, with examples being Mega Aerodactyl and Stealth Rock setters such as Diancie. Lastly, Pokemon such as Infernape, Rotom-H, and Moltres give Talonflame competition as Fire-types due to their better secondary typing, more reliable abilities, ability to fit on more varied playstyles, or increased utility.\n", "strategies' format": "UU", "strategies": [{"name": "Swords Dance", "stats": [192, 261, 179, 165, 174, 386], "type": ["Fire", "Flying"], "usage": "Due to its great speed, offensive typing, and ability to wallbreak and revenge kill, Talonflame can be used at any stage of the battle. It functions best as a late-game sweeper, though, since its poor Attack stat sometimes stops it from reliably breaking through sturdier Pokemon such as Mega Slowbro and Alomomola without prior damage. Talonflame is able to force switches and wall passive threats such as Hippowdon, Gligar, and Fairy-types such as Sylveon and Florges when running Taunt; it must utilize these instances to set up with Swords Dance in order to break through bulkier Pokemon and sweep or, if running Flame Charge, to boost its Speed stat with the same goal.", "moves": [["Swords Dance"], ["Brave Bird"], ["Flare Blitz", "Flame Charge"], ["Roost", "Taunt", "Flame Charge"]], "item": [" Flyinium Z"], "ability": ["Gale Wings"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Stealth Rock", "Faster Threats", "Priority Attacks", "Electric-types", "Rock-types", "Water-types"], "credits": ["Written by KellyKafka", "Quality checked by vivalospride, Nuked,  and Hilomilo", "Grammar checked by The Dutch Plumberjack and Fireflame479"]}