{"name": "Tangrowth", "forms": {"Base": {"base stats": [100, 100, 125, 110, 50, 50], "types": ["Grass"], "abilities": ["Chlorophyll", "Leaf Guard", "Regenerator"], "tier": ["OU"], "form": "Base"}}, "overview": "Tangrowth is one of the best pivots in the OU metagame with its great defensive typing in Grass, which allows it to check a number of threats such as Ash-Greninja, Mega Diancie, Garchomp, and Tapu Koko. It can perform as a great wall both physically with its Rocky Helmet set as well as specially with an Assault Vest, which is required for surviving hits from Pokemon like Ash-Greninja. Tangrowth is able to fill these roles well due to Regenerator, allowing it to heal off passive damage while switching, retaining momentum for its teammates while still being able to repeatedly switch into the threats that it needs to check. Despite its general lack of power, Tangrowth has great utility moves such as Knock Off and coverage moves such as Earthquake for Heatran, Hidden Power Ice for Landorus-T, and Hidden Power Fire for Ferrothorn and Mega Scizor. However, Tangrowth is relatively passive and relies on its super effective coverage to be a threat, and the Assault Vest set is prone to Knock Off, which means that it has a much harder time switching into the threats that it needs to check if it loses its Assault Vest.\n", "strategies' format": "OU", "strategies": [{"name": "Assault Vest", "stats": [298, 236, 288, 256, 218, 122], "type": ["Grass"], "usage": "It is best to use Tangrowth's great bulk and wide set of resistances by switching it directly into the threats that it checks such as Tapu Koko, Keldeo, Manaphy, and Ash-Greninja; however, be careful when playing around Ash-Greninja, as it can put Tangrowth into a potential 2HKO range with either Ice Beam or Dark Pulse after Stealth Rock damage if Tangrowth is weakened. Due to Regenerator, Tangrowth can pivot into threats that can still hurt it and pivot back out to scout out what type of set the foe has. Knock Off in most cases is the safest move to throw out, as it can scout for items and potential Z-Crystals on the opposing team while weakening foes that rely on their items. Tangrowth can use its super effective coverage to weaken foes like Gliscor if it carries Hidden Power Ice and Ferrothorn if it has Hidden Power Fire. In most other cases, using Giga Drain or Knock Off is relatively safe. However, be wary of foes that tend to run Knock Off, such as opposing Tangrowth, as they can severely limit Tangrowth's ability to check the threats that it needs to; for example, an itemless Tangrowth can get 2HKOed by non-transformed Greninja with Choice Specs Dark Pulse after Stealth Rock.", "moves": [["Giga Drain"], ["Knock Off"], ["Hidden Power Ice"], ["Earthquake", "Sludge Bomb"]], "item": [" Assault Vest"], "ability": ["Regenerator"], "nature": ["Sassy"], "ev spread": [248, 0, 8, 0, 252, 0], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Physically Defensive", "stats": [298, 236, 372, 256, 148, 122], "type": ["Grass"], "usage": "This Tangrowth set is primarily used to check numerous physical attackers in the tier such as Landorus-T and Garchomp and should be used to switch directly into these threats. Due to this set's poor special bulk, switching into special attackers is not advised unless you are sure that Tangrowth can take the hit, such as against Zap Plate Tapu Koko, which does not 2HKO this set from full HP with Thunderbolt. Sleep Powder should be used on a predicted switch into a threat that you wish to incapacitate; this can also be taken advantage of by predicting the threat that the opponent wishes to use as sleep fodder by using Knock Off or switching into a teammate that can take advantage of the designated sleep fodder. Tangrowth can make use of its super effective coverage to damage its foes, but most of the time, Giga Drain and Knock Off are relatively safe moves to throw out, especially since Knock Off can let Tangrowth scout for items and pivot more easily.", "moves": [["Giga Drain"], ["Knock Off"], ["Sleep Powder"], ["Hidden Power Ice", "Hidden Power Fire"]], "item": [" Leftovers", " Rocky Helmet"], "ability": ["Regenerator"], "nature": ["Relaxed"], "ev spread": [248, 0, 212, 0, 48, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Mega Venusaur", "Flying-types", "Fire-types"], "credits": ["Written by Eclipse", "Quality checked by Colonel M, Gary,  and Hootie", "Grammar checked by Kris and Fireflame479"]}