{
    "name": "Tapu Lele",
    "forms": {
        "Base": {
            "base stats": [
                70,
                85,
                75,
                130,
                115,
                95
            ],
            "types": [
                "Psychic",
                "Fairy"
            ],
            "abilities": [
                "Psychic Surge",
                "Telepathy"
            ],
            "tier": [
                "OU"
            ],
            "form": "Base"
        }
    },
    "overview": "Tapu Lele easily sets itself apart from a jungle of powerful wallbreakers in OU due to its unique and utile ability: Psychic Surge. Said ability sets Psychic Terrain automatically, boosting Tapu Lele's Psychic-type attacks for free and making them wickedly difficult to tank or switch into directly. The Terrain also protects grounded Pokémon from priority attacks; as many priority users such as Mega Mawile, Ash-Greninja, and Mega Scizor rely on their respective attacks to stop faster threats, Tapu Lele can limit their actions and allow itself or teammates to completely overpower these threats. With these traits combined with great offensive stats and a good typing, Tapu Lele is a frightening force of nature, capable of utterly breaking numerous team archetypes while boasting unique threat coverage along with downright scary flexibility in its item and set usage. However, Tapu Lele dislikes the fact that many bulky Steel-types, especially Magearna and Celesteela, can easily switch into both of its STAB attacks. The coverage attacks it usually runs to address them as well as other checks and counters tend to be too weak or shaky to use consistently without fair prediction or prior damage. Tapu Lele's average physical bulk and good—but not fantastic—Speed also tend to hold it back, making it often vulnerable to revenge killing. Regardless, as Tapu Lele is always rather unforgiving in its power and versatility, all team archetypes must exercise caution against it.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Fightinium Z",
            "stats": [
                176,
                185,
                186,
                359,
                267,
                317
            ],
            "type": [
                "Psychic",
                "Fairy"
            ],
            "usage": "Compared to Psychium Z Tapu Lele, this set is better at luring checks to teammates. For example, it can lure Heatran and Ferrothorn for Mega Mawile and Mega Swampert, respectively. Because this Tapu Lele set is not Choice-locked, prediction is less necessary; feel free to throw out a move that is super effective against the foe currently on the field. Since Tapu Lele is notorious for running Psychic / Fairy / Fire coverage, a common way to pivot around it is using a core consisting of a Dark-type Pokemon, such as Greninja, with Heatran. Therefore, using All-Out Pummeling covers this common pivot.",
            "moves": [
                [
                    "Psychic",
                    "Psyshock"
                ],
                [
                    "Moonblast"
                ],
                [
                    "Taunt"
                ],
                [
                    "Focus Blast"
                ]
            ],
            "item": [
                " Fightinium Z"
            ],
            "ability": [
                "Psychic Surge"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Psychium Z",
            "stats": [
                176,
                185,
                186,
                359,
                267,
                317
            ],
            "type": [
                "Psychic",
                "Fairy"
            ],
            "usage": "Psychium Z Tapu Lele is ultimately a wallbreaker, so it should be kept relatively healthy against bulkier teams so that it can survive either multiple Seismic Tosses from Chansey or a Magma Storm from Heatran when the occasion necessitates it. Additionally, try to keep Tapu Lele free of status—a stray Toxic from Pokemon such as Toxapex can severely cut into its longevity. Because Tapu Lele is not using a Choice item on this set, predicting switches is not nearly as important. Feel free to simply use the move that hits the current Pokemon on the field super effectively; mispredicting is much less punishing. Calm Mind is often a safe play instead of needlessly predicting as well. As teams often try to pivot around Tapu Lele, using Calm Mind as the foe switches into a threat, namely Ash-Greninja, will allow Tapu Lele to survive the ensuing attack. Similarly, Focus Blast is also an excellent midground play against teams that try to use the core of either Heatran or Ferrothorn + a Dark-type Pokemon to deal with Tapu Lele.",
            "moves": [
                [
                    "Psyshock"
                ],
                [
                    "Moonblast"
                ],
                [
                    "Calm Mind"
                ],
                [
                    "Hidden Power Fire",
                    "Focus Blast"
                ]
            ],
            "item": [
                " Psychium Z"
            ],
            "ability": [
                "Psychic Surge"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Choice Specs",
            "stats": [
                176,
                185,
                186,
                359,
                267,
                317
            ],
            "type": [
                "Psychic",
                "Fairy"
            ],
            "usage": "Though this set sports terrifying nuking power that can let it potentially tear through threats early- or mid-game, it is important to ascertain its worth in a match depending on the opposing team structure. In particular, this set breaks balanced teams almost completely, as Tapu Lele is fast and powerful enough to overwhelm typical defensive Pokemon while limiting frailer offensive targets' opportunities to switch in. Still, this set should typically be played cautiously, as these archetypes can adapt to unfavorable situations with more bulky or resistant units. Against offensive teams with usually fast and defensively average Pokemon, Tapu Lele can typically exert pressure with Psychic and Moonblast all day until it eventually faints; in such cases, it has probably amassed more than enough damage for fellow cleaners to come in.",
            "moves": [
                [
                    "Psychic"
                ],
                [
                    "Moonblast"
                ],
                [
                    "Psyshock"
                ],
                [
                    "Hidden Power Fire"
                ]
            ],
            "item": [
                " Choice Specs"
            ],
            "ability": [
                "Psychic Surge"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Choice Scarf",
            "stats": [
                176,
                185,
                186,
                359,
                267,
                317
            ],
            "type": [
                "Psychic",
                "Fairy"
            ],
            "usage": "With the increased Speed provided by Choice Scarf as well as superb natural special offense, Tapu Lele can act as both a revenge killer and a cleaner. Depending on the opposing team, it may be wise to preserve Tapu Lele to do either later in the match. Be careful about simply pressing Psychic if the opponent has healthy Dark- and Steel-types active. In this case, use coverage moves to KO or wear such targets down on the switch. Even without a boosting item, Tapu Lele still has marginally enough power to wallbreak on rare occasions, in which case you can utilize it to weaken foes.",
            "moves": [
                [
                    "Psychic"
                ],
                [
                    "Moonblast"
                ],
                [
                    "Hidden Power Fire"
                ],
                [
                    "Focus Blast",
                    "Thunderbolt",
                    "Nature's Madness"
                ]
            ],
            "item": [
                " Choice Scarf"
            ],
            "ability": [
                "Psychic Surge"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Steel-type Pokemon and Coverage",
        "Speed-based Revenge Killing",
        "Miscellaneous Specially Defensive Pokemon",
        "Dark-types"
    ],
    "credits": [
        "Written by AccidentalGreed and sed",
        "Quality checked by Subject 18, dk,  and bludz",
        "Grammar checked by The Dutch Plumberjack and frenzyplant"
    ]
}