{
    "name": "Tapu Fini",
    "forms": {
        "Base": {
            "base stats": [
                70,
                75,
                115,
                95,
                130,
                85
            ],
            "types": [
                "Water",
                "Fairy"
            ],
            "abilities": [
                "Misty Surge",
                "Telepathy"
            ],
            "tier": [
                "OU"
            ],
            "form": "Base"
        }
    },
    "overview": "The main standout to Tapu Fini's niche is the fact that it is a Defog user that beats the two arguably best entry hazard setters in the tier in Heatran and Ash-Greninja while still having a decent matchup against other Stealth Rock users like Landorus-T, Mega Tyranitar, Gliscor, and Mega Diancie. Tapu Fini also acts as a decent check to the likes of Hawlucha and Keldeo. Misty Terrain is also incredibly helpful, keeping teammates safe from status, with some notable examples being keeping Mega Mawile protected from Will-O-Wisp and bulky Volcarona safe from Toxic. Taunt is also a wonderful move to have, enabling Tapu Fini to shut down the likes of Toxapex and Reuniclus. However, the lack of reliable recovery is still very crippling to Tapu Fini, meaning it's prone to getting worn down over the course of a match, especially if it has to check more than one Pokemon on the opposing team. This in turn means Tapu Fini will often need teammates as backup checks to what it's meant to check. By extension, that also means Tapu Fini hates getting its item removed, as Leftovers is its sole form of recovery, which means it even goes as far to demand a Knock Off resistance as a teammate. Additionally, the nature of its set means Tapu Fini is forced to pick two out of Moonblast, Scald, and Nature's Madness, which naturally hinders its matchup against some Pokemon it's supposed to check. Lastly, Tapu Fini also faces some competition from other Water-types like Toxapex thanks to the rather narrow niche it fills, and it also dislikes the prevalence of Grass-types like Tapu Bulu, Tangrowth, and Amoonguss, which it can't do much against.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Defog",
            "stats": [
                238,
                167,
                270,
                229,
                336,
                254
            ],
            "type": [
                "Water",
                "Fairy"
            ],
            "usage": "Tapu Fini's goal is to switch into Pokemon it checks like Ash-Greninja and Heatran and remove their entry hazards. However, try to scout if you're dealing with Ash-Greninja or its Protean counterpart, as Tapu Fini won't appreciate a Gunk Shot. Likewise, be a bit careful with the uncommon Steelium Z Heatran and, if possible, attempt to bait the Corkscrew Crash with a Steel-resistant Pokemon. Tapu Fini lacks reliable recovery, so its health should be preserved to check what it needs. If it checks more than one Pokemon on the opposing team, try to pivot into other teammates occasionally to prevent Tapu Fini from getting so weakened by one Pokemon it would check that it gets KOed by another. Try to position Misty Terrain in your favor. Teammates like Mega Mawile and Mega Medicham could appreciate a temporary immunity to burn, whereas the likes of Volcarona and Mega Charizard X could use a Toxic immunity to get setup opportunities. Be mindful of Misty Terrain weakening Dragon-type moves for the latter if you pack them, though.",
            "moves": [
                [
                    "Defog"
                ],
                [
                    "Moonblast",
                    "Nature's Madness"
                ],
                [
                    "Scald",
                    "Nature's Madness"
                ],
                [
                    "Taunt"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Misty Surge"
            ],
            "nature": [
                "Calm"
            ],
            "ev spread": [
                248,
                0,
                16,
                12,
                40,
                192
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Grass-types",
        "Electric-types and Coverage",
        "Residual Damage",
        "Strong Wallbreakers"
    ],
    "credits": [
        "Written by Lyd",
        "Earlier versions by AJB and p2",
        "Quality checked by Simia, Jordy,  and Indigo Plateau",
        "Grammar checked by frostration and Fireflame479"
    ]
}