{"name": "Tapu Bulu", "forms": {"Base": {"base stats": [70, 130, 115, 85, 95, 75], "types": ["Grass", "Fairy"], "abilities": ["Grassy Surge", "Telepathy"], "tier": ["OU"], "form": "Base"}}, "overview": "Tapu Bulu is capable of checking prominent threats in the OU tier like Gliscor, Ash-Greninja, Tapu Koko, and Mega Alakazam thanks to its typing and well-rounded bulk. Solid recovery options in Synthesis, Horn Leech, and Grassy Terrain make Tapu Bulu incredibly hard to wear down. Grassy Surge offers vital team support by powering up Grass-type attacks, weakening Ground-type moves, and providing grounded Pokemon with passive recovery. Tapu Bulu's incredibly strong Grass-type moves turn it into a devastating wallbreaker capable of breaking through many Grass-resistant foes such as Tornadus-T and Zapdos. However, Tapu Bulu's middling Speed tier leaves a lot to be desired, as it is outsped by threatening Pokemon like Heatran and Hoopa-U. Furthermore, the popularity of Steel-types that aren't weak to Superpower such as Celesteela and Mega Scizor as well as defensive Grass-types like Tangrowth and Mega Venusaur hurt Tapu Bulu's offensive capabilities.\n", "strategies' format": "OU", "strategies": [{"name": "Choice Band", "stats": [197, 393, 266, 185, 226, 230], "type": ["Grass", "Fairy"], "usage": "Prediction isn't usually too necessary with Choice Band Tapu Bulu. Spamming Tapu Bulu's Grass-type STAB moves is often the right step, with Horn Leech to get some HP back and Wood Hammer for a strong hit on the likes of Tornadus-T and Tangrowth. However, occasionally catching incoming Grass-resistant Pokemon is pivotal for the fate of a match. Ferrothorn, Heatran, and Kartana get a free opportunity to come in if Tapu Bulu uses either Grass-type STAB move; ergo, nailing them with Superpower is surely smart, as the former can set up entry hazards, whereas the latter two can land a powerful blow on Tapu Bulu's team. On the other hand, Volcarona and both Mega Charizard formes are pretty free to switch into Horn Leech or Wood Hammer, so catching them with a Stone Edge doesn't make Tapu Bulu setup bait. Try to keep up momentum with double switches to not let the likes of Mega Heracross and Mega Mawile in for free. Lastly, Tapu Bulu can pivot into offensive Pokemon whose STAB combo it walls, such as Ash-Greninja, Keldeo, and Crawdaunt. It can also switch in on predicted resisted hits, like Tapu Lele's Focus Blast, for example. However, Tapu Bulu should be mindful of Hydro Pump rolls from Ash-Greninja after more than a layer of Spikes, a Scald burn from Keldeo, or a Knock Off from Crawdaunt. As a rule of thumb, letting Tapu Bulu get worn down isn't the best of ideas in most matches, but trading might be useful in some situations.", "moves": [["Wood Hammer"], ["Horn Leech"], ["Superpower"], ["Stone Edge"]], "item": [" Choice Band"], "ability": ["Grassy Surge"], "nature": ["Adamant"], "ev spread": [84, 248, 0, 0, 0, 176], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Specially Defensive", "stats": [238, 296, 268, 185, 317, 186], "type": ["Grass", "Fairy"], "usage": "Use Tapu Bulu's defensive typing to pivot into dangerous attackers that it can generally check, such as Ash-Greninja, Tapu Koko, and Garchomp. Tapu Bulu forces many switches when it comes in against Pokemon it beats one-on-one, such as Clefable, Choice Scarf and defensive Landorus-T, and Ash-Greninja. Take advantage of these opportunities to set up a Swords Dance or recover Tapu Bulu's health with Synthesis. If the opponent has a bulky Steel-type that doesn't mind Grass- or Fighting-type moves, such as Mega Scizor or Celesteela, recovering Tapu Bulu's health or double switching accordingly is recommended to keep momentum, as Tapu Bulu is hard walled by these Pokemon. Don't hesitate to take a hit from Heatran and Tornadus-T if it means removing them from the game, as Tapu Bulu can stomach a hit from them and recover its HP later on in the game.", "moves": [["Swords Dance", "Bulk Up"], ["Horn Leech"], ["Superpower"], ["Synthesis", "Protect"]], "item": [" Leftovers"], "ability": ["Grassy Surge"], "nature": ["Careful"], "ev spread": [248, 0, 8, 0, 252, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fire-types", "Flying-types", "Steel-types", "Bulky Grass-types"], "credits": ["Written by Indigo Plateau, Jordy,  and locri", "Earlier versions by Leo, Hootie, sed,  and Eclipse", "Quality checked by Jordy, Talah, Leo,  and locri", "Grammar checked by lotiasite, P Squared, Fireflame479,  and GMars"]}