{
    "name": "Tapu Koko",
    "forms": {
        "Base": {
            "base stats": [
                70,
                115,
                85,
                95,
                75,
                130
            ],
            "types": [
                "Electric",
                "Fairy"
            ],
            "abilities": [
                "Electric Surge",
                "Telepathy"
            ],
            "tier": [
                "OU"
            ],
            "form": "Base"
        }
    },
    "overview": "Tapu Koko is a good offensive pivot in OU thanks to an ideal combination of speed, power, and a variety of team-supporting utilities at its disposal. Its base 130 Speed certainly stands out, allowing it to outrun and revenge KO most non-Choice Scarf Pokemon in OU sans Mega Alakazam, Mega Lopunny, and Ash-Greninja. Its fantastic Speed tier complements its access to U-turn and Volt Switch as well as its powerful Electric-type attacks thanks to stacked boosts from STAB and Electric Surge. Additionally, Tapu Koko's access to Taunt allows it to pressure defensively-oriented teams, adding to its versatility. Though its bulk is nothing special, its access to Roost and decent defensive typing allow it to check Pokemon like Tornadus-T, Hawlucha, and Mega Pinsir. However, the latter two can bypass it in certain circumstances, be it through chipping Tapu Koko in range of a +2 High Jump Kick, or by catching it off guard with an Earthquake. Although it has decent coverage, moves outside of Electric-type attacks can be rather underwhelming due to low Base Power and Tapu Koko's only decent base 95 Special Attack stat. While its Attack stat is solid, Wild Charge's added recoil prevents Tapu Koko from being able to use it as often. Because Tapu Koko's bulk is just about average, it can typically only switch into resisted or particularly weak attacks.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Defog Pivot",
            "stats": [
                181,
                239,
                206,
                289,
                191,
                385
            ],
            "type": [
                "Electric",
                "Fairy"
            ],
            "usage": "This Tapu Koko set is best used to proactively remove entry hazards in the early stages of the game, as it can still be quickly worn down in spite of its access to Roost due to its underwhelming bulk. However, if you're facing an entry hazard setter that Tapu Koko cannot Defog against, such as Ferrothorn, then it's best to remove the entry hazard setter before attempting to remove the hazards. This set is largely useful due to its ability to be a durable answer to Toxic Spikes, as Tapu Koko can consistently switch into and threaten Toxapex out while using Defog to remove Toxic Spikes. Be careful to not waste Tapu Koko's Z-Move too early on in the match because it can potentially be more useful when it's easier to guarantee a KO late-game. Finally, when facing a threat that Tapu Koko is necessary to check, such as Hawlucha or Mega Pinsir, ensure that Tapu Koko uses Roost often against targets that it threatens out such as Celesteela to guarantee that it will be able to survive boosted attacks from either target.",
            "moves": [
                [
                    "Thunderbolt"
                ],
                [
                    "Defog"
                ],
                [
                    "Roost"
                ],
                [
                    "U-turn",
                    "Hidden Power Ice"
                ]
            ],
            "item": [
                " Electrium Z",
                " Leftovers"
            ],
            "ability": [
                "Electric Surge"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                20,
                0,
                0,
                252,
                20,
                216
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Shuca Berry",
            "stats": [
                184,
                239,
                228,
                269,
                186,
                385
            ],
            "type": [
                "Electric",
                "Fairy"
            ],
            "usage": "Shuca Berry Tapu Koko generally does not need to predict early-game when compared to other Tapu Koko variants such as Choice Specs. Do not try to predict when it is unnecessary; Tapu Koko can afford to click Volt Switch even if a Ground-type such as Landorus-T or Gliscor comes in because Shuca Berry allows Tapu Koko to safely stay in and 2HKO them the next turn. Volt Switch also lulls the opponent into a false sense of security, tricking them into thinking that Tapu Koko is Choice-locked. Conversely, once the first Hidden Power Ice has landed, do not be afraid to predict. If your opponent needs to preserve their Ground-type, a smart, aggressive play can keep momentum in your favor and keep up the pressure.",
            "moves": [
                [
                    "Thunderbolt"
                ],
                [
                    "Volt Switch"
                ],
                [
                    "Hidden Power Ice"
                ],
                [
                    "Roost",
                    "Defog"
                ]
            ],
            "item": [
                " Shuca Berry"
            ],
            "ability": [
                "Electric Surge"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                32,
                0,
                88,
                172,
                0,
                216
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Dual Screens",
            "stats": [
                238,
                268,
                206,
                203,
                186,
                394
            ],
            "type": [
                "Electric",
                "Fairy"
            ],
            "usage": "Send in Tapu Koko early in the battle and set up both screens quickly to make way for your team's sweepers to set up. Use Taunt against Defog users to ensure that the screens aren't removed from the battlefield. Additionally, use Taunt against entry hazard users because teams with this set traditionally don't run entry hazard removal. Avoid letting Tapu Koko take needless damage, as it may need to set up screens again later in the game.",
            "moves": [
                [
                    "Taunt"
                ],
                [
                    "Reflect"
                ],
                [
                    "Light Screen"
                ],
                [
                    "U-turn"
                ]
            ],
            "item": [
                " Light Clay"
            ],
            "ability": [
                "Electric Surge"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                248,
                8,
                0,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Z-Wild Charge",
            "stats": [
                176,
                329,
                207,
                226,
                167,
                394
            ],
            "type": [
                "Electric",
                "Fairy"
            ],
            "usage": "Unlike Tapu Koko's special attacking sets, Electrium Z + Wild Charge is more inclined towards a supportive role than an independent role. Tapu Koko should not be trying to pave a way for itself but should instead lure in the intended targets of Gigavolt Havoc for teammates. Sometimes, it may not be best to use Gigavolt Havoc right away because it can be scouted for with a Ground-type. If possible, use U-turn on Gigavolt Havoc's targets to initially give off the impression that Tapu Koko is not carrying it and surprise them later with Tapu Koko's Z-Move. Regular Wild Charge will rarely be used outside of revenge killing, so this Tapu Koko set should be focused on keeping up momentum with U-turn and pressuring more passive Pokemon with Taunt when it has used its Z-Move.",
            "moves": [
                [
                    "Wild Charge"
                ],
                [
                    "Hidden Power Ice"
                ],
                [
                    "Taunt"
                ],
                [
                    "U-turn"
                ]
            ],
            "item": [
                " Electrium Z"
            ],
            "ability": [
                "Electric Surge"
            ],
            "nature": [
                "Naive"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Bulky Grass-type Pokemon",
        "Ground-type Pokemon and Coverage",
        "Revenge Killers"
    ],
    "credits": [
        "Written by AccidentalGreed, Vertex, LL,  and sed",
        "Quality checked by Subject 18, dk,  and PK Gaming",
        "Grammar checked by The Dutch Plumberjack and Fireflame479"
    ]
}