{"name": "Tentacruel", "forms": {"Base": {"base stats": [80, 70, 65, 80, 120, 100], "types": ["Water", "Poison"], "abilities": ["Clear Body", "Liquid Ooze", "Rain Dish"], "tier": ["UU"], "form": "Base"}}, "overview": "Tentacruel's good Water / Poison defensive typing, which allows it to check threats such as Infernape and Scizor whilst absorbing Toxic Spikes, and access to Rapid Spin are what really set it apart from other Water-types in the tier. Additionally, good utility options in Toxic Spikes, Haze, and Knock Off give it the ability to support different playstyles and archetypes, and a good Speed tier also lets Tentacruel outspeed and heavily chip down threats to balance such as Mamoswine and Nidoking before going down without much investment. However, its subpar physical bulk and a lack of recovery outside of Z-Haze leave it hard pressed to check threats such as Scizor and Cobalion over the course of a game and reliant on teammates to serve as primary checks. Tentacruel’s weakness to a common offensive typing in Ground, most Stealth Rock setters have, makes it more risky to remove entry hazards, even if they are forced out by Tentacruel’s Scald. Tentacruel also faces competition from Starmie as a spinner due to the fact Starmie has a much higher offensive presence and can switch into common Stealth Rock users such as Hippowdon and Swampert reliably. Tentacruel’s low damage output leaves it open to becoming setup fodder for bulky users, such as Reuniclus and Latias, even though Haze will deny their boosts if need be.\n", "strategies' format": "UU", "strategies": [{"name": "Defensive", "stats": [259, 158, 194, 196, 276, 299], "type": ["Water", "Poison"], "usage": "Due to its lack of recovery, Tentacruel’s HP should be preserved until necessary, so it should only be coming in on forced switches and Pokemon that cannot do meaningful damage to it, such as Scizor locked into Bullet Punch and defensive Pokemon such as Alomomola. Tentacruel additionally shouldn’t be attempting to use Rapid Spin on most Stealth Rock setters, as they can heavily damage or outright KO Tentacruel, outside of rare exceptions such as Empoleon and Cobalion. Tentacruel can be used to revenge kill weakened foes such as Mamoswine and Rotom-C if need be, but generally it shouldn’t be taking them on because Tentacruel is unable to OHKO most threats. Knock Off is a very useful tool to scout for items, such as seeing whether or not a Latias has a Z-Crystal on the switch-in. It also can be used to cripple threats such as Empoleon and Choice Specs Kyurem that rely on their items and often switch directly into Tentacruel. Knock Off is also extremely useful for chipping down bulkier threats such as Blissey by removing their Leftovers. Toxic Spikes are important when trying to break through bulkier archetypes, so try to set them as early as possible when facing them.", "moves": [["Scald"], ["Rapid Spin"], ["Haze"], ["Sludge Bomb", "Toxic Spikes", "Knock Off"]], "item": [" Black Sludge", " Icium Z"], "ability": ["Clear Body"], "nature": ["Timid"], "ev spread": [252, 0, 112, 0, 0, 144], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Psychic-types", "Electric-types", "Ground-types", "Dragon-types", "Offensive Pressure"], "credits": ["Written by faded love", "Earlier versions by EonX and Hilomilo", "Quality checked by Kreme, A Cake Wearing A Hat,  and Nuked", "Grammar checked by martha and The Dutch Plumberjack"]}