{
    "name": "Terrakion",
    "forms": {
        "Base": {
            "base stats": [
                91,
                129,
                90,
                72,
                90,
                108
            ],
            "types": [
                "Rock",
                "Fighting"
            ],
            "abilities": [
                "Justified"
            ],
            "tier": [
                "UU"
            ],
            "form": "Base"
        }
    },
    "overview": "Terrakion has a great Speed tier that allows it to perform as a decent offensive Stealth Rocker. It possesses a near-unresisted STAB combination, which allows Terrakion to serve as a strong wallbreaker and cleaner for offensive teams. On the downside, however, its typing also leaves it weak to Ground-, Water-, and Grass-type moves used by Landorus-T, Greninja, and Tangrowth, which are all common in the OU tier; this also means that it can be easily revenge killed by Ash-Greninja's Water Shuriken. In addition, it also faces competition as a wallbreaker and entry hazard setter from other threats, such as Landorus-T.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Swords Dance",
            "stats": [
                218,
                357,
                217,
                162,
                216,
                346
            ],
            "type": [
                "Rock",
                "Fighting"
            ],
            "usage": "This set serves mainly as an early-game wallbreaker, using its great Speed tier to threaten defensive threats such as Celesteela, Landorus-T, and Ferrothorn after a Swords Dance boost using Continental Crush. Bringing Terrakion in with the assistance of Volt Switch and U-turn or double switches is a great way of keeping it healthy so that it does not fall to priority moves such as +2 Bisharp's Sucker Punch later on in the match. When using this set, Stone Edge is the safer move to use due to its lack of resistant Pokemon in the metagame, but you can predict threats that resist Rock-type moves such as Scarf Excadrill to come in by hitting them with Close Combat on the switch. Use Swords Dance on a predicted switch into a defensive threat, such as Landorus-T, and take it out with a Continental Crush, although you should be wary for opponents that try to scout for the Z-Move. The way this set is used depends on the last slot; if using Stealth Rock, it is wise to set it up against threats that Terrakion normally forces out such as Ferrothorn or Heatran.",
            "moves": [
                [
                    "Swords Dance"
                ],
                [
                    "Stone Edge"
                ],
                [
                    "Close Combat"
                ],
                [
                    "Stealth Rock"
                ]
            ],
            "item": [
                " Rockium Z"
            ],
            "ability": [
                "Justified"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Choice Scarf",
            "stats": [
                218,
                357,
                217,
                162,
                216,
                346
            ],
            "type": [
                "Rock",
                "Fighting"
            ],
            "usage": "Given that this set's primary function is as a revenge killer, it is recommended to bring Terrakion in after an opposing sweeper has KOed a teammate so that it can retaliate using its great STAB coverage. In addition to this, if the opposing team has been sufficiently weakened, this set can also serve as a cleaner due to its great Speed and STAB moves. When using this set, Stone Edge is a more spammable move than Close Combat, but Close Combat can be used if you are predicting a threat that resists Terrakion's Rock-type STAB to switch in, such as a Steel-type like Ferrothorn or a Ground-type like Garchomp. The decision between using Stone Edge and Rock Slide to revenge kill depends on the threat that Terrakion is up against and their amount of HP. For example, it is always safe to use Rock Slide to revenge kill Volcarona, which faints from full, but not against the likes of Salamence and Mega Charizard X, as they are not OHKOed. Stone Edge is necessary until they have taken enough damage to be KOed by Rock Slide. If a threat that can continuously come in on Terrakion such as Landorus-T or Tangrowth is healthy, then it is a good idea to go for Toxic, as it will hinder their ability to switch into Terrakion later on.",
            "moves": [
                [
                    "Stone Edge"
                ],
                [
                    "Close Combat"
                ],
                [
                    "Rock Slide"
                ],
                [
                    "Toxic",
                    "Earthquake"
                ]
            ],
            "item": [
                " Choice Scarf"
            ],
            "ability": [
                "Justified"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                0,
                252,
                4,
                0,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Ground-types",
        "Water-types",
        "Grass-types",
        "Priority"
    ],
    "credits": [
        "Written by Eclipse",
        "Earlier versions by Ash Borer",
        "Quality checked by Gary, dk,  and Subject 18",
        "Grammar checked by Winry and P Squared"
    ]
}