{
    "name": "Throh",
    "forms": {
        "Base": {
            "base stats": [
                120,
                100,
                85,
                30,
                85,
                45
            ],
            "types": [
                "Fighting"
            ],
            "abilities": [
                "Guts",
                "Inner Focus",
                "Mold Breaker"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        }
    },
    "overview": "Throh's access to STAB Circle Throw makes it a very durable phazer; it is able to wear teams down due to its ability to take hits with its respectable bulk, and it will almost always force a Pokemon to be brought out against it. It is also able to hold its own against special attackers such as Pyroar and Combusken. These attributes let it serve as a bulky setup sweeper with Bulk Up, and it is because of this that Throh is able to hold a niche over other Fighting-types in the tier, such as Gurdurr and Hitmonchan, despite competing with them for a teamslot. Additionally, its ability Guts lets Throh act as a status absorber for its team, allowing it to switch into Scald and other status moves with near-impunity. However, Throh relies on entry hazard damage through phazing to deal most of its damage, meaning Ghost-types like Haunter and Oricorio-G effectively shut down sets that lack Knock Off. Throh has great bulk, but this is somewhat diminished by its subpar typing, bringing few notable resistances and making it weak to prominent Psychic-types such as Jynx, Mesprit, and Musharna. This, combined with Throh's lack of reliable recovery, means that it is prone to getting worn down easily over the course of a match and forces it to rely on RestTalk as a means of recovery.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "RestTalk",
            "stats": [
                338,
                236,
                208,
                86,
                295,
                126
            ],
            "type": [
                "Fighting"
            ],
            "usage": "Early- to mid-game, Throh should pivot into Pokemon such as Regirock and attempt to wear down its switch-ins with Circle Throw or Knock Off. Throh can also pivot into status spreaders such as Lanturn in order to absorb status for its team and boost its Attack thanks to Guts and use Rest to get rid of the status after. Throh can also function well late-game as a bulky sweeper, once its checks are worn down sufficiently enough or are removed. This is especially important if Throh lacks Knock Off, as it'll give Ghost-types free switch ins otherwise. Try to use Rest whenever Throh's HP gets too low so as to not let it get worn down so fast. However be mindful of clicking Rest too early, as Throh is forced to then rely on the rather shaky Sleep Talk.",
            "moves": [
                [
                    "Rest"
                ],
                [
                    "Sleep Talk"
                ],
                [
                    "Circle Throw"
                ],
                [
                    "Bulk Up",
                    "Knock Off"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Guts"
            ],
            "nature": [
                "Careful"
            ],
            "ev spread": [
                248,
                0,
                8,
                0,
                252,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Psychic-types",
        "Ghost-types",
        "Flying-types",
        "Weezing",
        "Offensive Pressure"
    ],
    "credits": [
        "Written by 5FingerMachPunch",
        "Quality checked by yogi, Megazard,  and TONE",
        "Grammar checked by Lemonade and The Dutch Plumberjack"
    ]
}