{"name": "Timburr", "forms": {"Base": {"base stats": [75, 80, 55, 25, 35, 35], "types": ["Fighting"], "abilities": ["Guts", "Iron Fist", "Sheer Force"], "tier": ["LC"], "form": "Base"}}, "overview": "Timburr has a myriad of positive traits that make it one of the best bulky attackers in the Little Cup metagame. Its high Attack stat and good bulk give it increased longevity and the ability to hit hard, and its Fighting typing is good both offensively and defensively. Timburr can take advantage of these traits with STAB Drain Punch, which gives it a recovery option, and Mach Punch, which is a reliable form of priority. To complement its STAB moves, Timburr has a good selection of coverage options, including Knock Off, Poison Jab, and the elemental punches, which allows it to hit its checks, and it also has access to Bulk Up, which turns it into a frightening late-game wincon. Timburr's abilities don't hurt either, with Guts giving Timburr the ability to switch into status-inducing moves without fear and Iron Fist boosting the power of many of Timburr's attacks. Timburr is held back, however, by its poor Speed stat, which leaves it outrun by most of the metagame, and its tendency to being worn down hurts its ability to reliably switch in over the course of a match. It also suffers from four-moveslot syndrome to an extent, as it has to choose whether to run a coverage move that hits Flying-types or one that hits Fairy-types.\n", "strategies' format": "LC", "strategies": [{"name": "Bulky Attacker", "stats": [186, 269, 185, 77, 145, 106], "type": ["Fighting"], "usage": "This Timburr set should be used as an offensive pivot, switching in when it can, regaining its health with Drain Punch, and forcing switches. Timburr's typing makes it a great Knock Off absorber, so it's able to switch in on many Knock Off users, such as Pawniard, and threaten them. Later in a match, Mach Punch can be used to pick off weakened threats. Take advantage of Timburr's coverage options to surprise would-be checks, such as Vullaby if Ice Punch is run and Snubbull and Spritzee if Poison Jab is run.", "moves": [["Drain Punch"], ["Mach Punch"], ["Knock Off"], ["Fire Punch", "Ice Punch", "Poison Jab"]], "item": [" Eviolite"], "ability": ["Iron Fist", "Guts"], "nature": ["Adamant"], "ev spread": [0, 196, 156, 0, 156, 0], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Bulk Up", "stats": [186, 225, 185, 77, 181, 106], "type": ["Fighting"], "usage": "Early- and mid-game, Timburr can use Mach Punch to pick off weakened threats. Otherwise, it should try to avoid being hit by Knock Off or taking too much damage to maximize its sweeping potential at the end of a match. Once Timburr's checks have been weakened or KOed, it can set up Bulk Up against a Pokemon that can't KO it and sweep an opposing team, regaining HP with Drain Punch and hitting fast, frail attackers with a boosted Mach Punch. If Timburr has to be used early-game, it should draw in its checks and then use Knock Off, which will remove Eviolites and enable Timburr's teammates to more easily wear them down.", "moves": [["Drain Punch"], ["Mach Punch"], ["Knock Off"], ["Bulk Up"]], "item": [" Eviolite"], "ability": ["Guts", "Iron Fist"], "nature": ["Careful"], "ev spread": [0, 116, 156, 0, 236, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fairy-types", "Poison-types", "Flying-types"], "credits": ["Written by Nineage", "Quality checked by Rowan, Xayah,  and tahu", "Grammar checked by CryoGyro and Fireflame479"]}