{"name": "Togedemaru", "forms": {"Base": {"base stats": [65, 98, 63, 40, 73, 96], "types": ["Electric", "Steel"], "abilities": ["Iron Barbs", "Lightning Rod", "Sturdy"], "tier": ["NU"], "form": "Base"}}, "overview": "Togedemaru finds a solid place in NU thanks to its unique type combination that allows it to be a reliable answer to a number of Pokemon in the tier, such as Vivillon, Vikavolt, Alolan Exeggutor, Whimsicott, and Comfey. It differentiates itself from other Steel-type Pokemon in the tier thanks to Wish, giving it longevity other Steel-types like Silvally-Steel, Steelix, and Klinklang lack. Togedemaru can also act as a great pivot with a nice Speed tier that allows it to outspeed most defensive Pokemon with little Speed investment. However, its low natural bulk makes it difficult to switch in, even on resisted hits. Even after investing into its defenses, it often falls short of consistently checking better special attackers in the tier like Alolan Exeggutor.\n", "strategies' format": "NU", "strategies": [{"name": "Specially Defensive Pivot", "stats": [229, 232, 162, 104, 256, 241], "type": ["Electric", "Steel"], "usage": "Because of Togedemaru's low bulk, it has to watch out for additional coverage moves like Focus Blast from Heliolisk as well as super effective Hidden Power variants from Comfey. The majority of the time it will be pivoting around with U-turn against any of its answers or passing a Wish if a teammate is worn down. Spiky Shield ensures Togedemaru will get its Wish recovery on the second turn and helps bridge its weakness to additional coverage moves and Z-Moves. It also gives Togedemaru a way of punishing physical attackers like Passimian and Medicham when they are trying to use Close Combat, U-turn, or High Jump Kick. Utilize Zing Zap or Iron Head when in a comfortable position against frail special attackers like Vivillon.", "moves": [["Wish"], ["Spiky Shield"], ["U-turn", "Super Fang"], ["Zing Zap", "Iron Head"]], "item": [" Leftovers"], "ability": ["Lightning Rod"], "nature": ["Careful"], "ev spread": [252, 0, 0, 0, 204, 52], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Ground-types", "Fire-types", "Fighting-types", "Physically Defensive Pokemon"], "credits": ["Written by Rhydonphilip", "Quality checked by Rabia, quziel,  and Finchinator", "Grammar checked by The Dutch Plumberjack and Rabia"]}