{
    "name": "Torkoal",
    "forms": {
        "Base": {
            "base stats": [
                70,
                85,
                140,
                85,
                70,
                20
            ],
            "types": [
                "Fire"
            ],
            "abilities": [
                "Drought",
                "Shell Armor",
                "White Smoke"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        }
    },
    "overview": "Torkoal is a reliable setter for sun teams, making the playstyle a very viable option. As a result, Torkoal makes Pokemon such as Venusaur, Leafeon, and Charizard viable as well. Other than that, Torkoal has the privilege of learning Stealth Rock, as well as boasting a high Defense stat, which makes it capable of checking physically offensive Pokemon such as Mega Glalie, Choice Scarf Heracross, Doublade, and Durant. It also checks strong Psyshock users such as Gardevoir. Moreover, Torkoal has access to support moves including Will-O-Wisp and Yawn, which helps its partners in breaking the opposing team. However, Torkoal lacks reliable recovery and has a poor defensive typing, being weak to Stealth Rock and having weaknesses to common types like Water, Ground, and Rock. Torkoal is also very slow, drains a lot of momentum upon switching in, and suffers from a poor Special Defense stat, which leaves it 2HKOed by most strong special attacks.\n",
    "strategies' format": "RU",
    "strategies": [
        {
            "name": "Sun Support",
            "stats": [
                238,
                185,
                416,
                206,
                178,
                76
            ],
            "type": [
                "Fire"
            ],
            "usage": "Torkoal should be used as a lead, using Stealth Rock as soon as possible. After setting Stealth Rock, Torkoal can attempt to weaken foes by spamming Lava Plume and Toxic. It is useful to continuously spam Yawn whenever it hits a foe, as they tend to switch out to prevent falling sleep. This allows Torkoal to wear down the opposing team while entry hazards are up. Torkoal should not use Explosion early-game; Explosion should only be used late-game when the opposing team is weakened enough and when you need a free switch to one of your sweepers. Lastly, it is wise to preserve Torkoal at low health in order to set up sun late-game for its partners to attempt to sweep.",
            "moves": [
                [
                    "Stealth Rock"
                ],
                [
                    "Lava Plume"
                ],
                [
                    "Explosion"
                ],
                [
                    "Toxic",
                    "Will-O-Wisp"
                ]
            ],
            "item": [
                " Heat Rock"
            ],
            "ability": [
                "Drought"
            ],
            "nature": [
                "Bold"
            ],
            "ev spread": [
                248,
                0,
                252,
                0,
                8,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Bulky Water-types",
        "Bulky Rock-types",
        "Specially Offensive Pokemon",
        "Knock Off",
        "Residual Damage"
    ],
    "credits": [
        "Written by Arifeen",
        "Quality checked by phantom, col49,  and avocado",
        "Grammar checked by Eyan and P Squared"
    ]
}