{"name": "Tornadus", "forms": {"Base": {"base stats": [79, 115, 70, 125, 80, 111], "types": ["Flying"], "abilities": ["Defiant", "Prankster"], "tier": ["RUBL"], "form": "Base"}}, "overview": "Tornadus is a versatile offensive Pokemon that can function as a wallbreaker with its solid power and coverage or as a utility pivot with U-turn and Prankster status moves like Defog and Tailwind. Its high Special Attack and high Speed allow it to outspeed several prominent threats in UU, including Kommo-o, Celebi, and Infernape, and overpower them with STAB Hurricane. It also can utilize Supersonic Skystrike to even break past bulkier offensive threats like Latias and Terrakion after minor chip damage. This middle ground of power and Speed allows it to distinguish itself from other Flying-type choices. Its large range of coverage options also benefits it, allowing it to utilize moves like Superpower and Heat Wave to greatly limit its switch-ins. Unfortunately, Tornadus provides very little defensive utility to teams due to its Stealth Rock weakness, lack of recovery, mediocre defenses, and lack of useful resistances. Because of this, it faces competition from other offensive Flying-types such as Moltres, Mega Pidgeot, and Togekiss, which have better defensive typings, better bulk, and access to reliable recovery. Its reliance on Hurricane as its STAB attack can be disadvantageous due to the move's poor accuracy. Lastly, due to Tornadus's poor defenses and typing, it struggles to do anything of worth to most priority users like Mamoswine and Scizor, as they can power through it easily after minor chip damage.\n", "strategies' format": "UU", "strategies": [{"name": "Life Orb", "stats": [194, 267, 158, 349, 196, 353], "type": ["Flying"], "usage": "This set is aimed to function as more of a wallbreaker on offensive teams, due to Tornadus's great coverage and attacking stats allowing it to threaten a large portion of the metagame. Because of its lacking defensive utility, Tornadus should be brought into play via pivot support or after a teammate has fainted so it doesn't compromise its already limited longevity. Hurricane should be spammed against teams due to its impressive general coverage, tough Tornadus should try predicting a switch-in to the attack, such as Klefki or Blissey, if they're on the opposing team and healthy and nailing them with super effective coverage on the switch. Defog is best to use on forced switches when entry hazards are on Tornadus's side of the field. Thanks to its ability to force out several Stealth Rock setters like Hippowdon and Swampert, it can also often successfully attempt to switch in on them as they set Stealth Rock. Defog can also be used when Tornadus is weakened in a last-ditch effort to keep entry hazards off its side of the field. Tailwind should be used when Tornadus is weakened into range of a KO from the next attack to hit it, as this can generate momentum for its teammates while also providing them with a boost in Speed. Tornadus's Speed tier should be utilized to revenge kill various threats, such as Terrakion, Cobalion, and Hydreigon, once they've been weakened a bit.", "moves": [["Hurricane"], ["Heat Wave"], ["Superpower"], ["Grass Knot", "Defog", "Tailwind"]], "item": [" Life Orb"], "ability": ["Defiant", "Prankster"], "nature": ["Hasty"], "ev spread": [0, 4, 0, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Offensive Support", "stats": [194, 267, 158, 349, 196, 353], "type": ["Flying"], "usage": "This set's main goal is to act as an offensive pivot, meaning Tornadus will often be brought into play either to weaken the opposing team with its attacks or to use Defog before generating momentum with U-turn. Due to its poor defensive utility, Tornadus is best to bring into play through the support of a pivot or after a teammate has fainted. It can come in on predicted Ground-type attacks from the likes of Gligar and Hippowdon, however. When Tornadus is weakened and entry hazards are on its side of the field, it should attempt using Defog as a last-ditch effort to remove them before fainting. If Tailwind is being run, it should be used late-game to allow a teammate to clean up with an enhanced Speed tier. It's also best used when Tornadus is weakened, as it will give a teammate a free switch into play upon Tornadus fainting after using the move. U-turn should be used to pivot out of Pokemon that Tornadus won't be able to muscle past before losing to, such as Mega Aggron and Nihilego.", "moves": [["Hurricane"], ["U-turn"], ["Superpower", "Heat Wave"], ["Defog", "Tailwind"]], "item": [" Flyinium Z"], "ability": ["Prankster"], "nature": ["Hasty", "Timid"], "ev spread": [0, 4, 0, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Faster Offensive Pokemon", "Electric-types", "Rock-types", "Specially Bulky Pokemon"], "credits": ["Written by Hilomilo", "Quality checked by Nuked, martha,  and A Cake Wearing A Hat", "Grammar checked by The Dutch Plumberjack and A Cake Wearing A Hat"]}