{
    "name": "Torterra",
    "forms": {
        "Base": {
            "base stats": [
                95,
                109,
                105,
                75,
                85,
                56
            ],
            "types": [
                "Grass",
                "Ground"
            ],
            "abilities": [
                "Overgrow",
                "Shell Armor"
            ],
            "tier": [
                "NU"
            ],
            "form": "Base"
        }
    },
    "overview": "Torterra carves itself a niche in the tier by providing Stealth Rock support and acting as a solid check to top metagame threats like Zygarde-10%, Barbaracle, Tyrantrum, and Metagross thanks to its typing, reliable recovery, and solid bulk. However, although Torterra has a decent Attack stat and access to strong STAB moves, it struggles to make much headway with Flying-types such as Noivern and Mandibuzz, Grass-types like Shaymin and Virizion, and other defensive threats like Bronzong all being extremely common in the tier. Torterra's performance as a Stealth Rock setter is somewhat lackluster at times due to the fact that it's forced out by Mega Blastoise and just flat-out can't do anything to common Defoggers in Mandibuzz and Sigilyph. Though Torterra's defensive typing definitely has its boons, it leaves Torterra with crippling weaknesses to Flying, Fire, and Ice. This along with its mediocre Special Defense means it's absolute food for prominent Pokemon like Ninetales, Noivern, Arcanine, and Mega Abomasnow. Additionally, it cannot switch into Scald due to the potential of being crippled by a burn, which is a big issue for a Grass-type. Nonetheless, Torterra can provide useful role compression to a team, being a sturdy Stealth Rock setter able to check threatening Pokemon like Zygarde-10%, Metagross, and Barbaracle.\n",
    "strategies' format": "RU",
    "strategies": [
        {
            "name": "Defensive",
            "stats": [
                288,
                254,
                339,
                167,
                208,
                148
            ],
            "type": [
                "Grass",
                "Ground"
            ],
            "usage": "Stealth Rock should be set up early-game against Pokemon that are forced out by or fail to threaten Torterra such as Metagross, Barbaracle, and Zygarde-10% locked into Thousand Arrows in order to chip down Torterra's Flying- and Fire-type checks, namely Noivern, Mandibuzz, and Arcanine. Synthesis should be used semi-regularly against Pokemon that Torterra forces out in matchups where it needs to be healthy enough to check the aforementioned threats. Additionally, Wood Hammer shouldn't be used too liberally, as the recoil will force Torterra to waste Synthesis's already sparse PP. Avoid letting Torterra get hit with status, namely burn and poison, as they will severely hinder it by reducing its longevity and, in burn's case, significantly hurt its offensive presence.",
            "moves": [
                [
                    "Stealth Rock"
                ],
                [
                    "Wood Hammer"
                ],
                [
                    "Earthquake"
                ],
                [
                    "Synthesis"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Overgrow"
            ],
            "nature": [
                "Impish"
            ],
            "ev spread": [
                248,
                0,
                252,
                0,
                8,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Grass-type Pokemon",
        "Fire-type Pokemon",
        "Flying-type Pokemon",
        "Ice-type Pokemon and Ice-type Coverage",
        "Residual Damage"
    ],
    "credits": [
        "Written by Mellow",
        "Quality checked by zizalith, Averardo,  and roman",
        "Grammar checked by The Dutch Plumberjack and Fireflame479"
    ]
}