{"name": "Totodile", "forms": {"Base": {"base stats": [50, 65, 64, 44, 48, 43], "types": ["Water"], "abilities": ["Sheer Force", "Torrent"], "tier": ["LC"], "form": "Base"}}, "overview": "Thanks to access to Dragon Dance and a great ability in Sheer Force, Totodile can be a decently threatening late-game sweeper. Its access to good coverage moves in Superpower and Sheer Force-boosted Ice Punch allows Totodile to break through common checks to offensive Water-types, like Ferroseed and Foongus. Totodile can also use a STAB priority move in Aqua Jet, allowing it to revenge kill frail or weakened threats like Doduo and Abra. It also has decent natural bulk as well as a good defensive Water typing, meaning it can usually find a setup opportunity. However, Totodile faces a lot of competition from other physically offensive Water-types like Carvanha and Corphish. The latter in particular also has access to Dragon Dance, is more powerful than Totodile thanks to Adaptability, and can weaken walls more easily thanks to access to Knock Off. However, Totodile carves a niche for itself thanks to its access to Ice Punch, as this gives it a reliable way to hit bulky Grass-types like Foongus and Snivy. Totodile is also quite slow, meaning it can relatively easily be revenge killed by many Choice Scarf users like Doduo and Mienfoo. Lastly, Totodile struggles to break through bulky Water-types like Staryu and Mareanie, so teams that have one of these will easily be able to prevent its sweep.\n", "strategies' format": "LC", "strategies": [{"name": "Dragon Dance", "stats": [136, 247, 165, 111, 132, 185], "type": ["Water"], "usage": "Totodile should be preserved until the late-game in order to set up a Dragon Dance and sweep. Generally, Totodile should set up on Pokemon that can't hurt it much, such as passive Pokemon like Spritzee and Pokemon that don't have moves to hit it very hard, such as Staryu lacking Thunderbolt. It can also set up on Pokemon it forces out, like Mudbray and Diglett. Lastly, Totodile can set up on even powerful attackers in an emergency if it is holding an Eviolite, but this is not recommended, as it will be significantly weakened and thus easily revenge killed. Even though Totodile is able to break through some bulky Grass-types with Ice Punch, they should still be weakened before setting up with Totodile, as they can generally OHKO it if they take a hit, especially if Totodile is weakened. If Totodile is running Aqua Jet, it can be used to revenge kill some weakened threats, like Gastly and Doduo. Totodile should usually wait with setting up until its checks have been weakened or removed, as it will be able to sweep much more easily then. However, in some situations, it can be smart to set up with Totodile earlier in the game, as its coverage moves allow it to break through some checks it shares with a teammate like Corphish or Carvanha, allowing them to sweep more easily in the late game. Always avoid letting Totodile get statused, as a burn or paralysis can easily stop its sweep. In addition, it is often wise to avoid taking any damage, as a weakened Totodile will struggle to find setup opportunities. If Totodile is running Life Orb, faster Choice Scarf users and powerful priority users should be eliminated before attempting to sweep, as the lack of Eviolite means Totodile can easily be revenge killed.", "moves": [["Dragon Dance"], ["Waterfall"], ["Ice Punch"], ["Superpower", "Aqua Jet"]], "item": [" Eviolite", " Life Orb"], "ability": ["Sheer Force"], "nature": ["Adamant"], "ev spread": [0, 236, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Bulky Water-types", "Status", "Revenge killers"], "credits": ["Written by Xayah", "Quality checked by Hilomilo, Fiend,  and Berks", "Grammar checked by The Dutch Plumberjack and Haund"]}