{
    "name": "Toucannon",
    "forms": {
        "Base": {
            "base stats": [
                80,
                120,
                75,
                75,
                75,
                60
            ],
            "types": [
                "Normal",
                "Flying"
            ],
            "abilities": [
                "Keen Eye",
                "Sheer Force",
                "Skill Link"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        }
    },
    "overview": "Toucannon fills a rare niche in the PU metagame as a physically offensive Flying-type. Toucannon is the strongest Flying-type in PU and one of the few that have access to Brave Bird. Its role in the metagame is a strong wallbreaker capable of running strong mixed sets to break through bulkier Pokemon with help from its diverse coverage options. Boomburst and Brave Bird make Toucannon a tough Pokemon to switch into due to their high Base Power, difference in typing, and ability to let it inflict both special and physical damage. However, despite Boomburst being a very powerful STAB move, Toucannon's base Special Attack is very low and makes it difficult to deal with special walls like Munchlax and Type: Null without incurring massive recoil. Toucannon's lack of Speed and bulk also makes it very underwhelming against offensive teams and makes it hard to get off an attack at all. Toucannon is also prone to being revenge killed easily and worn down by Life Orb, Stealth Rock, and Brave Bird recoil.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Mixed Attacker",
            "stats": [
                196,
                277,
                186,
                273,
                167,
                219
            ],
            "type": [
                "Normal",
                "Flying"
            ],
            "usage": "Toucannon is a mixed wallbreaker, which gives it the ability to adapt and deal with different Pokemon that may come in on it. This makes it hard to switch into, but prediction plays a big role in using it effectively, because it can be worn down quickly thanks to Life Orb recoil and its Stealth Rock weakness. Leading with Toucannon can be advantageous against some entry hazard leads like Ferroseed, as it can put immediate pressure on the opponent to possibly sacrifice something to Toucannon. Another job Toucannon has is to weaken bulkier Pokemon, since very few Pokemon resist its coverage. After Toucannon has weakened the opponent's team, a hard hitter or setup sweeper it is paired with can finish off the game. To achieve this goal, it is important to set Toucannon up with favorable matchups by double switching or via pivot switches; otherwise, Toucannon will not be able get off attacks due to its frailty and low Speed. Do not feel too pressured to preserve Toucannon because it loses its usefulness late-game, when opposing players' slower Pokemon are more likely to be gone.",
            "moves": [
                [
                    "Boomburst"
                ],
                [
                    "Brave Bird"
                ],
                [
                    "Bullet Seed"
                ],
                [
                    "Overheat"
                ]
            ],
            "item": [
                " Life Orb"
            ],
            "ability": [
                "Skill Link"
            ],
            "nature": [
                "Rash",
                "Naive"
            ],
            "ev spread": [
                0,
                4,
                0,
                252,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Rock-types",
        "Revenge Killers",
        "Ghost-types",
        "Electric-types"
    ],
    "credits": [
        "Written by MadMax123",
        "Quality checked by Megazard, yogi,  and TONE",
        "Grammar checked by The Dutch Plumberjack and lotiasite"
    ]
}