{"name": "Toxapex", "forms": {"Base": {"base stats": [50, 63, 152, 53, 142, 35], "types": ["Poison", "Water"], "abilities": ["Limber", "Merciless", "Regenerator"], "tier": ["OU"], "form": "Base"}}, "overview": "Toxapex is one of the best defensive Pokemon in the OU metagame thanks to a combination of excellent natural bulk, multiple methods of recovery, and a key move in Haze, making it a great fit on stall and balance teams alike. Toxapex is one of the few viable Pokemon in OU with access to Toxic Spikes, which gives it a method to passively wear down the opposition, and immensely pressures sweepers from setting up. Its Poison / Water typing furthers its defensive capabilities, letting it check a myriad of offensive threats such as Ash-Greninja, Magearna, Mega Scizor, Volcarona, and Mega Lopunny. Toxapex is able to effectively pivot into many attacks because of its insane bulk and Regenerator ability, allowing it to scout movesets with very little risk. However, abysmal offensive stats make Toxapex somewhat passive, and it relies on status to make up for this shortcoming. Despite its passive nature, Toxapex can be extremely difficult to take down without a dedicated answer to it, and is capable of stalling out many Pokemon that fail to break it.\n", "strategies' format": "OU", "strategies": [{"name": "The Pex", "stats": [199, 145, 341, 142, 421, 106], "type": ["Poison", "Water"], "usage": "Toxapex is fairly straightforward to use—switch it in on Pokemon that it walls, and respond by getting off potential burns with Scald or using it as an opportunity to set up a layer of Toxic Spikes. Always try to keep Toxapex at a good amount of health by using Recover or pivoting around with Regenerator, as it needs to be as healthy as possible in order to effectively check the Pokemon it's supposed to. When pinned up against setup sweepers, the best way to handle them is to use Haze followed by using Recover, should Toxapex get low on HP, and whittling the foe with either Scald or Toxic.", "moves": [["Scald"], ["Haze"], ["Recover"], ["Toxic", "Toxic Spikes", "Knock Off"]], "item": [" Black Sludge"], "ability": ["Regenerator"], "nature": ["Calm"], "ev spread": [252, 0, 4, 0, 252, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Psychic-types", "Electric-types", "Ground-types", "Taunt"], "credits": ["Written by Hootie and Gary", "Quality checked by Subject 18, dk,  and Colonel M", "Grammar checked by Eyan and Fireflame479"]}