{
    "name": "Trubbish",
    "forms": {
        "Base": {
            "base stats": [
                50,
                50,
                62,
                40,
                62,
                65
            ],
            "types": [
                "Poison"
            ],
            "abilities": [
                "Aftermath",
                "Stench",
                "Sticky Hold"
            ],
            "tier": [
                "LC"
            ],
            "form": "Base"
        }
    },
    "overview": "Trubbish occupies a niche among entry hazard setters thanks to its ability Sticky Hold combined with its good bulk, defensive typing, and access to Spikes. Sticky Hold allows Trubbish to switch into the very common Knock Off without losing its Berry Juice and works well with Recycle, which lets it capitalize on its bulk and stay healthy while it sets up Spikes. This makes Trubbish a great wall to Fighting-types and the popular Pawniard. Trubbish's high bulk in conjunction with its high Speed enables it to reliably set up Spikes against almost any lead. However, Knock Off still deals extra damage to Trubbish because it is holding an item, giving users of the move a way to exploit its ability. Trubbish also often struggles with spinners, as they can easily remove the Spikes that it sets up, and Staryu and Drilbur in particular can threaten it with their STAB moves. Lastly, Trubbish's Poison typing makes it very vulnerable to the common Diglett.\n",
    "strategies' format": "LC",
    "strategies": [
        {
            "name": "Spikes",
            "stats": [
                165,
                145,
                185,
                104,
                165,
                247
            ],
            "type": [
                "Poison"
            ],
            "usage": "Trubbish can switch into Fighting- and Fairy-types relatively safely and provoke a switch. Trubbish should always set Spikes when it forces the foe out; this should be its main priority. It should also be switching into Knock Off as often as possible to allow its teammates to hold on to their important items. When you predict the foe to switch and Trubbish has consumed its Berry Juice, Trubbish should use Recycle so it can come back into the battle when necessary after it switches out. Trubbish struggles against teams with Diglett, which can remove Trubbish from play without much possible counterplay. Against Diglett, you should play Trubbish carefully and switch out if you predict it coming in.",
            "moves": [
                [
                    "Spikes"
                ],
                [
                    "Recycle"
                ],
                [
                    "Gunk Shot"
                ],
                [
                    "Drain Punch"
                ]
            ],
            "item": [
                " Berry Juice"
            ],
            "ability": [
                "Sticky Hold"
            ],
            "nature": [
                "Jolly"
            ],
            "ev spread": [
                116,
                36,
                100,
                0,
                20,
                236
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Ground-types",
        "Setup Sweepers",
        "Ghost-types",
        "Entry Hazard Removal",
        "Psychic-types"
    ],
    "credits": [
        "Written by Temperley",
        "Quality checked by OP, tahu, Rowan,  and Xayah",
        "Grammar checked by frenzyplant and Fireflame479"
    ]
}