{"name": "Tsareena", "forms": {"Base": {"base stats": [72, 120, 98, 50, 98, 72], "types": ["Grass"], "abilities": ["Leaf Guard", "Queenly Majesty", "Sweet Veil"], "tier": ["RU"], "form": "Base"}}, "overview": "Tsareena's good Attack stat, usable Speed tier, and access to a strong STAB move in Power Whip make it a strong wallbreaker. It also has access to a variety of useful coverage moves in High Jump Kick and Knock Off as well as utility moves in Rapid Spin and Synthesis. Queenly Majesty enables Tsareena to avoid priority moves, allowing it to switch in safely on common priority users such as Azumarill and Scizor and revenge kill them without fear of being picked off itself. Its Grass typing and high Attack stat let it threaten common defensive staples such as Quagsire and Alomomola. However, Tsareena's typing gives it weaknesses to common types such as Fire, Flying, and Bug, and while it is somewhat bulky, Tsareena can be easily overwhelmed by common offensive threats such as Infernape, Mega Beedrill, and Mega Manectric. Tsareena's low Speed leaves it outsped and threatened by Pokemon such as Chandelure and Mega Pidgeot. The abundance of other faster and more viable Grass-types in the tier such as Serperior, Mega Sceptile, and Celebi also makes it harder for Tsareena to fit on a team, but they lack the utility that Knock Off and Rapid Spin provide.\n", "strategies' format": "UU", "strategies": [{"name": "Choice Band", "stats": [180, 339, 232, 122, 233, 267], "type": ["Grass"], "usage": "Tsareena should be used to break holes in the opponent's team, which is more crucial against bulky teams. It is best to bring Tsareena in safely with U-turn or Volt Switch, but its decent bulk means it can also take some resisted or weak neutral hits such as Hippowdon's Earthquake. Tsareena should mainly be using Power Whip, as its high Base Power and ability to hit a majority of the tier neutrally or super effectively is good for a Choice Band attacker. Rapid Spin is used best on predicted switches so it doesn't sacrifice too much momentum, and it can also be used as a last resort to allow Tsareena's teammates to sweep more easily. U-turn generates momentum for its team in unfavorable matchups against Pokemon such as Crobat and bulky Scizor so Tsareena can bring in a teammate safely. Its relatively low Speed means that this can be relatively safe, especially if U-turn is used on a predicted switch. However, the move should be used minimally and generally only for this purpose. Use Knock Off mostly on defensive foes that rely on their item, such as Amoonguss. It can also be used to hit Psychic-types such as Latias on the switch. Try to avoid burns from Scald, from Pokemon such as Suicune and Swampert, whenever possible, as they can severely cripple Tsareena's breaking ability.", "moves": [["Power Whip"], ["Knock Off", "Rapid Spin"], ["High Jump Kick"], ["U-turn"]], "item": [" Choice Band"], "ability": ["Queenly Majesty"], "nature": ["Jolly"], "ev spread": [0, 252, 0, 0, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Offensive Utility", "stats": [180, 339, 233, 122, 232, 267], "type": ["Grass"], "usage": "Bring Tsareena into favorable positions against bulky Water- and Ground-types, which it can immediately threaten. The most notable examples include Stealth Rock setters such as Empoleon, Swampert, and Hippowdon, as well as other foes like Suicune, Slowbro, and bulky Primarina. Tsareena's main purpose tends to be keeping entry hazards off the user's field, meaning it should take advantage of these one-on-one matchups to use Rapid Spin. Knock Off is best used early-game to remove items of common switch-ins or to prevent Ghost-types from coming in to block Rapid Spin. Lum Berry allows Tsareena to come in aggressively on Scald and Toxic users like Suicune, Empoleon, and Hippowdon, but it should be more wary if its Berry has already been used. Keep Tsareena healthy if removing entry hazards appears to be a pressing priority at some point later on, or if it is necessary to handle a certain foe. Queenly Majesty blocks Bisharp's Sucker Punch and Scizor's Bullet Punch, so preserving Tsareena to revenge kill either one could prove beneficial as well. However, Scizor must be sufficiently weakened to do so. Take advantage of favorable positions by throwing out powerful attacks or using U-turn to keep up momentum, getting teammates into good spots to perform their roles. A common example is Choice Band Scizor locked into Bullet Punch, which Tsareena walls completely and can use to gain momentum.", "moves": [["Rapid Spin"], ["Power Whip"], ["U-turn"], ["High Jump Kick", "Knock Off"]], "item": [" Lum Berry"], "ability": ["Queenly Majesty"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Fire-types", "Flying-types", "Revenge Killers", "Burns"], "credits": ["Written by martha and Pak", "Quality checked by vivalospride, Nuked,  and Eyan", "Grammar checked by The Dutch Plumberjack and talkingtree", "Quality checked by Nuked, vivalospride, Hilomilo, Eyan,  and Kink", "Grammar checked by Winry, talkingtree, The Dutch Plumberjack, A Cake Wearing A Hat,  and frenzyplant"]}