{"name": "Turtwig", "forms": {"Base": {"base stats": [55, 68, 64, 45, 55, 31], "types": ["Grass"], "abilities": ["Overgrow", "Shell Armor"], "tier": ["LC"], "form": "Base"}}, "overview": "Turtwig brings an interesting niche to the table as the only pure Grass-type that can set Stealth Rock; this, coupled with other decent attributes such as a decent movepool, defensive stats, and typing, allows Turtwig to be an adequate entry hazard setter. Aside from a great recovery option in Synthesis, Turtwig has access to two other good moves in Bullet Seed for STAB damage against Pokemon such as Staryu and Drilbur, which also happen to be common Rapid Spin users, and Superpower for coverage against Pokemon such as Magnemite and Pawniard. However, while it has a good matchup against most spinners, Turtwig falls short to other common metagame threats such as Ponyta and Vullaby. Turtwig is outclassed by Ferroseed as a Grass-type entry hazard setter and by Onix as a Stealth Rock setter due to their more useful abilities and better stats. Turtwig is also relatively passive due to its limited offensive options, moderate stats, and the drawbacks of Superpower. The biggest reason why Turtwig isn't used much is because there are better Stealth Rock setters such as the aforementioned Onix, while as a Water-type check, Grass-types such as Snivy are more reliable.\n", "strategies' format": "LC", "strategies": [{"name": "Defensive Stealth Rock", "stats": [165, 185, 225, 113, 181, 105], "type": ["Grass"], "usage": "Turtwig should be used as a lead or sent out early-game into Pokemon it doesn't take a lot of damage from, such as Omanyte and Onix, to force them out so it can set up Stealth Rock. The earlier Turtwig can set Stealth Rock the better, because it may be easier to avoid threats early-game, which eases entry hazard setup. Turtwig can use its good bulk to switch into resisted Water- and Electric-type moves such as Staryu's Hydro Pump and Elekid's Thunderbolt; however, it needs to be careful of coverage such as Ice Beam from most variants of the aforementioned Staryu. Turtwig can also use the forced switch when switching into Pokemon it checks to recover with Synthesis if needed; however, it should only do so if it is sure it can survive one more hit, as otherwise its low Speed stat can be taken advantage of. Turtwig should freely spam Bullet Seed on Pokemon it can defeat, but it should only use Superpower when it attempts to hit Steel-types on the switch to KO them because the subsequent lowering of its stats can create an opening for the opposition. Don't take advantage of Overgrow without thought, as instead of taking advantage of the extra damage provided, Turtwig should prioritize recovering with Synthesis in case its Stealth Rock is removed or its defensive typing is still needed; an opportunity where it can use Overgrow, however, is if it is confident that it can KO a Pokemon on the switch with Bullet Seed. Setup sweepers should be taken care of or have their plays predicted to ensure Turtwig is not taken advantage of after using Superpower. Turtwig should also be aware of Vullaby, especially its Weak Armor variants, as Turtwig's attacks are resisted and give it Speed boosts. Additionally, Vullaby can force out Turtwig rather easily and use Defog to remove its entry hazards.", "moves": [["Stealth Rock"], ["Synthesis"], ["Bullet Seed"], ["Superpower"]], "item": [" Eviolite"], "ability": ["Overgrow"], "nature": ["Careful"], "ev spread": [76, 52, 244, 0, 76, 28], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Taunt", "Setup Sweepers", "Flying-types", "Fire-types", "Poison-types", "Ice-type Pokemon and Coverage"], "credits": ["Written by Conni", "Quality checked by Merritt, Nineage,  and Corporal Levi", "Grammar checked by The Dutch Plumberjack and frostration"]}