{"name": "Turtonator", "forms": {"Base": {"base stats": [60, 78, 135, 91, 85, 36], "types": ["Fire", "Dragon"], "abilities": ["Shell Armor"], "tier": ["Untiered"], "form": "Base"}}, "overview": "Turtonator finds its place in the PU metagame as a threatening Shell Smash sweeper. Offensively, its Fire / Dragon typing boasts unresisted coverage against everything in the tier. It is free to run a Z-Move such as Devastating Drake that allows it to beat blanket checks like Hitmonchan after a Shell Smash. Good physical bulk lets it set up against weaker physical attackers such as Shiftry. Turtonator's main flaw is its low Speed, meaning it can easily be outsped and revenge killed after Stealth Rock damage by common Choice Scarf users such as Primeape, Jynx, and Mesprit even after a Shell Smash. Its typing can often hinder it as well, as it is weak to Stealth Rock and lacks notable resistances outside of Grass, Fire, and Electric. Turtonator is generally only seen on niche hyper offense teams, because other Fire- or Dragon-types such as Combusken and Drampa are able to inflict immediate damage or have better defensive utility.\n", "strategies' format": "PU", "strategies": [{"name": "Shell Smash", "stats": [156, 172, 306, 281, 207, 188], "type": ["Fire", "Dragon"], "usage": "Finding opportunities to set up Shell Smash against Fire-, Electric-, and Steel-type attacks, such as Choice-locked Togedemaru's STAB moves or Eelektross’s Volt Switch, is vital, as Turtonator needs the boosts to effectively sweep. Another good way to set up is to find Turtonator in a one-on-one situation against weaker physical attackers such as Skuntank, as Turtonator's good physical bulk can allow it to use Shell Smash without taking too much damage. Devastating Drake should be used carefully, as opponents can pivot out into a Steel- or Fairy-type predicting the Z-Move, leaving another Pokemon out of range from Turtonator's other attacks. Turtonator acts more like a wallbreaker in most circumstances due to its great damage output but subpar Speed stat, even after a +2 boost. Devastating Drake should only be used to get necessary KOs, as Draco Meteor drops Turtonator's Special Attack by two stages.Make sure to not switch Turtonator in while Stealth Rock is up, as this can hinder Turtonator's ability to take hits and set up.", "moves": [["Fire Blast"], ["Shell Smash"], ["Draco Meteor"], ["Dragon Pulse"]], "item": [" Dragonium Z", " White Herb"], "ability": ["Shell Armor"], "nature": ["Timid"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Revenge Killers", "Specially Defensive Pokemon", "Water-types", "Strong Special Attackers"], "credits": ["Written by Taskr", "Quality checked by Megazard, yogi,  and g", "Grammar checked by martha and lotiasite"]}