{
    "name": "Umbreon",
    "forms": {
        "Base": {
            "base stats": [
                95,
                65,
                110,
                60,
                130,
                65
            ],
            "types": [
                "Dark"
            ],
            "abilities": [
                "Inner Focus",
                "Synchronize"
            ],
            "tier": [
                "RU"
            ],
            "form": "Base"
        }
    },
    "overview": "Umbreon's high bulk and decent defensive typing allow it to check prominent threats in the metagame, such as Mega Sharpedo, Hydreigon, and Latias. Furthermore, access to Wish and Heal Bell makes Umbreon a great cleric. Toxic and Foul Play allow Umbreon to deter physical setup sweepers such as Scizor and Haxorus from setting up on it. However, Umbreon is easily exploitable by Toxic-immune Pokemon with Justified, such as Cobalion and Lucario. Furthermore, Taunt users, such as Crobat and Krookodile, completely shut Umbreon down by preventing it from healing itself or its teammates. Additionally, Umbreon's reliance on Wish + Protect to keep itself healthy can cause the loss of momentum, while reliance on Moonlight to keep itself healthy can be taken advantage of due to Moonlight's relatively low PP. Umbreon also suffers from the presence of pivots, such as Scizor, Mega Beedrill, and Infernape, that can threaten it out and gain momentum with U-turn. Umbreon also faces competition from Blissey as a special wall, with Blissey having higher HP, a defensive typing that grants it fewer weaknesses, and access to Soft-Boiled, Stealth Rock, and Natural Cure, and as a cleric from Sylveon, which has a better defensive typing and better offensive presence.\n",
    "strategies' format": "UU",
    "strategies": [
        {
            "name": "Specially Defensive",
            "stats": [
                289,
                149,
                256,
                156,
                394,
                167
            ],
            "type": [
                "Dark"
            ],
            "usage": "Switch in Umbreon on special attackers such as Latias, Hydreigon, and Mega Sceptile and beat them via attacking with Foul Play when ever Umbreon is at a comfortable amount of HP; this is achieved by continuously using Wish in tandem with Protect or Moonlight. Hence, Umbreon needs to stay as healthy as possible throughout the match. Generally, you should use Wish either when Umbreon is low on HP or when a teammate should be healed up. Use Protect to scout for potential mixed special attackers with Fighting coverage, such as Superpower Hydreigon and Nidoking, and Choice-locked Pokemon like Latias and Gengar. Be wary of using Protect against certain potentially Choice-locked Pokemon that may utilize setup moves, such as Scizor and Terrakion. In addition, be wary of switching in Umbreon on potential Trick users such as Latias and Gengar. Umbreon could also be switched in on certain physical attackers, such as Mega Aerodactyl and Mega Sharpedo. Avoid spamming Foul Play against teams with Justified users such as Cobalion, Terrakion, and Lucario, as they can easily take advantage of it to boost their Attack. Despite its access to Toxic and Foul Play, Umbreon heavily struggles to beat certain setup sweepers such as Kommo-o and Terrakion that beat it by virtue of their typings. Hence, it is wise to not stay in on them, as they use Umbreon as setup fodder. Do not stay in on Taunt users, such as Krookodile and Jellicent, because they can reliably shut down and beat Umbreon. Use Toxic to beat special attackers such as Hydreigon and Latias and on predicted Fighting-type switch-ins like Infernape and Terrakion. Use Heal Bell when either Umbreon or its teammates are afflicted with a status ailment while keeping in mind Heal Bell's low PP.",
            "moves": [
                [
                    "Foul Play"
                ],
                [
                    "Heal Bell",
                    "Toxic"
                ],
                [
                    "Wish"
                ],
                [
                    "Protect",
                    "Moonlight"
                ]
            ],
            "item": [
                " Leftovers"
            ],
            "ability": [
                "Synchronize"
            ],
            "nature": [
                "Calm"
            ],
            "ev spread": [
                252,
                0,
                0,
                0,
                252,
                4
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Fighting-types",
        "Bug-types",
        "Fairy-types",
        "Toxic-immune Pokemon",
        "Taunt users"
    ],
    "credits": [
        "Written by Amane Misa",
        "Quality checked by Nuked, Kink,  and martha",
        "Grammar checked by A Cake Wearing A Hat and The Dutch Plumberjack"
    ]
}