{"name": "Uxie", "forms": {"Base": {"base stats": [75, 75, 130, 75, 130, 95], "types": ["Psychic"], "abilities": ["Levitate"], "tier": ["RU"], "form": "Base"}}, "overview": "At first glance, Uxie appears to be entirely outclassed by other Psychic-types such as Mew and Tapu Lele. However, Uxie's combination of Trick Room, Stealth Rock, and Memento gives it a defined niche on Trick Room teams, as it's able to compress roles very efficiently by acting as a Stealth Rock setter and Trick Room setter while being able to provide its team members valuable momentum with Memento. Uxie's fantastic defensive stats also allow it to survive almost any hit and set up Trick Room in most scenarios. Despite this, Uxie is only viable on dedicated Trick Room teams, as it's completely outclassed by other Psychic-types such as Mew and Latios on any standard team. Uxie is also extremely passive, as it's unable to do much damage because of its pathetic offensive stats and because it usually can't afford to run an attacking move. Uxie also faces some competition from Bronzong, which can also set up Stealth Rock and gain momentum with Explosion, but Uxie is usually the better choice because of the setup opportunities it gives with Memento.\n", "strategies' format": "OU", "strategies": [{"name": "Trick Room Setter", "stats": [249, 186, 357, 186, 331, 175], "type": ["Psychic"], "usage": "Uxie should usually set up Stealth Rock first, over Trick Room, in order to preserve Trick Room turns, but if you're facing a Pokemon that can 2HKO Uxie, such as Hoopa-U and Greninja, prioritize setting up Trick Room first. Magic Coat shouldn't be used against Stealth Rock setters such as Landorus-T, as they can predict it and just attack Uxie, but it should be used against common Spikes setters, such as Skarmory and Ferrothorn. Preserving Uxie to set up Trick Room later in the match usually isn't worth it, although if it can be done without letting a teammate take too much damage, you can do it.", "moves": [["Trick Room"], ["Stealth Rock"], ["Memento"], ["Magic Coat", "Skill Swap"]], "item": [" Mental Herb", " Red Card"], "ability": ["Levitate"], "nature": ["Relaxed"], "ev spread": [252, 0, 116, 0, 140, 0], "iv spread": [31, 31, 31, 31, 31, 0]}], "counters": ["Powerful Wallbreakers", "Mega Sableye"], "credits": ["Written by Nuked", "Quality checked by Gary, Colonel M,  and Hootie", "Grammar checked by Kris and Wob"]}