{
    "name": "Vanilluxe",
    "forms": {
        "Base": {
            "base stats": [
                71,
                95,
                85,
                110,
                95,
                79
            ],
            "types": [
                "Ice"
            ],
            "abilities": [
                "Ice Body",
                "Snow Warning",
                "Weak Armor"
            ],
            "tier": [
                "NUBL"
            ],
            "form": "Base"
        }
    },
    "overview": "Snow Warning allows Vanilluxe to power off extremely powerful Blizzards, which can quickly dismantle teams lacking a sturdy Steel-type such as Registeel. A decent Speed tier puts it above many metagame threats, particularly Mega Blastoise, as well as other Pokemon like Nidoqueen, Feraligatr, and Tyrantrum. Blizzard + Freeze-Dry + Hidden Power Fire allows Vanilluxe to hit the majority of the tier for at least neutral damage, only missing out on Fire-types. It also has utility in Taunt that lets it prevent walls like Bronzong from setting up entry hazards and priority in the form of Ice Shard that lets it remove Pokemon like Noivern more easily. Despite this, Vanilluxe fails to make headway against the plethora of teams running sturdy Steel-types such as Registeel and Bronzong. Even against bulky offense, Vanilluxe will struggle to make immediate progress, as it'll have to worry about getting through other Steel-types like Metagross, and its mediocre defenses combined with an abysmal defensive typing leaves it vulnerable to faster bulky offense staples such as Virizion and Salazzle. Vanilluxe's underwhelming Special Attack stat means that all of its attacks bar Blizzard will be lacking. Vanilluxe is also worn down quickly by residual damage, especially Stealth Rock due to its typing, and it struggles to switch into weak attacks because of its mediocre bulk and bad defensive typing.\n",
    "strategies' format": "RU",
    "strategies": [
        {
            "name": "Wallbreaker",
            "stats": [
                178,
                227,
                185,
                319,
                226,
                282
            ],
            "type": [
                "Ice"
            ],
            "usage": "Be cautious when clicking moves with Choice Specs, as being locked into a certain move can let Pokemon like Salazzle, Feraligatr, and Barbaracle set up for free. Make use of Taunt to prevent defensive Stealth Rock setters like Registeel and Bronzong from setting it up. Vanilluxe's mediocre bulk and awful defensive typing make it difficult to get it in freely, so make use of double switches and pivoting to give it turns.",
            "moves": [
                [
                    "Blizzard"
                ],
                [
                    "Freeze-Dry"
                ],
                [
                    "Ice Shard"
                ],
                [
                    "Taunt",
                    "Hidden Power Fire"
                ]
            ],
            "item": [
                " Icicle Plate",
                " Choice Specs"
            ],
            "ability": [
                "Snow Warning"
            ],
            "nature": [
                "Hasty"
            ],
            "ev spread": [
                0,
                4,
                0,
                252,
                0,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Faster Offensive Pokemon",
        "Steel-types",
        "Fire-types",
        "Fighting-types",
        "Rock-types",
        "Walls"
    ],
    "credits": [
        "Written by roman",
        "Quality checked by zizalith, Mr Aldo,  and Averardo",
        "Grammar checked by The Dutch Plumberjack and Estronic"
    ]
}
