{"name": "Vaporeon", "forms": {"Base": {"base stats": [130, 65, 60, 110, 95, 65], "types": ["Water"], "abilities": ["Hydration", "Water Absorb"], "tier": ["NU"], "form": "Base"}}, "overview": "Vaporeon is insurance against one of the best Pokemon in the tier, Mega Blastoise, and access to Wish and Heal Bell makes it a decent pick for balance teams. Vaporeon's fantastic bulk lets it blanket check other special attackers like Salazzle, Ninetales, and Swellow. Wish + Protect is fantastic for supporting teammates, and Vaporeon's extremely high HP stat accentuates its prominence as a Wish user. However, Vaporeon is often outclassed as a bulky Water-type and Mega Blastoise switch-in by Mantine, which can blanket check a plethora of special attackers, provide Defog support, and match up well against most Grass-types, arguably one of the most threatening types in RarelyUsed. Vaporeon's passive nature will give free turns to the opponent frequently, something that can leave you in an awful spot in such a fast-paced metagame. For example, Vaporeon's over-reliance on Protect to effectively use Wish allows the opponent to easily double switch to wallbreakers and setup sweepers. Vaporeon lacking Ice Beam can't keep up with aggressive hazard stack teams carrying Roserade. Vaporeon's poor offensive presence gives plenty of setup opportunities to opposing Pokemon like Mega Abomasnow and Snorlax.\n", "strategies' format": "RU", "strategies": [{"name": "Support", "stats": [359, 149, 157, 256, 317, 166], "type": ["Water"], "usage": "Support teammates, especially those lacking recovery, with Wish. Position Vaporeon against slow, passive Pokemon so as to seamlessly pass Wishes. Fish for burns with Scald as physical attackers like Virizion switch into you, as once they're burned they'll have next to no use. Use Protect to effectively heal Vaporeon with Wish, scout against potential Choice-locked attackers, hamper the power of Z-Moves, and take full advantage of Leftovers. Hit Grass-types such as Roserade and Shaymin on the switch with Ice Beam, and take advantage of them being forced to use Synthesis to get a free switch to a teammate. Try to avoid Knock Off, as once Vaporeon loses Leftovers, it'll be chipped very easily from weak attacks and Stealth Rock. Consequently, you'll have to focus more on healing Vaporeon with Wish as opposed to passing Wish.", "moves": [["Scald"], ["Wish"], ["Protect"], ["Ice Beam", "Heal Bell"]], "item": [" Leftovers"], "ability": ["Water Absorb"], "nature": ["Calm"], "ev spread": [252, 0, 4, 0, 252, 0], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Grass-types", "Physical Wallbreakers", "Setup Sweepers", "Taunt", "Electric-types"], "credits": ["Written by roman", "Quality checked by phantom, Mr Aldo,  and banks", "Grammar checked by A Cake Wearing A Hat and Electrolyte"]}