{"name": "Victreebel", "forms": {"Base": {"base stats": [80, 105, 65, 100, 70, 70], "types": ["Grass", "Poison"], "abilities": ["Chlorophyll", "Gluttony"], "tier": ["PU"], "form": "Base"}}, "overview": "Victreebel is a ferocious wallbreaker thanks to its decent Special Attack stat alongside its powerful, near-unresisted coverage moves. Strength Sap is an important part of Victreebel's toolkit that allows it to reliably check and recover health off of Pokemon such as Gurdurr, Skuntank, and Hitmonchan. Additionally, Victreebel is quite fast for a wallbreaker which permits it to heavily threaten Pokemon like Aurorus, Aggron, and defensive Mesprit. Victreebel is also a viable asset for sun teams, as its fantastic Speed tier under sun backed by its large assortment of moves such as Sleep Powder, Growth, and Weather Ball can make it very dangerous late-game, notably outspeeding common Choice Scarf users such as Primeape and Mesprit. However, Victreebel's Speed outside of sun is still decidedly average, leaving it open to revenge killers like Stoutland, Simisear, and Alolan Raichu. Victreebel is also incredibly frail and is susceptible to most forms of priority, especially Ice Shard. Furthermore, Victreebel has a hard time breaking certain Pokemon, such as Type: Null and Curse Muk, without a boost. Moreover, it cannot make use of Solar Beam, Weather Ball, or Chlorophyll without sun, which can make Chlorophyll sweeper sets setup fodder for Pokemon such as Carracosta and Oricorio-G.\n", "strategies' format": "PU", "strategies": [{"name": "Strength Sap", "stats": [196, 221, 167, 328, 176, 239], "type": ["Grass", "Poison"], "usage": "Victreebel should primarily be used to wallbreak early- and mid-game and serve as a check to Pokemon like Bellossom and Poliwrath thanks to its typing. While Victreebel can switch into weaker resisted hits such as Lurantis's Leaf Storm and Hitmonchan's Drain Punch, it should mainly be brought in with a slow U-turn or Volt Switch, as a revenge killer, or thanks to a smart double switch due to its rather poor bulk. It can also come in on passive Pokemon that can't hurt it or cripple it, such as Jellicent. Since the Z-Move can only be used once per battle, it should be used on a predicted switch against the likes of Skuntank and should be withheld from use if the opponent still has a solid check or counter like Altaria, as otherwise it could go to waste. Strength Sap is key to Victreebel's staying power and ability to consistently threaten balance teams. Therefore, it should be used against threats Victreebel checks like Gurdurr or on a predicted or forced switch to cripple an incoming threat like Skuntank.", "moves": [["Strength Sap"], ["Leaf Storm"], ["Sludge Bomb"], ["Hidden Power Fighting", "Hidden Power Rock"]], "item": [" Grassium Z"], "ability": ["Chlorophyll"], "nature": ["Modest"], "ev spread": [0, 0, 4, 252, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Chlorophyll Sweeper", "stats": [196, 221, 166, 328, 177, 239], "type": ["Grass", "Poison"], "usage": "Victreebel should act as your primary sun cleaner; it's recommended to save it towards the near end of the game for optimal sweeping potential. However, Victreebel can be used mid-game if absolutely necessary. Victreebel is incredibly frail, so it's recommended you don't bring it in until all or most of its checks are gone or weakened. Victreebel should almost never be switched in directly. Victreebel also appreciates being brought onto the playing field with as many remaining turns of sun as possible, as a Victreebel outside of sun is highly susceptible to being revenge killed or used as set up fodder. Try not to switch Victreebel in and out too much, as entry hazard damage stacked with Life Orb damage racks up quick. Victreebel's main goal is to clean up late-game by spamming its three main attacks. It is recommend to only use Sleep Powder in situations where it cannot immediately OHKO the opposing Pokemon. Growth should be used against passive walls or when you predict the opponent to switch. Only use Growth when necessary to wallbreak. Victreebel is also reliant on making key predictions in order to conserve as many turns of sun as possible.", "moves": [["Solar Beam"], ["Sludge Bomb"], ["Weather Ball"], ["Sleep Powder", "Growth"]], "item": [" Life Orb"], "ability": ["Chlorophyll"], "nature": ["Modest"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Lack of Sun", "Priority Moves", "Specially Bulky Pokemon", "Faster Choice Scarf Users"], "credits": ["Written by Aaronboyer and gum", "Quality checked by Akir, Megazard, yogi, TJ,  and TONE", "Grammar checked by Haund, P Squared, Electrolyte,  and The Dutch Plumberjack"]}