{
    "name": "Vikavolt",
    "forms": {
        "Base": {
            "base stats": [
                77,
                70,
                90,
                145,
                75,
                43
            ],
            "types": [
                "Bug",
                "Electric"
            ],
            "abilities": [
                "Levitate"
            ],
            "tier": [
                "NU"
            ],
            "form": "Base"
        }
    },
    "overview": "A Bug / Electric typing combined with the ability Levitate means that Vikavolt can come in against many NU staples such as Steelix and Passimian easily, as well as taking little from NU's Grass-type wallbreakers such as Sceptile. Furthermore, an extremely high base 145 Special Attack and Electric-, Bug-, and Grass-type coverage means that any team lacking a dedicated special wall will struggle to safely switch into Vikavolt. Despite only having base 43 Speed, Vikavolt is still fast enough to outspeed many of NU's walls, including some base 50s such as Vileplume as well as Vaporeon with Speed investment if needed. This low Speed also gives Vikavolt a slow Volt Switch, which can help to get teammates in without them taking damage. However, while its Bug / Electric typing is very unique defensively, it leaves Vikavolt with a weakness to Stealth Rock, so it is easily worn down from repeatedly using Volt Switch as well as easily hit for heavy damage from Rock- and Fire-type attacks.\n",
    "strategies' format": "NU",
    "strategies": [
        {
            "name": "Pivot",
            "stats": [
                216,
                158,
                216,
                427,
                186,
                160
            ],
            "type": [
                "Bug",
                "Electric"
            ],
            "usage": "Vikavolt should use its resistances and typing to get in as often as possible, as its power means that if it is able to safely get in, for example, against Steelix or Seismitoad, it is often able to deal heavy damage to the enemy team. Aim to wallbreak with Vikavolt early-game to open up holes for a teammate to clean up late-game. Savage Spin-Out can be used to reduce the burden of prediction, as its sheer power means that most possible switch-ins will take significant damage from it. Alternatively, it should be used to break an important target, as its increased damage can help secure KOs against Pokemon such as Delphox and Cryogonal. Volt Switch can be used against faster foes to safely get in a Pokemon without having said Pokemon take any damage. Do not let Vikavolt get worn down too much, as being at high HP means that it has the opportunity to switch into and use Roost against targets such as Vileplume and Steelix.",
            "moves": [
                [
                    "Bug Buzz"
                ],
                [
                    "Volt Switch"
                ],
                [
                    "Energy Ball"
                ],
                [
                    "Roost"
                ]
            ],
            "item": [
                " Buginium Z",
                " Leftovers"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Modest"
            ],
            "ev spread": [
                104,
                0,
                0,
                252,
                0,
                152
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Choice Specs",
            "stats": [
                216,
                158,
                216,
                427,
                186,
                160
            ],
            "type": [
                "Bug",
                "Electric"
            ],
            "usage": "Bug Buzz is a very safe move to use early-game, as it has good neutral coverage with no types immune to it and hits almost anything that doesn't resist it for heavy damage. Energy Ball should be used if you predict your opponent to bring in a Ground-type to stop Volt Switch. If the opponent does not have a Ground-type, Volt Switch can be used to pivot with complete freedom, easily weaken the opposing team, and minimize chances for recovery. Vikavolt should be brought in against weak attacks such as Steelix's Heavy Slam or resisted hits such as Vileplume's Giga Drain. However, be wary of letting it get worn down too much, as its low Speed means it often has to take a hit before hitting the enemy back. Be careful when using Volt Switch or Thunderbolt, as this set has to predict when to use them in order to not lose momentum against enemy Ground-types.",
            "moves": [
                [
                    "Bug Buzz"
                ],
                [
                    "Thunderbolt"
                ],
                [
                    "Energy Ball"
                ],
                [
                    "Volt Switch"
                ]
            ],
            "item": [
                " Choice Specs"
            ],
            "ability": [
                "Levitate"
            ],
            "nature": [
                "Modest"
            ],
            "ev spread": [
                104,
                0,
                0,
                252,
                0,
                152
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Stealth Rock",
        "Faster Attackers",
        "Steel-types",
        "Specially Defensive Pokemon",
        "Fire-type"
    ],
    "credits": [
        "Written by quziel",
        "Previous versions by Skelos",
        "Quality checked by banks, Rabia,  and Eternally",
        "Grammar checked by martha and The Dutch Plumberjack"
    ]
}