{
    "name": "Volcarona",
    "forms": {
        "Base": {
            "base stats": [
                85,
                60,
                65,
                135,
                105,
                100
            ],
            "types": [
                "Bug",
                "Fire"
            ],
            "abilities": [
                "Flame Body",
                "Swarm"
            ],
            "tier": [
                "OU"
            ],
            "form": "Base"
        }
    },
    "overview": "Volcarona is one of the deadliest sweepers in the tier because of its access to Quiver Dance, high Special Attack stat, and decent Speed stat. Its large movepool, which is complemented by Z-Moves, allows Volcarona to pick its checks and counters. Volcarona also has a ton of setup opportunities in a tier infested with Steel-types and passive Pokemon such as Tangrowth. However, Volcarona is held back by its 4x weakness to Stealth Rock, requiring Defog or Rapid Spin support. Volcarona will also lose to a common Pokemon depending on its set, meaning it can be inconsistent. Finally, Volcarona often cannot sweep in practice, since it will be forced out by Choice Scarf users above its Speed tier such as Greninja as well as strong priority users such as Ash-Greninja and Mega Pinsir.\n",
    "strategies' format": "OU",
    "strategies": [
        {
            "name": "Bulky Quiver Dance",
            "stats": [
                268,
                140,
                194,
                306,
                246,
                300
            ],
            "type": [
                "Bug",
                "Fire"
            ],
            "usage": "It is paramount to Volcarona's success that entry hazards, particularly Stealth Rock, be cleared before sending it out because of its vulnerability to them and 4x weakness to Stealth Rock. If hazards are off Volcarona's side of the field, it's perfectly fine to throw off attacks with Volcarona multiple times throughout the game in order to wear down Pokemon like Heatran lacking Leftovers. You should still prioritize weakening Pokemon like Heatran and Toxapex with your other teammates as well, though, as without support, Volcarona will find it very difficult to do so. Unlike offensive variants, this set can be used liberally to check Pokemon like Tapu Bulu, Mega Mawile, and Mega Scizor, potentially even crippling them with a burn from Flame Body. Roost should be used frequently to keep Volcarona healthy enough to check the aforementioned threats. Avoid status at all costs, particularly Toxic, as it drastically decreases Volcarona's efficacy.",
            "moves": [
                [
                    "Quiver Dance"
                ],
                [
                    "Flamethrower"
                ],
                [
                    "Bug Buzz"
                ],
                [
                    "Roost"
                ]
            ],
            "item": [
                " Buginium Z"
            ],
            "ability": [
                "Flame Body"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                248,
                0,
                112,
                0,
                0,
                148
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Offensive Quiver Dance",
            "stats": [
                206,
                140,
                166,
                369,
                247,
                328
            ],
            "type": [
                "Bug",
                "Fire"
            ],
            "usage": "Volcarona should not set up until its counters are cleared. Volcarona's matchup does fluctuate, so there are moments where it can set up mid-game and go for a sweep right off the bat. A lot of Pokemon are setup bait to Volcarona, but those Pokemon can often annoy Volcarona back. Celesteela can use Leech Seed on it and switch around until Volcarona is in range of priority. Ferrothorn can do the same or cripple Volcarona with Thunder Wave. These are the types of situations where directly attacking is usually more safe and beneficial than using Quiver Dance.",
            "moves": [
                [
                    "Quiver Dance"
                ],
                [
                    "Fire Blast"
                ],
                [
                    "Bug Buzz"
                ],
                [
                    "Hidden Power Ground"
                ]
            ],
            "item": [
                " Buginium Z"
            ],
            "ability": [
                "Flame Body"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Stealth Rock",
        "Fast Choice Scarf Users",
        "Strong Priority",
        "Selective Defensive Pokemon",
        "Chansey"
    ],
    "credits": [
        "Written by Vertex and Mellow",
        "Quality checked by GMars, Gary,  and Finchinator",
        "Grammar checked by GMars and The Dutch Plumberjack"
    ]
}