{"name": "Weavile", "forms": {"Base": {"base stats": [70, 120, 65, 45, 85, 125], "types": ["Dark", "Ice"], "abilities": ["Pickpocket", "Pressure"], "tier": ["UUBL"], "form": "Base"}}, "overview": "Weavile's solid attacking stats and offensive typing make it a big threat to offensive teams, as it can outspeed and heavily damage threats like Tornadus-T, Garchomp, Landorus-T, and Serperior. In addition, great STAB moves such as Knock Off, Ice Shard, and Pursuit ensure Weavile will almost never be dead weight in any matchup, as it can provide utility in several ways against several team archetypes. However, Weavile's typing is awful defensively, granting it a Stealth Rock weakness as well as weaknesses to common types like Fairy, Fighting, and Steel. Said typing also means Weavile will set up on by dangerous threats like Mega Mawile, Volcarona, Z-Move Magearna, and Mega Scizor if not used carefully.\n", "strategies' format": "OU", "strategies": [{"name": "Choice Band", "stats": [176, 339, 167, 113, 206, 383], "type": ["Dark", "Ice"], "usage": "Early in the game, Weavile should be spamming Knock Off to weaken potential checks. However, Weavile can be taken advantage of by Mega Mawile and Mega Scizor, so keep this in mind if it runs into this matchup. Weavile has good late-game cleaning potential between its high Speed and Ice Shard, meaning it can sometimes be saved for a late-game sweep. It can also be saved if it needs to revenge kill a setup sweeper such as Mega Pinsir or Rock Polish Landorus-T. Weavile's bulk is terrible and it has few resistances, which means it must usually be brought in via U-turn or Volt Switch support or on an aggressive double switch. Avoid sending Weavile out too much when Stealth Rock is on the field, as it can get easily worn down by residual damage. Weavile can take advantage of Choice-locked threats like Tapu Lele and Greninja locked into Ice Beam or Spikes and proceed to Pursuit trap them, which also means they must play more carefully when Weavile is still active.", "moves": [["Knock Off"], ["Icicle Crash"], ["Ice Shard"], ["Pursuit"]], "item": [" Choice Band"], "ability": ["Pickpocket"], "nature": ["Jolly"], "ev spread": [0, 252, 4, 0, 0, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Steel-types", "Faster Pokemon", "Fire-types", "Bulky Pokemon"], "credits": ["Written by Nuked", "Previous versions by Ramses", "Quality checked by Jordy, Lyd,  and Talah", "Grammar checked by NixHex and frostration"]}