{
    "name": "Whimsicott",
    "forms": {
        "Base": {
            "base stats": [
                60,
                67,
                85,
                77,
                75,
                116
            ],
            "types": [
                "Grass",
                "Fairy"
            ],
            "abilities": [
                "Chlorophyll",
                "Infiltrator",
                "Prankster"
            ],
            "tier": [
                "NU"
            ],
            "form": "Base"
        }
    },
    "overview": "Whimsicott can be a major nuisance to both offensive and balance teams alike due to its fantastic Speed stat, passable Special Attack, and well-rounded coverage. Its unique Grass / Fairy typing gives it a plethora of resistances, allowing it to soft check Pokemon such as Vaporeon, Malamar, Scrafty, Passimian, and Guzzlord on offensive teams. Moreover, Whimsicott is also the best form of entry hazard removal on offense with Prankster Defog and great STAB moves to break past common hazard setters such as Druddigon, Seismitoad, Rhydon, and Piloswine. Unfortunately, Whimsicott has a rather average Special Attack stat, thus leaving it helpless against particularly bulky walls like Mega Audino, Type: Null, and Torterra. Whimsicott is also somewhat frail, meaning it is easily revenged killed by most Choice Scarf users like Delphox, Braviary, and Sigilyph as well as Sneasel with Ice Shard.\n",
    "strategies' format": "NU",
    "strategies": [
        {
            "name": "Choice Specs",
            "stats": [
                156,
                153,
                206,
                253,
                187,
                364
            ],
            "type": [
                "Grass",
                "Fairy"
            ],
            "usage": "Whimsicott can afford to switch into weaker resisted moves such as Scrafty's Drain Punch, Blastoise's Scald, and Malamar's Superpower, thanks to its Fairy typing. However, you should be wary of switching into Dark-types too recklessly, as losing Whimsicott's item to Knock Off reduces its power dramatically and makes it substantially less threatening. If you're running U-turn, pivot around early-game if the opponent has bulky counters to Whimsicott such as Type: Null, Wish Delphox, and Silvally-Steel. Alternatively, Switcheroo can be used to cripple a defensive check and render it useless; however, it usually isn't wise to get rid of Whimsicott's item too early, as it is very weak without it.",
            "moves": [
                [
                    "Moonblast"
                ],
                [
                    "Energy Ball"
                ],
                [
                    "Psychic"
                ],
                [
                    "U-turn",
                    "Switcheroo"
                ]
            ],
            "item": [
                " Choice Specs"
            ],
            "ability": [
                "Infiltrator"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        },
        {
            "name": "Life Orb",
            "stats": [
                156,
                153,
                206,
                253,
                187,
                364
            ],
            "type": [
                "Grass",
                "Fairy"
            ],
            "usage": "Use Whimsicott to pulverize Dark-, Water-, Rock-, Ground-, and Fighting-types and annoy offensive teams with its blazing speed and threatening coverage. Whimsicott can pivot into weak Water-type moves from the likes of Blastoise, Vaporeon, and Seismitoad; however, it shouldn't switch in too often, as it is frail and will be constantly losing HP from Life Orb recoil. You can double switch into Stealth Rock setters in order to force them out and freely Defog their entry hazards away, but be wary of being caught by coverage moves such as Rhydon's Rock Blast, Druddigon's Gunk Shot, and Palossand's Shadow Ball. As Defog is given priority by virtue of Prankster, Whimsicott can clear hazards off the field in an emergency situation, even against foes faster than it, such as Choice Scarf Delphox, Choice Scarf Passimian, and Accelgor.",
            "moves": [
                [
                    "Moonblast"
                ],
                [
                    "Energy Ball"
                ],
                [
                    "Psychic"
                ],
                [
                    "Defog"
                ]
            ],
            "item": [
                " Life Orb"
            ],
            "ability": [
                "Prankster"
            ],
            "nature": [
                "Timid"
            ],
            "ev spread": [
                0,
                0,
                0,
                252,
                4,
                252
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                31
            ]
        }
    ],
    "counters": [
        "Steel-types",
        "Poison-types",
        "Flying-types",
        "Specially Bulky Pokemon",
        "Fire-types",
        "Revenge Killers"
    ],
    "credits": [
        "Written by Eternally",
        "Quality checked by banks, Blast,  and allstarapology",
        "Grammar checked by The Dutch Plumberjack and Fireflame479"
    ]
}