{
    "name": "Wishiwashi",
    "forms": {
        "Base": {
            "base stats": [
                45,
                20,
                20,
                25,
                25,
                40
            ],
            "types": [
                "Water"
            ],
            "abilities": [
                "Schooling"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "Base"
        },
        "School": {
            "base stats": [
                45,
                140,
                130,
                140,
                135,
                30
            ],
            "types": [
                "Water"
            ],
            "abilities": [
                "Schooling"
            ],
            "tier": [
                "Untiered"
            ],
            "form": "School"
        }
    },
    "overview": "Wishiwashi has the highest Special Attack stat in the tier, allowing it to 2HKO most Pokemon with its Choice Specs-boosted moves. Given its low Speed stat, great offensive capabilities, and the fact that it functions optimally with HP investment to avoid deactivating its School form, it works best with Trick Room support. While it has a shallow movepool, it has enough coverage to make it difficult to wall with standard Water-resistant Pokemon, as Hidden Power Grass 2HKOes Poliwrath and Silvally-Water, U-turn OHKOes Jynx, and Ice Beam provides coverage against Grass-types like Cradily that are able to switch into a Choice Specs-boosted Hydro Pump. Its vulnerability to entry hazards coupled with its lack of reliable recovery options outside of Rest and Leftovers leaves it liable to being worn down to the point its ability Schooling is deactivated, which in turn causes Wishiwashi to become extremely passive. Even with full HP investment and high defenses, it is unable to take many neutral hits before it's forced out of School forme. Outside of Trick Room, Wishiwashi is very easy to KO or deactivate Schooling, as it's slow, forcing it to take a hit before attacking. Its weakness to common typings in Grass and Electric causes it to lose to Pokemon like Lilligant and Alolan Raichu when Trick Room is not active. Wishiwashi requires a great deal of team support to work well, as it cannot set up Trick Room on its own and greatly benefits from entry hazard removal.\n",
    "strategies' format": "PU",
    "strategies": [
        {
            "name": "Trick Room Sweeper",
            "stats": [
                189,
                76,
                77,
                163,
                86,
                76
            ],
            "type": [
                "Water"
            ],
            "usage": "Try to bring Wishiwashi in safely while Trick Room is active with moves such as U-turn, Healing Wish, and Explosion to prevent Wishiwashi from being taken below 25% HP, deactivating Schooling. Use Wishiwashi early-game to break down the opposing team to enable another teammate such as Crabominable to sweep. Hydro Pump should be used most of the time for its incredible Base Power, and it should only be using its other moves on Pokemon that avoid the 2HKO from Hydro Pump, such as Ludicolo and Alolan Exeggutor. Be wary of using Hydro Pump if the opponent has Pokemon with Water immunities, such as Poliwrath and Jynx, as they can take advantage of Wishiwashi being locked into Hydro Pump. Against these Pokemon, it's a good idea to use U-turn to scout the opponent's reaction and preserve momentum, as Trick Room is a hyper offensive playstyle and cannot afford to lose momentum. If Wishiwashi is about to reach 25% health and transform out of School forme, it is better to sacrifice it so it doesn't become setup fodder for the opposing team unless Wishiwashi has access to Healing Wish from Pokemon such as Mesprit and Audino. Schooling only activates at the end of the turn, so even if Wishiwashi is brought below 25% health, it is still able to act in its School forme for that turn.",
            "moves": [
                [
                    "Hydro Pump"
                ],
                [
                    "Ice Beam"
                ],
                [
                    "Hidden Power Grass"
                ],
                [
                    "U-turn"
                ]
            ],
            "item": [
                " Choice Specs"
            ],
            "ability": [
                "Schooling"
            ],
            "nature": [
                "Quiet"
            ],
            "ev spread": [
                252,
                0,
                4,
                252,
                0,
                0
            ],
            "iv spread": [
                31,
                31,
                31,
                31,
                31,
                0
            ]
        }
    ],
    "counters": [
        "Water-immune Pokemon",
        "Grass-type Pokemon",
        "Faster Pokemon"
    ],
    "credits": [
        "Written by LzzzR",
        "Quality checked by Taskr, yogi,  and 2xTheTap",
        "Grammar checked by martha and The Dutch Plumberjack"
    ]
}