{"name": "Wynaut", "forms": {"Base": {"base stats": [95, 23, 48, 23, 48, 23], "types": ["Psychic"], "abilities": ["Shadow Tag", "Telepathy"], "tier": ["LC"], "form": "Base"}}, "overview": "Wynaut is the only Pokemon with Shadow Tag in the current LC metagame, which allows it to trap any non-Ghost-type Pokemon. What separates it from the other trappers in LC is that it boasts an amazing base 95 HP stat, one of the highest in the tier, compensating for its otherwise mediocre defensive stats. However, due to its poor movepool with very few useful options in Counter, Mirror Coat, Encore, Safeguard, and Tickle, its offensive value is null. Thanks to Wynaut's great HP stat, Counter and Mirror Coat will almost always result in OHKOs or 2HKOs, and Encore alongside to Shadow Tag can give defensive threats problems. Unfortunately, Wynaut lacks the Speed required to reliably pull off its status moves, and it also lacks recovery, besides Berry Juice. While Psychic is a good defensive typing that allows Wynaut to take Fighting-type attacks, it makes it vulnerable to Knock Off, which is very common, and U-turn, which significantly damages Wynaut and makes its ability to trap Pokemon useless.\n", "strategies' format": "LC", "strategies": [{"name": "Trapper", "stats": [265, 73, 181, 82, 165, 85], "type": ["Psychic"], "usage": "If Wynaut is facing a Foongus or Mareanie, use Safeguard to protect it from status, and if either foe has used a status attack, use Encore on it. This makes them useless, and Wynaut can either PP stall them if they are slower or use free turns to switch to a sweeper and set up in order to KO them. Before Wynaut comes in, it is recommended to KO Ghost-types like Gastly and Pumpkaboo, as well as Pursuit trappers like Pawniard, Alolan Grimer, and Stunky, as they hinder Wynaut. Wynaut should enter versus slow, passive, and bulky Pokemon, due to its passivity and low Speed. Wynaut mustn't be sent in even against attacks that it resists. Instead, it should be sent in to revenge kill and hinder its foe, having full health if possible. If it faces a setup sweeper that is faster than it, Wynaut should use Encore as soon as possible and switch to a Pokemon that can beat it easily. If the setup sweeper is slower, switch to a Pokemon that can take its attacks after the boost. Use Encore to trap a foe into a move like Stealth Rock, and then bring in a setup sweeper or use Tickle to reduce the foe's offensive stats in order to obtain setup opportunities.", "moves": [["Counter"], ["Mirror Coat"], ["Encore"], ["Tickle", "Safeguard"]], "item": [" Berry Juice"], "ability": ["Shadow Tag"], "nature": ["Bold"], "ev spread": [156, 0, 132, 0, 132, 12], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Dark-types", "Ghost-types", "Knock Off", "Taunt Users", "VoltTurn users"], "credits": ["Written by Altariel von Sweep", "Quality checked by tahu, Xayah,  and Coconut", "Grammar checked by talkingtree and The Dutch Plumberjack"]}