{"name": "Yanmega", "forms": {"Base": {"base stats": [86, 76, 86, 116, 56, 95], "types": ["Bug", "Flying"], "abilities": ["Frisk", "Speed Boost", "Tinted Lens"], "tier": ["RU"], "form": "Base"}}, "overview": "Thanks to Tinted Lens making Yanmega's STAB moves a lot more spammable, it can act as an fantastic Choice Specs wallbreaker against bulkier and slower teams. Yanmega also has access to Speed Boost, which makes it a solid sweeper against frailer offensive teams, which generally don't carry the means to properly deal with it defensively nor offensively. Yanmega's typing is pretty bad defensively, however, as it leaves Yanmega weak to common offensive Fire-, Ice-, Electric-, Rock-, and Flying-types like Salazzle, Mega Glalie, Raikou, Rhyperior, and Ninetales. Its typing also gives it a hefty weakness to Stealth Rock, which cuts away 50% of its health upon switching in.\n", "strategies' format": "RU", "strategies": [{"name": "Choice Specs", "stats": [208, 169, 208, 331, 149, 317], "type": ["Bug", "Flying"], "usage": "Use Yanmega to punch holes into bulky teams and clear the path for teammates to clean up. This Yanmega set wants to be spamming Bug Buzz, but it may be more beneficial to use Air Slash or Giga Drain when the opponent has certain Pokemon such as Toxicroak and Rhyperior. U-turn should be used minimally and only if Yanmega is forcing a switch and it is beneficial to gain momentum instead of firing off an attack. Prevent Yanmega from switching into Stealth Rock, as this will significantly damage it, putting it in KO range of a lot of attacks.", "moves": [["Bug Buzz"], ["Air Slash"], ["U-turn"], ["Giga Drain"]], "item": [" Choice Specs"], "ability": ["Tinted Lens"], "nature": ["Timid"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Speed Boost Sweeper", "stats": [208, 169, 208, 364, 149, 289], "type": ["Bug", "Flying"], "usage": "Yanmega should be used as a wincon against frailer, more offensively oriented teams and can also be used as a late-game cleaner against bulkier teams. Use Protect to get a free Speed boost whenever attempting to sweep with Yanmega unless it is against Pokemon like Feraligatr because they might use the free turn to set up. Try to keep Yanmega healthy early-game, only bringing it in whenever it can revenge kill a weakened Pokemon. Prevent Yanmega from switching in to Stealth Rock, as this will significantly damage it, putting it in KO range of a lot of attacks, even its own Life Orb recoil if it has to fire off five attacks. Yanmega has trouble taking even neutral hits because of its rather lacking defensive stats, so prevent it from taking too much unnecessary damage.", "moves": [["Protect"], ["Bug Buzz"], ["Air Slash"], ["Giga Drain"]], "item": [" Life Orb"], "ability": ["Speed Boost"], "nature": ["Modest"], "ev spread": [0, 0, 0, 252, 4, 252], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Specially Defensive Walls", "Stealth Rock", "Snorlax", "Steel-types"], "credits": ["Written by Jordy", "Quality checked by Phantom, Avocado,  and Teachable", "Grammar checked by Martha and Cryo Gyro"]}