{"name": "Zapdos", "forms": {"Base": {"base stats": [90, 90, 85, 125, 90, 100], "types": ["Electric", "Flying"], "abilities": ["Pressure", "Static"], "tier": ["OU"], "form": "Base"}}, "overview": "Wonderful typing, reliable recovery, and a solid base stat total make Zapdos a solid defensive OU threat. Zapdos's niche is how hard it is to deal with for many offensive teams; staples to this archetype such as Supersonic Skystrike Landorus-T, Tornadus-T, Mega Scizor, Hawlucha, Mega Lopunny, and Serperior struggle to get past it, and with Zapdos's coverage, it's quite difficult to switch into for these teams. Its weakness to Stealth Rock does limit it, though, forcing it to use Roost excessively or simply rendering it unable to counter what it ought to for the duration of the match. Zapdos is a decent Defogger, however its weakness to Stealth Rock and its poor matchup versus a number of prominent hazard setters in the tier like Heatran and Mega Tyranitar mean it can struggle at times.\n", "strategies' format": "OU", "strategies": [{"name": "Defensive", "stats": [278, 194, 292, 286, 216, 241], "type": ["Electric", "Flying"], "usage": "Static is an option for an ability on this set; however, Pressure has a lot of benefit with stalling out PP from moves such as Stone Edge. Static has the added benefit of punishing Pokemon that attack with contact moves such as Kartana and Gyarados.", "moves": [["Discharge"], ["Roost"], ["Heat Wave"], ["Defog"]], "item": [" Leftovers"], "ability": ["Pressure"], "nature": ["Bold"], "ev spread": [248, 0, 240, 0, 0, 20], "iv spread": [31, 31, 31, 31, 31, 31]}, {"name": "Roost + 3 Attacks", "stats": [278, 194, 253, 286, 216, 279], "type": ["Electric", "Flying"], "usage": "Zapdos should be used as a switch-in the Pokemon it can effectively deal with. These include Landorus-T, Ferrothorn, Tangrowth, Tornadus-T, Celesteela, Mega Scizor, Mega Pinsir, and Jirachi. Because Zapdos doesn't hit all that hard, it's generally better to stay healthy throughout the match and use Roost constantly. This will capitalize on Zapdos's ability to prevent a large swath of threats from seriously harming your team. When the opportunity to attack presents itself, consider just using Discharge instead of the super effective attack on the threat Zapdos is currently handling. Because Zapdos relies on super effective damage, and has a fairly predictable moveset, often opponents will switch comfortably into a Pokemon that Zapdos cannot hit super effectively, like Heatran, Mega Tyranitar, or Clefable. Discharge's paralysis chance is Zapdos's best chance at punishing these switch-ins.", "moves": [["Discharge"], ["Hidden Power Ice"], ["Heat Wave"], ["Roost"]], "item": [" Leftovers"], "ability": ["Pressure"], "nature": ["Timid"], "ev spread": [248, 0, 188, 0, 0, 72], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Mega Charizard X", "Tyranitar", "Kyurem-B", "Chansey", "Ground-types"], "credits": ["Written by Ash Borer and Mellow", "Quality checked by Gary, Finchinator,  and p2", "Grammar checked by P Squared and GatoDelFuego"]}