{"name": "Zigzagoon", "forms": {"Base": {"base stats": [38, 30, 41, 30, 41, 60], "types": ["Normal"], "abilities": ["Gluttony", "Pickup", "Quick Feet"], "tier": ["LC"], "form": "Base"}}, "overview": "In Little Cup, Zigzagoon can act as an effective physical sweeper thanks to its access to the amazing combination of Belly Drum to maximize its Attack in an instant and Extreme Speed to outprioritize its foes and KO them. Unfortunately, it is hindered by its numerous flaws such as its poor bulk, which makes it struggle to set up Belly Drum reliably. Zigzagoon also requires excessive team support to perform its role with success, and without this, many Pokemon are able to get in the way of its sweep. In most games, Zigzagoon tends to either win the battle for its team with a successful sweep or fail to contribute anything at all.\n", "strategies' format": "LC", "strategies": [{"name": "Belly Drum Sweeper", "stats": [145, 159, 145, 86, 125, 165], "type": ["Normal"], "usage": "Zigzagoon is best used towards the end of the battle once its checks and counters have been removed so that it can sweep without trouble. Zigzagoon should refrain from switching in on attacks because it has very low defensive stats and it can be difficult to set up once Berry Juice has been consumed. This means Zigzagoon should be brought in to battle via a free switch from the likes of a slow VoltTurn user or immediately after a teammate has fainted. Additionally, Zigzagoon should wait for an opportune time to set up. This is usually when the foe cannot stop Zigzagoon from using Belly Drum, KO Zigzagoon, or burn Zigzagoon.", "moves": [["Belly Drum"], ["Extreme Speed"], ["Thief"], ["Seed Bomb", "Protect"]], "item": [" Berry Juice"], "ability": ["Pickup"], "nature": ["Adamant"], "ev spread": [132, 196, 108, 0, 28, 36], "iv spread": [31, 31, 31, 31, 31, 31]}], "counters": ["Faster Ghost-type Pokemon", "Steel-type Pokemon", "Rock-type Pokemon", "Very Bulky Pokemon", "Burns", "Taunt Users"], "credits": ["Written by MeButYou82", "Quality checked by Fiend, tahu,  and Berks", "Grammar checked by P Squared and The Dutch Plumberjack"]}